[
  {
    "fullTicker": "PAR:USA",
    "baseTicker": "PAR",
    "rank": 4.6102,
    "description": "PAR Technology Corporation, together with its subsidiaries, provides omnichannel cloud-based hardware and software solutions to the worldwide. The company offers PUNCHH, an enterprise-grade customer loyalty and engagement solution; PAR ORDERING, an e-commerce platform; PAR RETAIL, a digital engagement software solution; and PLEXURE, an international customer engagement and loyalty platform under the ENGAGEMENT CLOUD. It also provides PAR POS, a point-of-sale solution; TASK, an enterprise-grade technology solution; PAR OPS, which includes Data Central and Delaget; and PAR PAY, such as PAR payment services, and merchant services under the OPERATOR CLOUD. In addition, the company offers point-of-sale terminals and tablets, wireless headsets, drive-thru systems, kitchen display systems, kiosks, printers, payment devices, and other in-store peripherals. Further it provides services, such as hardware repair, installation and implementation, training, and on-site and technical support services. It serves enterprise restaurants, franchisees, and other restaurant outlets and to C-Stores; and other retail customers, including amusement parks, cinemas, cruise lines, spas, casinos, and other ticketing and entertainment venues. The company was founded in 1968 and is headquartered in New Hartford, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/ySie-fAOKjM7FNRYsNmsSw/jNKx-pI56grbZdLJ-312zyvCzcl8yx4ZKIvGh0FpJVAzKN-Un7sxflED5-IChj0ihP5GnlP9I24cJa8vMgBHaADI1m_oy22uuutqK4YgGWYnMEaO-oL1gcWSkYnUw6gz4UyBWJB2GUwIjk-6tZK0zwLBXeldVhTtVGclyah4HsrkOZEp_AubmrQhvDhLY1T0/uz-ua_IjHLAzlJFSYIFIU7FtCMS-xe191Q2g5ZAA4aU",
    "price": 37.01,
    "prevClose": 38.42,
    "absReturn": -1.4100000000000037
  },
  {
    "fullTicker": "ZURA:USA",
    "baseTicker": "ZURA",
    "rank": 8.2821,
    "description": "Zura Bio Limited, a clinical-stage biotechnology company, focuses on developing novel medicines for immune and inflammatory disorders. It develops Tibulizumab, an IgG-scFv bispecific dual-antagonist antibody engineered by the fusion of ixekizumab and tabalumab that neutralizes IL-17A and BAFF, which is in Phase 2 clinical trial development; ZB-168, a monoclonal antibody that binds and neutralizes the IL-7 receptor chain that impact on diseases driven by IL7 and thymic stromal lymphopoietin immune pathways; and Torudokimab, a monoclonal antibody that neutralizes IL33, which is in Phase 2 clinical trial development. The company is based in Henderson, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/v0aXJ6lTnDdMi2i5t4AF0w/mmWNCLjsoMpQp7KKQ781IvkbiA8pLMIqhcbJgleTf9q2XUyNRY_TRbAMln-tbazU8xwTwOKi0wI1MSsDENsneCHEv1p4MvI_r73NBpKuisjgjaSGXoqbaW-wvDRyUpKIs1obNx64POP6_dcgx2Qb_VMfY8La8j255EAFUqHlkoNO6eOdKZ5JvMDUdwesqUrb/ObBCYu9hKx1108s8qels3-n9-vIXyAZatJ9qqFbPiOY",
    "price": 4.81,
    "prevClose": 4.69,
    "absReturn": 0.11999999999999922
  },
  {
    "fullTicker": "LOW:USA",
    "baseTicker": "LOW",
    "rank": 16.0628,
    "description": "Lowe's Companies, Inc., together with its subsidiaries, operates as a home improvement retailer in the United States. It provides a line of products for construction, maintenance, repair, remodeling, and decorating. The company also offers home improvement products, such as appliances, seasonal and outdoor living, lumber, lawn and garden, kitchens and bath, hardware, building materials, millwork, paint, rough plumbing, tools, electrical, flooring, and décor. In addition, it offers installation services through independent contractors in various product categories; and extended protection plans and repair services. The company sells its national brand-name merchandise and private brand products to professional customers, individual homeowners, and renters. The company also sells its products through Lowes.com website, as well as through mobile applications. Lowe's Companies, Inc. was founded in 1921 and is based in Mooresville, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/IEoDpdMRJtgiJt0GVagHYQ/-sqViRcIt_1-eQan85gX_skLEv19VBLTu50hdqYVra6a4wN6GzDNa4KdooYo1Hg8aFHi71G-VBgVKn1Xo7Fa9UM4YJOKIW-hUSN6UmOwp_ChIonNKdpSanOWlSbFmo1MuU49FfxPl6MHN68QhbCAl3YU4ZE2CRcR52Ga7lJp-kUZRRpuybjr1aRsQ4yRitt3/2RMzVC9fVEocqLtDu2AzzhgWRVx0XNYKQ2gpLE4XVpM",
    "price": 277.55,
    "prevClose": 277.01,
    "absReturn": 0.5400000000000205
  },
  {
    "fullTicker": "AXSM:USA",
    "baseTicker": "AXSM",
    "rank": 32.0932,
    "description": "Axsome Therapeutics, Inc., a biopharmaceutical company, engages in developing and delivering novel therapies for the management of central nervous system (CNS) disorders in the United States. The company's commercial product portfolio includes Auvelity (dextromethorphan-bupropion), a N-methyl-D-aspartate receptor antagonist, sigma-1 receptor agonist, aminoketone, and CYP2D6 inhibitor indicated for the treatment of major depressive disorder; Sunosi (solriamfetol), a dopamine and norepinephrine reuptake inhibitor, trace amine-associated receptor 1 agonist, and 5-HT1A agonist indicated for the treatment of excessive daytime sleepiness in patients with narcolepsy or obstructive sleep apnea; and Symbravo (MoSEIC meloxicam rizatriptan), or AXS-07, a rapidly absorbed, multi-mechanistic, selective COX-2 inhibitor, and 5-HT1B/1D agonist indicated for the acute treatment of migraine with or without aura. It is also developing AXS-05 (dextromethorphan-bupropion), an investigational N-methyl-D-aspartate receptor antagonist, which has completed Phase III clinical trial to treat Alzheimer's disease agitation, as well as that has completed phase II clinical trial for the treatment of smoking cessation; AXS-12 (reboxetine), a highly selective and potent norepinephrine reuptake inhibitor, which has completed Phase III trial to treat narcolepsy; AXS-14 (esreboxetine), a selective and potent norepinephrine reuptake inhibitor that has completed Phase III trial for the treatment of fibromyalgia and other conditions; and Solriamfetol, a dopamine and norepinephrine reuptake inhibitor, which is in Phase III trial for treating attention deficit hyperactivity, major depressive, binge eating, and excessive sleepiness associated with shift work disorder. The company has a research collaboration agreement with Duke University for evaluating AXS-05 in a Phase 2 clinical trial in smoking cessation. Axsome Therapeutics, Inc. was incorporated in 2012 and is based in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/o9l8Kdjs4bvk69ZLKUi0GQ/mP3dEPsAoN3Tx9jEW1t7iGnB67DnHJgwB1xz4nQctlqlBbUjaWGEaDt8W1fPXbZtcgbxvFL7Xirr1GllPk17tAp6bbSIhezBJqbjLw0LfbJ7H_gbikH0NfmdYzvRz9SH9dB9AEFNjd7BVL1ZXL8ajKDlVJRWtbXVlrruraWEYzabghNIsj3mvzWLUhY09SSe/7aqTZhEQ8s3EiMctaqsjIQ8OVmhdd8v8VzI4as8C6_8",
    "price": 177.27,
    "prevClose": 174.14,
    "absReturn": 3.130000000000024
  },
  {
    "fullTicker": "MCRB:USA",
    "baseTicker": "MCRB",
    "rank": 39.3562,
    "description": "Seres Therapeutics, Inc., a microbiome therapeutics company, develop microbiome therapeutics to treat the modulation of the colonic microbiome. It develops a novel class of biological drugs that are designed to treat by modulating the microbiome to restore health by repairing the function of a disrupted microbiome to a non-disease state. The company's lead product candidate is VOWST, an oral microbiome therapeutic that has completed Phase III clinical trial for the treatment of recurrent Clostridioides difficile infection. Its product pipeline also includes SER-155, an investigational oral fermented microbiome therapeutic which is in Phase 1b clinical trials for the treatment of gastrointestinal infections, bacteremia, and graft versus host disease in immunocompromised patients including patients receiving allogeneic hematopoietic stem cell transplantation. In addition, the company engages in the development of SER-287 which is in Phase 2b and SER-301 that is in Phase 1b to treat ulcerative colitis. Further, it has license Agreement with NHSc Rx License GmbH for the therapeutic products based on the microbiome technology, which includes VOWST product candidate, which is developed for the treatment of CDI and recurrent CDI; and collaboration license agreement with Société des Produits Nestlé S.A. (Nestlé) for the development and commercialization of certain product candidates for the treatment and management of CDI and inflammatory bowel disease including UC and Crohn's disease. The company was formerly known as Seres Health, Inc. and changed its name to Seres Therapeutics, Inc. in May 2015. Seres Therapeutics, Inc. was incorporated in 2010 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/ecSYCjaIHU-R1ZFR5-i7sA/ylCNkAMrp4re1tXa47xGtHFQOEL-PyizC-Nzcw_OfyOFwZq-tI2MIxqqlxK67AZtKbcubciVGeTpEV8qCJjp4IQ43XdD0oa0k8YnGiRHAAi8zQVn13UL70bRgpjOobCB-gUYSiFI3ojRf01rHdZVzTtKTPTZppNtuT9dKQXCJG53q6LSmK2AKbH1AThw4Vqo/piYDGzWTY5ggER47zlNemh1AQ6QH20r3degPXn6o6FE",
    "price": 15.96,
    "prevClose": 15.18,
    "absReturn": 0.7800000000000011
  },
  {
    "fullTicker": "CGEN:USA",
    "baseTicker": "CGEN",
    "rank": 46.2957,
    "description": "Compugen Ltd., a clinical-stage therapeutic discovery and development company, engages in the research, development, and commercialization of therapeutics and product candidates in Israel, the United States, and Europe. The company's pipeline consists of COM701, an immuno-oncology pipeline program with an anti-PVRIG antibody; COM902, a therapeutic anti-TIGIT antibody, are in Phase 1 clinical trials and have been evaluated for the treatment of solid tumors as a monotherapy and in combination of PVRIG/PD-1 and PVRIG/TIGIT, as well as PVRIG/PD-1/TIGIT blockade; Bapotulimab, a therapeutic antibody targeting ILDR2 that is evaluated in Phase I clinical trials in patients with naïve head and neck squamous cell carcinoma; and Rilvegostomig, a novel anti-TIGIT/PD-1 bispecific antibody, which is in Phase III clinical study in patients with advanced or metastatic non-small cell lung cancer. Its preclinical therapeutic pipeline also includes early-stage immuno-oncology programs focused to address various mechanisms of immune resistance; and COM503, high affinity antibody, which blocks the interaction between IL-18 binding protein and IL-18. The company has collaboration agreement with Bristol-Myers Squibb to evaluate the safety and tolerability of COM701 in combination with Bristol-Myers Squibb's PD-1 immune checkpoint inhibitor Opdivo in patients with advanced solid tumors. It has license agreement with AstraZeneca for the development of bi-specific and multi-specific immuno-oncology antibody products; and Gilead Sciences, Inc. for the research, development, manufacturing, and commercialization of COM503 and other products. Compugen Ltd. was incorporated in 1993 and is headquartered in Holon, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/Olaf5m52KemW0mJoF0lfeQ/MpYYrApDMtoihRdFHLuJVrJtVoFPX_oxOCbVMHGO1WL3uU7uyP6_f1_Nj1L5odXqY_rO34F6K59ZHuw9IcU7ZTN49dOGZYU-GCAGttSQLOvh67P5SVO4anBbZrZ6DmA-PRwJNN01y76w5-cor5lGKeQMILSWF8p7MWuMbwjgJbc/f-J5oCJZde1UPJ3IA9ynA0NZoOr6Fv-F0vRA_2pki50",
    "price": 2.36,
    "prevClose": 2.11,
    "absReturn": 0.25
  },
  {
    "fullTicker": "ASTE:USA",
    "baseTicker": "ASTE",
    "rank": 64.3643,
    "description": "Astec Industries, Inc. designs, engineers, manufactures, markets, and services equipment and components used primarily in road building and related construction activities worldwide. The company operates in two segments, Infrastructure Solutions and Materials Solutions. The Infrastructure Solutions segment offers asphalt plants and related components, heaters, concrete dust control systems, asphalt pavers, vaporizers, concrete material handling systems, screeds, heat recovery units, paste back-fill plants, asphalt storage tanks, hot oil heaters, bagging plants, fuel storage tanks, industrial and asphalt burners and systems, blower trucks and trailers, material transfer vehicles, soil stabilizing-reclaiming machinery, wood chippers and grinders, milling machines, soil remediation plants, control systems, pump trailers, concrete batch plants, liquid terminals, storage equipment and related parts, polymer plants, concrete mixers, cold central plant recycle systems, industrial automation controls, and telematics platforms, as well as service, construction and retrofits, and engineering and environmental permitting services. The Materials Solutions segment designs and manufactures crushing equipment, mobile plants, bulk material handling solutions, vibrating equipment, screening equipment, electrical control centers, modular plants and systems, conveying equipment, plant automation products, portable plants, and mineral processing equipment, as well as offers consulting and engineering services. It provides its products to asphalt or concrete producers; highway and heavy equipment contractors; utility contractors; sand and gravel producers; construction, demolition, recycle and crushing contractors; forestry and environmental recycling contractors; mine and quarry operators; port and inland terminal authorities; power stations; and domestic and foreign government agencies. The company was incorporated in 1972 and is headquartered in Chattanooga, Tennessee.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/9lYHN7xhA0SY5eo6_lvjGw/pCH--cB9UszeBDNy-0UE2a0kIZYIWe-NBDSvPs6zytGUoRt_ncoG0Fuwb8rMUHAMKVrx4MuWiqxUTTiaImaleCO93thGC7ynrsDzMkfkOAHfgC68Tv75hmRsQlEVBUvpFJd80Z24N9lohPE5SO0o4UAsVZ4VzkjTAICSGdk7NGaiXedjZwUml80dM9zgm8Bb/UCYgp12DpFOH4k3pYnLM_2EBpTyDTbembdr7-TDNVXA",
    "price": 49.1,
    "prevClose": 49.03,
    "absReturn": 0.07000000000000028
  },
  {
    "fullTicker": "KRT:USA",
    "baseTicker": "KRT",
    "rank": 70.6406,
    "description": "Karat Packaging Inc., together with its subsidiaries, engages in the manufacture and distribution of single-use disposable products in plastic, paper, biopolymer-based, and other compostable forms used in various restaurant and foodservice settings. It offers food and take-out containers, bags, boxes, tableware, cups, lids, cutlery, straws, specialty beverage ingredients, gloves, utensils, janitorial and warehouse supplies, and other products under the Karat Earth brand. The company also distributes food and beverage items, such as syrups, boba tea, and coffee drinks; and provides new product development, design, printing, and logistics services. It offers its products to national and regional distributors, restaurant chains, retail establishments, and online customers. The company was founded in 2000 and is based in Chino, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/P917gL3VvbCRe1SGASQkoQ/fl4zOoQSz9_ZkQ-iLG76jbtXtXIgwXpR2KPjMtxx4Me_JO6ejJWFVrjOHAW6F5KUWN4qzlyMB43RTBlDuXP4YNKrEakpYs_IXCbk-SVAnWD1s2qOJWjAYcpEqrnJEF86eIKAabkg6w7lauCVEvi_JG5AREYxTC7JYC0hSxeudXBGp5XQvNhcjV_Mk9oAXtKG/sF0IxcnHkDBSmWR9FsoBjXErVRS35XkqOCcIwF8GEPQ",
    "price": 24.95,
    "prevClose": 25.01,
    "absReturn": -0.060000000000002274
  },
  {
    "fullTicker": "PTC:USA",
    "baseTicker": "PTC",
    "rank": 80.0388,
    "description": "PTC Inc. operates as software company in the Americas, Europe, and the Asia Pacific. The company provides Windchill, a suite that manages all aspects of the product development lifecycle(PLM) that provides real-time information sharing, dynamic data visualization, collaborate across geographically distributed teams, and enabling manufacturers to elevate product development, manufacturing, field service, and end-of-life processes; ThingWorx, an Industrial Internet of Things software; ServiceMax, a service lifecycle management solutions enable companies to asset uptime with optimized in-person and remote service and technician productivity with mobile tools, and deliver metrics; and Arena, a SaaS PLM solution enables product teams to collaborate virtually to share product and quality information with internal teams and supply chain partners and deliver products to customers. It offers Codebeamer, an application lifecycle management for products and software development; Servigistics, a service parts management solution; and FlexPLM, a platform for merchandising and line planning, materials management, sampling, and others. In addition, it offers Kepware, an enterprise industrial connectivity solution; Creo, a 3D CAD technology enables the digital design, testing, and modification of product models; and Onshape, a SaaS product development platform that delivers computer-aided design with data management, collaboration tools, and real-time analytics. Further, it offers Vuforia, an augmented reality (AR) software; and Arbortext, a dynamic publishing solution streamlines how organizations create, manage, and publish technical documentation. PTC Inc. was incorporated in 1985 and is headquartered in Boston, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/aGkYPl-Pp_ZTiHctTUQjYA/Bj9r-L9_CWZXjDr3bZCRXvFlrsZrr-Jmv1jNfxfnSb7DSkhLmSQOtWSOQMGfJc1u1cWd48zNVxVHcKBx-cVc4cGdhJDx0sT3kxzGQl0whbPl8nakyuAqF-Ra8kMZNvV04ktqJjtt_a9eZITJczP-c9vjm4WVSCYKatj0e_2l9vY/zq-aghmpArX3Yr_xX8PA18gvLl08bQgOD-0d_GGj53g",
    "price": 166.75,
    "prevClose": 166.89,
    "absReturn": -0.13999999999998636
  },
  {
    "fullTicker": "ESEA:USA",
    "baseTicker": "ESEA",
    "rank": 99.3853,
    "description": "Euroseas Ltd. provides ocean-going transportation services worldwide. The company owns and operates containerships that transport dry and refrigerated containerized cargoes, including manufactured products and perishables. As of March 31, 2024, it had a fleet of 20 containerships with a cargo carrying capacity of approximately 777,749 dwt. The company was incorporated in 2005 and is based in Marousi, Greece.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768896000000/gUzJUUIcabaVMk0w0ytIOQ/OQGxQNyB8HVHyCbva8uchDhMVW4z8L35CEw2Mk-SFNvOmJ42DXuLfZOci_Ur0o8YYeKydsd5jMLVrJIhE_hHcO-0CZZQzT0N5AlVcweT6isbRP_3dgaOxvrR_wwgaraI-k7xDtiJzKb5rUmU2cg_SXHPSzG8VGrZHWxWZdiGZDM/dZ-Su27c5BbmgVwttGacwEF1I2_ExM2UHCSjyJ8Ro5c",
    "price": 53.87,
    "prevClose": 55.15,
    "absReturn": -1.2800000000000011
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 691.66,
    "prevClose": 692.24,
    "absReturn": -0.5800000000000409
  }
]