[
  {
    "fullTicker": "NCPL:USA",
    "baseTicker": "NCPL",
    "rank": 3.4387,
    "description": "Netcapital Inc. operates as a fintech company with a technology platform that allows private companies to raise capital online and provides private equity investment opportunities to investors. The company's Netcapital Advisors provides marketing and strategic advice and takes equity positions in select companies; Netcapital.com, an SEC-registered funding portal that enables private companies to raise capital online, as well as allows investors to invest from anywhere in the world. It also provides various services, including automated onboarding process and filing of required regulatory documents; compliance review; custom-built offering page on its portal website; email marketing; third party transfer agent and custodial services; and rolling closes which provides access to liquidity before final close date of offerings, as well as assistance with annual fillings and direct access to team for ongoing support. In addition, the company offers advisor services, which includes incubation of technology start-ups; investors introduction; online marketing; website, design, and software development; message crafting including pitch decks, offering pages, and ad creation; strategic advice; and technology consulting services. Netcapital Inc. is based in Boston, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/0udReP9W9L4yyoB2qpsLzQ/x0w1tJ3hyvCTyhkkpvpN-2VNOsG5mII1zMQJrRTKeBY82slyDVufYqVEnRw1O5tI3gD-ZzUrL107XTa2rPQ7lQS7gTKCY3zacFp82Q8CB6nZMIUuI8cUNgipRIx1cWtCOXgB_BOhFWXzDJYSCAz9gkuNQaxLClN7eHCtXMWT0PRWaWnL_huTE1K3xRL-M6PQ/pwgavkCDQ0kQabt35uv2HzxkeuhamZ3Ar897zFtEuoE",
    "price": 2.42,
    "prevClose": 2.38,
    "absReturn": 0.040000000000000036
  },
  {
    "fullTicker": "MFI:USA",
    "baseTicker": "MFI",
    "rank": 10.0225,
    "description": "mF International Limited, a holding company, engages in the research and development, and sale of financial trading solutions through the Internet or as a platform as a service in Hong Kong, mainland China, and Southeast Asia. It offers real-time mission critical forex, bullion/commodities trading platform solutions, financial value-added services, mobile applications, and financial information for brokers and institutional clients; and various services, including mF4 trading platform, bridge and plugins, customer relationship management system, electronic communication network system, liquidity solutions, cross-platform Broker+ solution, social trading applications, and other value-added services. The company also provides liquidity providers related services and other financial value-added services; and engages in the business of algorithm trading research and development, and investment activities. It serves financial institutions, including brokers, investment banks, institutional clients, liquidity providers, and financial services providers. The company was founded in 2002 and is headquartered in Wan Chai, Hong Kong. mF International Limited operates as a subsidiary of Gaderway Investments Limited.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/vpbJdFeCG8qHY92z_r9dew/GscehtBtMWi4CBZrZJCs4qG8gOIICfC7v7WJHkZn4pxeIGjT1ug7QwQmD4rozm16c0FEhluYR5g-WixuQ7jBGc_fXsdhy5ho0JXsTJGwyXmQGAuvadaXBpqRKHzMt_64XhfSs2soh-s3igg8tXnZ_eIR8X-xD67H4oz28bbQb2s/W6ZFlMChRUDWdRPPXEOJV40W6RG-_KiZS4sC26SPPVo",
    "price": 39.74,
    "prevClose": 41.01,
    "absReturn": -1.269999999999996
  },
  {
    "fullTicker": "CNSP:USA",
    "baseTicker": "CNSP",
    "rank": 19.8548,
    "description": "CNS Pharmaceuticals, Inc., a clinical pharmaceutical company, engages in the development of anti-cancer drug candidates for the treatment of brain and central nervous system tumors. The company's lead drug candidate is Berubicin, which completed Phase I clinical trial that is used for the treatment of glioblastoma multiforme. CNS Pharmaceuticals, Inc. has license agreements with Houston Pharmaceuticals, Inc. and The University of Texas M.D. Anderson Cancer Center, as well as a collaboration and asset purchase agreement with Reata Pharmaceuticals, Inc. The company was incorporated in 2017 and is based in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/h8PqmD8dgZJPdODFMICZXQ/E_yzYBlFFMck36WsiKx05qTIH_mPtBTwrrfrQHm3QZjCLSMT0qScprXNKvdkR7DOnEo0UW8CQ495QbCrGpLCsAH26mGpeMtingoxvVzltaeQmU9Xg2G6s0wtaoVkx2FDOkziLxCNGvnADO9e280JesWe-7AWXFgKDlrvKHcHZaVqgzt8o6EgVseP8t9L49G-/f9akTPMsj6rlFIM82MTM1yw-wV0Cxu8KGy6Lh5wo-BE",
    "price": 7.98,
    "prevClose": 8.74,
    "absReturn": -0.7599999999999998
  },
  {
    "fullTicker": "ETR:USA",
    "baseTicker": "ETR",
    "rank": 25.1426,
    "description": "Entergy Corporation, together with its subsidiaries, engages in the production and retail distribution of electricity in the United States. It generates, transmits, distributes, and sells electric power in portions of Arkansas, Louisiana, Mississippi, and Texas, including the City of New Orleans; and distributes natural gas. It also engages in the ownership of interests in non-nuclear power plants that sell electric power to wholesale customers, as well as provides decommissioning services to other nuclear power plant owners. It generates electricity through gas, nuclear, coal, hydro, and solar power sources. The company sells energy to retail power providers, utilities, electric power co-operatives, power trading organizations, and other power generation companies. The company's power plants have approximately 25,000 megawatts of electric generating capacity. It delivers electricity to 3 million utility customers in Arkansas, Louisiana, Mississippi, and Texas. Entergy Corporation was founded in 1913 and is headquartered in New Orleans, Louisiana.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/xeXigX_q2K8SRkmX87jUmA/4PIeaWcJT7c_ghw0Apt3S4P24OTUp-MIKkWF-rg6dnSXq6Jw1k43atN9AVs60Ck4jLgvHnUKsB94iUVyC1CheKTuYw4OacWeFntk30r7ZgCbkX3Cekp8eAMbUEiUSah03kun2yCMe6LP5lfAWy7Yksv1FItYDB3xHDfrWv9p-cQ/8MQ-Ug2m2CKoRBr2PqF01bx0cE-bGh6V_RNOv0MGgTQ",
    "price": 88.67,
    "prevClose": 87.83,
    "absReturn": 0.8400000000000034
  },
  {
    "fullTicker": "THS:USA",
    "baseTicker": "THS",
    "rank": 36.9622,
    "description": "TreeHouse Foods, Inc. manufactures and distributes private brands snacks and beverages in the United States and internationally. The company provides snacking products, such as crackers, pretzels, in-store bakery items, frozen griddle items, cookies, and candies; and beverage and drink mixes, including non-dairy creamer, coffee, broths/stocks, powdered beverages and other blends, tea, and ready-to-drink-beverages. It also offers groceries comprising pickles, refrigerated dough, hot cereal, and cheese and puddings, as well as natural, organic, and gluten-free products. The company sells its products through various distribution channels, including retailers, foodservice distributors, food-away-from-home customers, refrigerated and frozen formats, and co-manufacturers, as well as industrial and export, which includes food manufacturers and repackagers of foodservice products. TreeHouse Foods, Inc. was founded in 1862 and is based in Oak Brook, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/okNu_2Q2xppCeHhE1JS8wg/m6cx5EVHNJfetu5bwnRkgQ7TOIOVwMLGgHg3tYKE6H7z4-BzlW-iUAV7rskzLYVvjthtOu6nfv5MDjvYp8K_UTJPUM2IY_Uxivl8EZ2Gf-hWySBBxLtxZlDf7SIy-GYf0rKH5KeFSWDmPjjcZ4Nd_6lObJIkK2aqF5f38TsyEjOeM8fJeYlmXkxjq19DHItk/hy2UPwjcDAtOqZVdu3nMjBtbfw-kMA-7o-hVmk9pFMU",
    "price": 17.38,
    "prevClose": 17.31,
    "absReturn": 0.07000000000000028
  },
  {
    "fullTicker": "GFS:USA",
    "baseTicker": "GFS",
    "rank": 52.5834,
    "description": "GlobalFoundries Inc., a semiconductor foundry, provides range of mainstream wafer fabrication services and technologies worldwide. It offers semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontrollers, and power management units. The company was incorporated in 2008 and is headquartered in Malta, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/NvS5w7Px5j6ypN_PxohQ0g/IlibLomQ6pIcZcwYh7ilIahlAIhnWlMO59YGZHzbMvAug7jdKYReIBX5_NollnAo_7AlTPWZ06vvV9q_MJqSpYBZFNVPgkFPYZcNOJcoD7VbXbqLS3rAy6dFMg7okEv-pI7E2jCpLZ4oPqPyTwsKU3khRtG27fKREKwU1qQBc4Q1mmPinawHc-MuAOTDdtXp/wKlh7tPwAUOcJY0JVD21fm--k1FWTdMvhaWsS-qajeQ",
    "price": 32.9,
    "prevClose": 33.27,
    "absReturn": -0.37000000000000455
  },
  {
    "fullTicker": "CODI:USA",
    "baseTicker": "CODI",
    "rank": 62.4676,
    "description": "Compass Diversified Holdings, a traded fund in New York Stock Exchange, seeks investment opportunities in small and middle-market companies located in North America with an enterprise value of USD 10-100 million and an annual EBITDA of at least USD 20 million. The fund targets companies operating in industrial and branded consumer sectors. It provides financing for acquisitions, buyouts, and later-stage capital requirements with transaction size ranging from USD 200-800 million utilizing debt and equity. It takes controlling interests and makes investments in public companies.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/4dvEhlq9mWMW9QQS8LyElg/v9p96P6om6yW2psihFBH_1ph7D9w-V_YQXQEZq20F-wzoY6zCwt2H1C_U9_dACNrlnG87XTFZjw71yZnz_SZrJXloNjndtBaFvO9atapb35dcbbpDzLpyg2uc8NoX7h0mNzZyEEaDtxWzjD_mnV-ug/fcac0qFzusiA_Ux9mHe6VXz6hcOYFq5pw8fsCuwlecs",
    "price": 7.2,
    "prevClose": 7.3,
    "absReturn": -0.09999999999999964
  },
  {
    "fullTicker": "EXFY:USA",
    "baseTicker": "EXFY",
    "rank": 68.0491,
    "description": "Expensify, Inc. engages in the provision of a cloud-based expense management software platform in the United States and internationally. The company offers Expensify, a platform that offers corporate card management, bills payment, invoice generation, payment collection, and travel booking services, as well as track and submit plans for individuals. It serves individuals and corporations, small and midsized businesses, and enterprises. Expensify, Inc. was founded in 2008 and is based in Portland, Oregon.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/8Zbpi5SbiysuXjMCgOfH_Q/auSP4-6EkbnRsJ1uGDdiVZfjSrvRcoooT_Ah6B0rZeKFNgJpEMPYGGqfum179LB8u5kRxw5TtegrBgNH-7iaZqyfq-kacxY7eLN2v4WKVwEwMrggYA2hBGqTEUlnii7YQmjn_jAj1LUhvQI5LD7fuPtrbft-xRL3RcZ9QXq8SLE/YIdcKZG4wmuP6sqwqKt1qrYC063VV4UgSAVXGp06eac",
    "price": 1.95,
    "prevClose": 1.99,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "THRM:USA",
    "baseTicker": "THRM",
    "rank": 80.629,
    "description": "Gentherm Incorporated designs, develops, manufactures, and sells thermal management and pneumatic comfort technologies in the United States and internationally. It operates in two segments, Automotive and Medical. The company offers climate comfort systems, including seat heaters, blowers, and thermoelectric devices for variable temperature climate control seats and steering wheel heaters to provide thermal comfort to automobile passengers; integrated electronic components, such as electronic control units; pneumatic lumbar and massage comfort solutions comprising lumbar support, side bolster adjustment, multi-contour seats and massage systems; and other climate and comfort systems, including neck and shoulder conditioners, and climate control systems for door panels and armrests. It also provides automotive cable technology, such as ready-made individual cables and ready-to-install cable networks used to connect components to power sources; battery performance solutions consist of cell connecting devices and battery cable technologies used for various types of batteries and thermal management products; valve systems for brake and engine systems, and fuel management; and electronic and software systems include electronic control units for climate and comfort systems, and electronic control units for memory seat modules and other devices. In addition, the company offers patient temperature management systems under the Blanketrol/Kool-Kit/Maxi-Therm Lite, WarmAir/FilteredFlo, Astopad, Electri-Cool/Micro-Temp, Astotherm/Astoflo, and Hemotherm brands for hyper-hypothermia therapy in intensive care, normothermia in surgical procedures, and additional warming/cooling therapies. It serves light vehicle original equipment manufacturers and tier 1s, and medical industry. The company was formerly known as Amerigon Incorporated and changed its name to Gentherm Incorporated in September 2012. The company was incorporated in 1991 and is headquartered in Northville, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/0RnnGsntbLTQ6VA55O_BFw/dZyUyUS0b9YgkKvkROA9Rar9hvdr1ePk-LcFIQWZ6sCE0xKm58qm5-GD_ydaaXKEYAxB7X4V_mzzJG0OM1Pd59NyGqOxsgJ_BLzsjJohQOZblmJ4_0nN7qzhVVGbTYEJNOVWOOxkddF6h7uyQHT6pg/Ij2HRmk7rY02FSmXX70bjkyAF7JDfurbeF8uF4GKhwo",
    "price": 35,
    "prevClose": 36.43,
    "absReturn": -1.4299999999999997
  },
  {
    "fullTicker": "TAYD:USA",
    "baseTicker": "TAYD",
    "rank": 95.438,
    "description": "Taylor Devices, Inc. engages in design, development, manufacture, and marketing of shock absorption, rate control, and energy storage devices for use in machinery, equipment, and structures in the United States, Asia, and internationally. Its products include seismic dampers that are designed to mitigate the effects of earthquakes on structures; Fluidicshoks, which are compact shock absorbers primarily used in defense, aerospace, and commercial industries; and crane and industrial buffers, which are larger versions of the Fluidicshoks for industrial application on cranes and crane trolleys, truck docks, ladle and ingot cars, ore trolleys, and train car stops. The company's products comprise self-adjusting shock absorbers that include versions of Fluidicshoks, and crane and industrial buffers, which automatically adjust to various impact conditions and are designed for cycle application primarily in the heavy industry; liquid die springs that are used as component parts of machinery and equipment used in the manufacture of tools and dies; vibration dampers, which are primarily used by aerospace and defense industries to control the response of electronics and optical systems subjected to air, ship, or spacecraft vibration; machined springs used in the aerospace applications; custom shock and vibration isolators comprising, liquid springs, fluid dampers, elastomeric springs, and Pumpkin mounts; and custom actuators for special aerospace and defense applications. It markets its products through a network of sales representatives and distributors. Taylor Devices, Inc. was incorporated in 1955 and is headquartered in North Tonawanda, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758484800000/LRUGKYZmJZxa_VhQjxywFw/UIXqEGVIEl0uVw_2MoL7tn3NV_9IR09DRPR2973XEPv_bK5Fv8niNMnRLBb7-5XUs_mR3N8deBQ4oi2vpFA9wfy4Og2GlPQVigFWH5kBuR1Nrj7Fj0N1w9Ub9CygOix8mmPytAPUoo42DH61qA-dzyNTgl3aHBuD_mdV2NGjry5rT95QD2fZ_cLKs7AyUkjV/u3Q-B5l3-M-uQ0ZqvJjpc2_etXysmpOc0KZXpVQzNgI",
    "price": 46.51,
    "prevClose": 47.25,
    "absReturn": -0.740000000000002
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 663.7,
    "prevClose": 660.437886003929,
    "absReturn": 3.2621139960710934
  }
]