[
  {
    "fullTicker": "LCID:USA",
    "baseTicker": "LCID",
    "rank": 0.0325,
    "description": "Lucid Group, Inc., a technology company, designs, engineers, manufactures, and sells electric vehicles (EV), EV powertrains, and battery systems. It also designs and develops proprietary software in-house for Lucid vehicles. The company sells vehicles directly to consumers through its retail sales network and direct online sales, including Lucid Financial Services. The company is headquartered in Newark, California. Lucid Group, Inc. is a subsidiary of Ayar Third Investment Company.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/AfGw56smJx7DIRN9KQG07g/VBvU69QkNCjesDpBGpC4LqRx9flvdX86AHfjDPmCXbTsdI_CJe3MmQ50ifewO09qZu1LOi439x1xv0-DwYJX1GwAn0lp0muIjjUbzeQpUodqmj-CizAaCXh_78C9bA7pb5np0jj3mFnBsO1D0x6doe9SVqOQLZp_ifsIFSkyVkkif2HY6SdbmwdkMiF31P1J/xb8QpJYGn9tqdP3pyf8v-kf7yBsOyzc-YfMfRtdXO-M",
    "price": 10.095,
    "prevClose": 10.05,
    "absReturn": 0.04499999999999993
  },
  {
    "fullTicker": "CRGO:USA",
    "baseTicker": "CRGO",
    "rank": 13.9422,
    "description": "Freightos Limited operates a vendor-neutral booking and payment platform for international freight. It operates WebCargo, a platform for connecting carriers and forwarders; and Freightos.com, a platform for connecting service providers to importers/exporters. The company offers software-as-a-service solutions, such as WebCargo Rate & Quote (Air), a dynamic airline rates and eBookings; WebCargo Rate & Quote (Multimodal), a multi-modal rate repository; data services provide digitalize static carrier rates; WebCargo Airline that enables airlines to control bookings and optimize pricing with real-time booking analytics; and Shipsta Procure that enables shippers or forwarders to manage their ongoing tender procurement process for logistics service. In addition, it provides digital customs brokerage services. The company was founded in 2011 and is based in Barcelona, Spain.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/JpzY2ulWqoDlTloEGq5dVQ/1f1EUI3Vuym90nHk2ZtWDq5kvnSe-6re1W7mkiRMszmRBU1H2nofQggbjQAG6xAaAvUOLW66Jaf1wHKbJVLD85htUkCev-040dBKzS2Wro26H7X9T6gjvaCkAlMH2-Xy4kaJL3VrArJ4tI6ReSwR2Q/sHJuwrUydwsxKsTxMm47Y_hLTc3dTy0wsR2lt_tGuqs",
    "price": 2.84,
    "prevClose": 2.7,
    "absReturn": 0.13999999999999968
  },
  {
    "fullTicker": "SGBX:USA",
    "baseTicker": "SGBX",
    "rank": 15.3234,
    "description": "Safe & Green Holdings Corp. designs and modifies code-engineered cargo shipping containers and purpose-built modules for commercial, industrial, and residential building construction in the United States. It redesigns, repurposes, and convert heavy-gauge steel cargo shipping containers into Safe & Green, which are green building blocks for construction. The company serves architects, landowners, builders, and developers. The company was formerly known as SG Blocks, Inc and changed its name to Safe & Green Holdings Corp. in December 2022. Safe & Green Holdings Corp. was founded in 2007 and is headquartered in Miami, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/T3B-PqDCHUbxs_5n4XpURg/-381JVq4gBCQHW72fOk3HViPV6f8q6LaKVlyiIAWjvR12e6IGNLptzm8mKpZ25iKhJ7bl8cbvE-CphDmebfyAE-UaacoRMXHT2-WZlP5kI05jWYaOpPm8g_5QOTS1k1JvsMS42CTYGCZMaWcY9RgZHkpSdIQw54LoOjLgRl32iDzXHg4px57Vzps34MMbcP6/X8e2MpWGxq58zcOG-q26sDcsGkpYruHJlvpem92oHMs",
    "price": 1.585,
    "prevClose": 1.64,
    "absReturn": -0.05499999999999994
  },
  {
    "fullTicker": "NPCE:USA",
    "baseTicker": "NPCE",
    "rank": 27.8031,
    "description": "NeuroPace, Inc. operates as a medical device company in the United States. The company develops RNS system, a brain-responsive neuromodulation system that delivers personalized, real-time treatment at the seizure source for treating drug-resistant focal epilepsy. It also records continuous brain activity data and enables clinicians to monitor patients in person and remotely. Its RNS System includes RNS neurostimulator, cortical strip and depth leads, and Patient Remote Monitor, as well as other implantable and non-implantable accessories. In addition, the company provides Physician Tablet, Patient Data Management System, and nSight Platform, which facilitates ongoing patient monitoring and streamlines patient support. It sells its products to hospital facilities for initial RNS System implant procedures and for replacement procedures. NeuroPace, Inc. was incorporated in 1997 and is headquartered in Mountain View, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/gErlQF-qTmo9QsMQQGrtdA/o0DfbNyUo2t_placuvj4K4c3rprbolKfdg7dnJ4MWK_S6HkHDBB2HtddCz8Xd1aukqYonwzFXA76hTnFT0e-cAFui8AdlmIBIky6SAard_uEcX5_aOom1m4nEiSADLkBLphS7AeEQMpcADDCVnyRvew_Z5nwkc-E-w8x3PcGp-8/ysAOOrdVsNVNCRBUJt-8Nym3m1Sbx5XWCXSwNrFRPfI",
    "price": 17.01,
    "prevClose": 17.35,
    "absReturn": -0.33999999999999986
  },
  {
    "fullTicker": "MTN:USA",
    "baseTicker": "MTN",
    "rank": 41.2577,
    "description": "Vail Resorts, Inc., through its subsidiaries, operates mountain resorts and regional ski areas in the United States and internationally. It operates through three segments: Mountain, Lodging, and Real Estate. The Mountain segment operates destination mountain resorts and regional ski areas. This segment is also involved in the ancillary activities, including ski school, dining, and retail/rental operations, as well as real estate brokerage activities. The Lodging segment owns and/or manages various luxury hotels and condominiums under the RockResorts brand; other lodging properties; various condominiums located in proximity to the company's mountain resorts; destination resorts; and golf courses, as well as offers resort ground transportation services. This segment operates owned and managed hotel and condominium units. The Real Estate segment owns, develops, and sells real estate properties. The company was founded in 1962 and is based in Broomfield, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/mFPk1n_s0FAQUGDwmofS8A/8g_BA0QeI1N3MTgaJXqrNn4au2XOklTqXfnj9pFBKT-GildEiLsjPtODB5TB5a2RYnHtfrf9fXQDVt5iMtmxDHYEet3A2ysmTAD8W7HR4JcVg-0Mp-3MzoJ2wF_ib3Febyoj6MdkwmWHc9c6_pRKM3CJQ-1A2DhePJNYoR5XtqMCwD0QzgoifMO73iuek3nC/uCnO6Pym6lES5QsBurFs5ZZRuikTJXLLXhfCEg0J2qk",
    "price": 140.53,
    "prevClose": 139.17,
    "absReturn": 1.3600000000000136
  },
  {
    "fullTicker": "ARKO:USA",
    "baseTicker": "ARKO",
    "rank": 46.7663,
    "description": "Arko Corp., through its subsidiary, operates a chain of convenience stores in the United States. It operates through Retail, Wholesale, Fleet Fueling, and GPMP segments. The Retail segment engages in the operation of retail stores that sells fuel and merchandise, as well as cold and hot foodservice, beverages, cigarettes and other tobacco products, candy, salty snacks, grocery, beer and general merchandise to retail consumers. The Wholesale segment supplies fuel to dealers, sub-wholesalers, and bulk and spot purchasers. The Fleet Fueling segment operates proprietary and third-party cardlock, and sells fuel using proprietary fuel cards. The GPMP segment is involved in the wholesale distribution of fuel to the retail and wholesale segments. The company is based in Richmond, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/H007ayKWn6QMW-EY-2sy5g/1LvDowAN40sB-4tQp8MZ1qyOSP71EY8Y5ABUtc4pX7QG2BVn8dADFys1GJ9jsxVM9ts_B_0f512mjaZjx6Yo8DsNKNmx9dPj54b1vPkxhvWEaV_9DrbMzJnfMwhSyxEdHF0qKokL9hqYwPQ375MvH8UAZVwpaSeGOVpmZB-EGK0/zZBpm8Ukv2omas8XOtpmRKTGvE-VVOfat3fw9UR_HS4",
    "price": 5.02,
    "prevClose": 5.11,
    "absReturn": -0.09000000000000075
  },
  {
    "fullTicker": "BSEM:USA",
    "baseTicker": "BSEM",
    "rank": 61.0497,
    "description": "BioStem Technologies, Inc., a life sciences corporation, focuses on discovering, developing, and producing pharmaceutical and regenerative medicine products and services. It develops various biologic stem cell based alternative products, as a treatment for ailments, such as joint pain, tendon and ligament injuries, neurodegenerative, and autoimmune diseases. The company is also engages in the repackaging and distribution of active pharmaceutical ingredients and other pharmaceutical compounding supplies; and develops and markets nutraceutical products under the Dr. Dave's Best and Nesvik Organics brands, as well as other non-proprietary products in the United States and internationally. The company sells products through e-commerce platforms. BioStem Technologies, Inc. was incorporated in 2006 and is based in Pompano Beach, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/OBTyL7W1VDDlB1-74iw7jw/3_x9pIiwDEmDxgMTJf3DIJnNFRcsf7yxM1OwTtqP9CG2XzuaZa_usHy_kysZv8kvBldftsewSYBg-rU9Yt43w3WSxLzXIspJB78R1p6IemqHj1-z3sgcJoRLWaZU4FM60vgjeeBGnYpZ6TfXafn2XRHyVt8_Lstr7DAjkFxL0HICcS8hIwbc0V5qRaWfB1UO/R-aXzOQtPl_-ytAdOGsbnZQIEqpPZDYZb47HvedLIlc",
    "price": 4.59,
    "prevClose": 4.99,
    "absReturn": -0.40000000000000036
  },
  {
    "fullTicker": "CR:USA",
    "baseTicker": "CR",
    "rank": 70.5557,
    "description": "Crane Company, together with its subsidiaries, manufactures and sells engineered industrial products in the United States, Canada, the United Kingdom, Continental Europe, and internationally. The company operates in two segments, Aerospace & Electronics and Process Flow Technologies. The Aerospace & Electronics segment supplies critical components and systems, including original equipment and aftermarket parts for commercial aerospace, as well as the military aerospace, defense, and space markets. This segment also offers pressure sensors for aircraft engine control, aircraft braking systems for commercial aircraft and fighter jets, power conversion solutions for defense, and space applications and lubrication systems. The Process Flow Technologies segment provides other related products, such as lined pipe, fittings and hoses, vacuum jacketed air operated diaphragm and peristaltic pumps, instrumentation and sampling systems, valve positioning and control systems, vacuum insulated pipe systems, and valve diagnostic and calibration systems; pumps and systems; and commercial valves. The company was formerly known as Crane Holdings, Co. Crane Company was founded in 1855 and is based in Stamford, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/7VRyIbldGIxydhbfs5plnw/-xkj-IK-0899eLHzCh2pSIWKElMpI6IK_P-7fiQUFH0tbRBTq0Fe3-2P3cq7na9S0uCKXbljHC0uqp30tnQ4GSVqiWfFsuKPY-YHf2AbPn8HGf3wT19PJTZqBml6tnEcZzY4ogGxzfxPcGNvWyaMmvmdjIUXBA_kDT1Ts2W4zxs/ZoobWes7ZZjVxWeFCLcOBelBNaWieriBY45tRvc34FM",
    "price": 207.51,
    "prevClose": 206.91,
    "absReturn": 0.5999999999999943
  },
  {
    "fullTicker": "FIZZ:USA",
    "baseTicker": "FIZZ",
    "rank": 76.7143,
    "description": "National Beverage Corp., through its subsidiaries, develops, produces, markets, and sells a portfolio of sparkling waters, juices, energy drinks, and carbonated soft drinks in the United States and Canada. The company's Power+ brand portfolio offers sparkling water products under the LaCroix, LaCroix Cúrate, and LaCroix NiCola brands; non-carbonated water under the Clear Fruit; energy drink and shots under the Rip It brand; juice and juice-based products under Everfresh, Everfresh Premier Varietals, and Mr. Pure brands; and carbonated soft drinks under Shasta and Faygo brands. It serves retailers, as well as various smaller up-and-down-the-street accounts through the take-home, convenience, and food-service distribution channels. The company was incorporated in 1985 and is headquartered in Fort Lauderdale, Florida. National Beverage Corp. is a subsidiary of IBS Partners, Ltd.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/tsQmoOQ_Z2LnJPisFAq0Tg/IX4UaVoIsaR_6jg0Opk4PUptKiuZuLIFR478-UL5f5gaia6cJFSjrFXuXlvJDFxKzKcg1AN1pZLXuC3iYjO260j1-J_4A03UmZPlrwp__NQm1IEbVC1yVwVtDqo8gOPyhRa8CksohhFY0lqglGMCp1xQLzG-wxjohlTzO3YnIsRhgQUNUZsOReek9cbAFvKb/9aEarpUtLTSr0IeW0MvjBklBmuNCBjDykyyl604xmVg",
    "price": 33.165,
    "prevClose": 33.35,
    "absReturn": -0.18500000000000227
  },
  {
    "fullTicker": "ZDGE:USA",
    "baseTicker": "ZDGE",
    "rank": 94.9301,
    "description": "Zedge, Inc. builds digital marketplaces and competitive games around content that people use to express themselves. It offers the Zedge Ringtones and Wallpapers app, a freemium digital content marketplace that provides a wide array of mobile personalization content, including mobile phone wallpapers, video wallpapers, ringtones, and notification sounds; and pAInt, a generative AI wallpaper maker. The company also provides GuruShots, a platform for skill-based photo challenge game that allows amateur photographers to compete in various contests showcasing their photos; and Emojipedia, a source for all things emoji. Zedge, Inc. was incorporated in 2008 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1768593600000/pq9afjiU3HrXH6Gif92VpA/7y1GFPrgFR7QZPtcfxe6l1w4Fq_QTPd91Nex-rk3oB87_8bULePdZhYI0kUUUWtYaHsV68rffizLZ1DRhsMnofLZa78Yi9jF5v6YmAlBO72na4VL0taOG56s0orvCKIdON-iolu5xTAlMJdNz-PkYoyFRiXrS52ju7IztwdRwa8/BUaVmKBl5uBYgcEZEthZerNBB9V_mbSvZQxxliWXy0Q",
    "price": 3.595,
    "prevClose": 3.82,
    "absReturn": -0.22499999999999964
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 692.59,
    "prevClose": 692.24,
    "absReturn": 0.35000000000002274
  }
]