[
  {
    "fullTicker": "NAT:USA",
    "baseTicker": "NAT",
    "rank": 5.8207,
    "description": "Nordic American Tankers Limited, a tanker company, acquires and charters double-hull tankers in Bermuda and internationally. It operates a fleet of 20 Suezmax crude oil tankers. The company was incorporated in 1995 and is headquartered in Hamilton, Bermuda.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/YM6x4Ok0aXHp87Oe2GcfuA/fgdRePANAnvPp0y-2eRR36sw9E8lnnw_jOLFzXW5On7PtRNXvPf3Uuw8-7_KXm5CsNlT5tutM1WZjXbP0C3JLN_T6Mvp67Ty5wRpPv72tNqbuBXDB2jdBpuUMk2FpxgLWTZcL4Lx1u1S7i-Zo_m7oWaLS9lOwQbuHplVlu7sDfj5R2Mn04qwH2Mqu-ElXhMg1W6ARD7f26QqOuhNy1-dMA/V0U-zgvsTKJfzJNr2J5knPTyIzYUH8GGgnL4TMwoghU",
    "price": 2.715,
    "prevClose": 2.69,
    "absReturn": 0.02499999999999991
  },
  {
    "fullTicker": "FLWS:USA",
    "baseTicker": "FLWS",
    "rank": 9.995,
    "description": "1-800-FLOWERS.COM, Inc. provides gifts for various occasions in the United States and internationally. It operates through three segments: Consumer Floral & Gifts, Gourmet Foods & Gift Baskets, and BloomNet. The company offers a range of products, including fresh-cut flowers, floral and fruit arrangements, plants, gifts, personalized products, dipped berries, popcorns, gourmet foods and gift baskets, cookies, chocolates, candies, wines, and gift-quality fruits. It offers its products and services through online platform under the 1-800-Flowers.com, 1-800-Baskets.com, Cheryl's Cookies, FruitBouquets.com, Harry & David, Things Remembered, Moose Munch, The Popcorn Factory, Wolferman's Bakery, PersonalizationMall.com, Simply Chocolate, Vital Choice, Scharffen Berger, DesignPac, Shari's Berries, BloomNet, Napco, and Flowerama brand names. 1-800-FLOWERS.COM, Inc. was founded in 1976 and is headquartered in Jericho, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/54IvwrcvtpvOh4pARKQl6Q/uT-nQY5ihQa-uipDAbEhPv45M6DO0nIqiHuPb60fwLMIX12GP7qYGKyvxi9pCa5qia3_Eol-Xo61T7S_sl38QdyQklMPjYSAHn7OoGfa2dolix8ukGe5wUB9E5RoTwJohH-QWx1mrcScOxExbv6GyP235y_4MPKKBFaP8HTEH3PupQqXcdWvQcR1qgDGefs3/uTiKvMc3d99i-LIAfs2msXiArqLvf9GxR74yVB8yorE",
    "price": 5.485,
    "prevClose": 5.4,
    "absReturn": 0.08499999999999996
  },
  {
    "fullTicker": "NVAX:USA",
    "baseTicker": "NVAX",
    "rank": 20.3725,
    "description": "Novavax, Inc., a biotechnology company, engages in the discovering, developing, and commercializing vaccines to protect against serious infectious diseases in the United States, Europe, and internationally. The company offers vaccine platform that combines a recombinant protein approach, nanoparticle technology, and its patented Matrix-M adjuvant to enhance the immune response. The company is commercializing a COVID-19 vaccine, NVX-CoV2373 under the brand names of Nuvaxovid, Covovax, and Novavax COVID-19 Vaccine, adjuvanted for adult and adolescent populations as a primary series and for both homologous and heterologous booster indications. It also developing R21/Matrix-M adjuvant malaria vaccine. Novavax, Inc. was incorporated in 1987 and is headquartered in Gaithersburg, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/RPaajkkr19ITWaqDxMfggQ/RCTAS7NAB6Nf-NOYBd3fJQmdTNifkUOURciwCfkWNT1TpiQ5dQg6rYGpBLwB2-aetgklakyPzLNoHm3YR_vahwiyVVY4CQpY1nfjA7hf3LXtEZZo0LpDC8yWDcbFDqLgdMf_xHypCdZtmf4rGTqXaEUaDfHy7fHCiRmA4teRjts/DEgsCxZQVhBu02EfYXcZTMkdn9OFPAn8ruY7_66SFos",
    "price": 6.965,
    "prevClose": 6.96,
    "absReturn": 0.004999999999999893
  },
  {
    "fullTicker": "PTLO:USA",
    "baseTicker": "PTLO",
    "rank": 29.7356,
    "description": "Portillo's Inc. owns and operates fast casual restaurants in the United States. The company offers Chicago-style hot dogs and sausages, Italian beef sandwiches, char-grilled burgers, chopped salads, crinkle-cut and cheese fries, homemade chocolate cakes, and chocolate cake shake. It also operates a food truck under The Beef Bus name; and a ghost kitchen. In addition, the company provides delivery services through its application and website, as well as third-party delivery platforms. Further, it sells gift cards. Portillo's Inc. was founded in 1963 and is based in Oak Brook, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/A5g4OGYMtXFA5cUqOFLvlw/jK-b60duBAqQMqmpj351DIBfUMhn6nhV-rWKuWtfo54ybmRgUqPSSuQN3kVtVDF0xazy7ymLv4OsN8UBjc85cdkItDysr7pRdXcVKHIkG8qNh6yCBNWQ4Q8paTFnL6zo63FOO9Z224Qe6Z274S2JUH0MsEasTWFeehQe4O5eZic/vUd0NFNvKAMICH_LrMCX1hvOOk5yF9MZmxo1-1fr70Q",
    "price": 11.02,
    "prevClose": 10.97,
    "absReturn": 0.049999999999998934
  },
  {
    "fullTicker": "WCC:USA",
    "baseTicker": "WCC",
    "rank": 37.5187,
    "description": "WESCO International, Inc. provides business-to-business distribution, logistics services, and supply chain solutions in the United States, Canada, and internationally. It operates through three segments: Electrical & Electronic Solutions (EES), Communications & Security Solutions (CSS), and Utility and Broadband Solutions (UBS). The EES segment supplies products and supply chain solutions, including electrical equipment and supplies, automation and connected devices, security, lighting, wire and cable, and safety, as well as maintenance, repair, and operating (MRO) products. This segment also offers contractor solutions, direct and indirect manufacturing supply chain optimization programs, lighting and renewables advisory services, and digital and automation solutions. The CSS segment operates in the network infrastructure and security markets. This segment sells products directly to end-users or through various channels, including data communications contractors, security, network, professional audio/visual, and systems integrators. It also provides safety and energy management solutions. The UBS segment offers products and services to investor-owned utilities; public power companies; and service and wireless providers, broadband operators, and contractors. This segment's products include wire and cables, transformers, transmission and distribution hardware, switches, protective devices, connectors, conduits, pole line hardware, racks, cabinets, safety and MRO products, and point-to-point wireless devices. This segment also provides various service solutions, including fiber project management, high and medium voltage project design and support, pre-wired meters and capacitor banks, meter testing and metering infrastructure installation, personal protective equipment dielectric testing, and tool repair, as well as emergency response, storage yard, materials, and logistics management. The company was founded in 1922 and is headquartered in Pittsburgh, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/2FmaZcynzE2StEsLmZZaXg/Kr-MxcTsXnlHGbDL5JK66nY1y3SBfHcRAQbjAZ0J8VHOO_laThAWUXl7tYxcqKuUrv2u-BQ1F11BHAB0KgX8919wyTYtiSN5HP_harNbkD_uT0YP0Yw8mGhfuRadCeZgC8NdGM-CZL4DOMIfTDYEE0u4iA5v4PnkrBqo4GC66aZ5PaB1LAbrRF73K5x_ovjK/DKuSpync41u3FZ5dh3di0EHpZL2BDLrWZ6H6JpDiLss",
    "price": 204.35,
    "prevClose": 199.17,
    "absReturn": 5.180000000000007
  },
  {
    "fullTicker": "MNDY:USA",
    "baseTicker": "MNDY",
    "rank": 42.458,
    "description": "monday.com Ltd., together with its subsidiaries, develops software applications in the United States, Europe, the Middle East, Africa, the United Kingdom, and internationally. The company provides Work Operating System (Work OS), a cloud-based visual work OS that consists of modular building blocks used and assembled to create software applications and work management tools. Its products include monday work management that manages workflows, projects, and portfolios for team collaboration and productivity; monday CRM, which tracks and manages various sales cycle; monday dev that builds agile product and software development workflows; monday service, which creates seamless connection between service desks and their data; WorkCanvas, a digital whiteboard; and WorkForms, which allows users to create personalized forms or surveys and gain organizational insights. It serves organizations, educational or government institution, and distinct business unit of an organization. The company was formerly known as DaPulse Labs Ltd. and changed its name to monday.com Ltd. in December 2017. monday.com Ltd. was incorporated in 2012 and is headquartered in Tel Aviv, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/jKH2WERn00WOZpFsGydVSg/pMJwjrLNRNLDLtwzcVAoyfBvRWOGy3lTgi79oAGnUC6s8HdP56Zwdv9AEWfrDRjOh1eF1e80TTlzudC6YN74in40UEgnRiRrZsxyD0fISpUjGtDljZvHyV0PIyspfgjV36xu1sfOVGCBLaai6T6tHQLOZ1bMWZLxpDQ-me0OhKo/f2eHZ-Ks0byG44f3HiDLWAhlKhKd3I6LDXk5aYJ-p7g",
    "price": 291.47,
    "prevClose": 287.05,
    "absReturn": 4.420000000000016
  },
  {
    "fullTicker": "LRCX:USA",
    "baseTicker": "LRCX",
    "rank": 51.0228,
    "description": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/QskJZKEWKnVaxMPYw3uLKw/ChULfFyiE2HUsFzpT9pI3TIWUTkGAjr8oXlLi3_mOmqtj_KBX1wEVQ4lmjSnA89FvYYLaAfF_8WkTVIAwUJSsy_dkL_AZ7IrhZCkfd5t0onIohOxOTYdrvN5XgXVtyBzC_3L4VA8GvGl94_zv_jU_ke1xKZTX-YCYP45gudRAnT9z8R4LXKwtC_BAYXbTptM/04kRIzAOi5gKsMyIdluyxAiVS9IQdyoQbCP8zoAXbVQ",
    "price": 100.43,
    "prevClose": 100.37,
    "absReturn": 0.060000000000002274
  },
  {
    "fullTicker": "PPSI:USA",
    "baseTicker": "PPSI",
    "rank": 66.5225,
    "description": "Pioneer Power Solutions, Inc., together with its subsidiaries, design, manufacture, integrate, refurbish, distribute, sell, and service electric power systems, distributed energy resources, power generation equipment, and mobile EV charging solutions. The company operates through Electrical Infrastructure Equipment and Critical Power Solutions segments. The Electrical Infrastructure Equipment segment provides electric power systems that help customers effectively and efficiently protect, control, transfer, monitor, and manage their electric energy requirements. It also offers e-Bloc power systems, power systems, and circuit protective equipment related products. The Critical Power Solutions segment provides power generation equipment maintenance, repairs, remote monitoring, and equipment services, and EV charging solutions. This segment offers suite generator on a truck and power generation equipment, and repair, maintenance, and support services. Pioneer Power Solutions, Inc. serves utility, industrial, and commercial markets. Pioneer Power Solutions, Inc. was formerly known as Pioneer Transformers Ltd. and changed its name to Pioneer Power Solutions, Inc. in December 2009. The company was founded in 2008 and is headquartered in Fort Lee, New Jersey. Pioneer Power Solutions, Inc. operates as a subsidiary of Provident Pioneer Partners, L.P.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/XGUSGjK9BcRXjAgF2rBNiA/wKXwQ57AvIvNqc-nbCON2MxbHi3GkVqWjWg-2VZQW9q9XtxO5sjXwBt59vtHoVPn5q7ygp-s4k8r71UqKqKJ8FyBjOjg-XBlhVaTH9ICHgo1yXfm0pgKxjgXvTlTdCVrZE5dYc9uVURq7KS7LnTm185Y2XZUPq0f8bI42Ywwz7AJRXSflRIwUTr5yWazFn0z/wH0SU2WKbP8OVMDh8kkulnAkd5cMqVxVkU_2S_IElbM",
    "price": 3.2,
    "prevClose": 2.96,
    "absReturn": 0.2400000000000002
  },
  {
    "fullTicker": "MOD:USA",
    "baseTicker": "MOD",
    "rank": 74.7713,
    "description": "Modine Manufacturing Company provides thermal management products and solutions in the United States, Italy, Hungary, China, the United Kingdom, and internationally. It operates through Climate Solutions and Performance Technologies segments. The company offers heat transfer coils, including heat recovery and round tube plate fin coils; gas-fired, hydronic, electric and oilfired unit heaters; roof-mounted direct- and indirect-fired makeup air units; duct furnaces; infrared units; perimeter heating products; single packaged unit ventilators; modular chillers; air handler and condensing units; ceiling cassettes; evaporator unit coolers, remote condensers, fluid coolers, gas coolers, and dry and brine coolers; and motor and generator cooling coils, transformer oil coolers, radiators, dryers, and industrial heat exchangers. It also provides data center products consisting of IT cooling solutions, including precision air conditioning units for data center applications; computer room air conditioning and handler units; hybrid fan coils; fan walls; chillers; condensers; condensing units; and liquid cooling solutions for high-density computing, as well as replacement parts, maintenance service and control solutions for existing equipment and new building management controls and systems. In addition, the company offers powertrain cooling products, such as radiators, condensers, engine cooling modules, charge air coolers, fan shrouds, and surge tanks; cooling module generator sets; aluminum and stainless steel engine oil coolers, exhaust gas recirculation coolers, liquid charge air coolers, transmission and retarder oil coolers, and chillers; battery thermal management systems, electronics cooling packages, battery chillers, battery cooling plates, coolers and casings for electronics cooling, and coolers for electric axles; and coatings products and application services. Modine Manufacturing Company was incorporated in 1916 and is headquartered in Racine, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/Q8yte8r-178f2XJq0vEt3g/vcW2Sh-7XUu-GmZFU3BIkVkM0DKg1rcZs3yc2-zoYBR1qo7G5h_UTXr-UJve4tn_BYqB8Oli6Y8Nz9hG48cQpTfbIJkAnmdnTXxTjl60qFpk8mtaOTUNgIt9Imhfv0ANnUDcHIy7lW-FCLf19Jjf3oDV5SGNYxqtZLSvcyr1DRUymjYB3XrYQzID5kJacCFc/ctI1y85BAGJbH_la59WVf3NWSqLe67bQdpeN2MMk2gA",
    "price": 96.38,
    "prevClose": 91.3,
    "absReturn": 5.079999999999998
  },
  {
    "fullTicker": "HBB:USA",
    "baseTicker": "HBB",
    "rank": 86.8119,
    "description": "Hamilton Beach Brands Holding Company, together with its subsidiaries, designs, markets, and distributes small electric household and specialty housewares appliances in the United States and internationally. It offers air fryers, blenders, coffee makers, food processors, indoor electric grills, irons, juicers, mixers, slow cookers, toasters, and toaster ovens. The company also provides consumer products under the Hamilton Beach and Proctor Silex brands; products under the Hamilton Beach Professional in the premium market; farm-to-table and field-to-table food processing equipment under the Weston brand; garment care products under the CHI brand; cocktail delivery system under the Bartesian brand; home appliances products under the Clorox brand; countertop electric water filtration appliances under the Brita Hub brand; and plant-based milk makers under the Numilk brand. In addition, it offers digitally connected devices to manage at home chronic conditions to use injectable medications; and commercial products under the Hamilton Beach Commercial and the Proctor Silex Commercial brands. The company sells its products through a network of mass merchandisers, e-commerce retailers, national department stores, variety stores, warehouse clubs, specialty home retailers, distributors, restaurants, fast food chains, bars, hotels, and other retail outlets. Hamilton Beach Brands Holding Company was founded in 1904 and is headquartered in Glen Allen, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752775200000/x2luOhcKqsOpvwllVBxdgg/ppDLF-MNvMemoPn-iNngkp6T5edvhHtxS8vji8AUK-alZO1U5Ugx4yr0LbyLyfXQcOfWCpc7pSEcOnPGXUbgSsNfXUcKIByoE7hzCwMwj0xA_McYs93-3r2u-tqlZrycnzD0AZWZEMQLHeUSRK5gLTylQuTToFl1yXuHyEQGtJuXD7j_fibTsN5_3PL_L38U/kj0xiuNlxb5_BmAIFssNPl83AmNms7K5d0EpzPXsFkI",
    "price": 18.66,
    "prevClose": 18.53,
    "absReturn": 0.129999999999999
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 627.105,
    "prevClose": 624.22,
    "absReturn": 2.884999999999991
  }
]