[
  {
    "fullTicker": "QSI:USA",
    "baseTicker": "QSI",
    "rank": 0.9859,
    "description": "Quantum-Si incorporated, a life sciences company, engages in the development of single-molecule detection platform to enable Next Generation Protein Sequencing (NGPS). The company offers Platinum NGPS instrument that provides single molecule amino acid level resolution with a streamlined workflow, including automated data analysis that accessible to researchers in all laboratory types; Platinum Pro NGPS instrument, a single molecule amino acid resolution, which provides an enhanced user interface, cloud or on instrument data analysis and an available pro mode; Library preparation kits to prepare protein sample for sequencing; Barcoding Kits to optimize the workflow and performance of technology; and Sequencing Kits contains the reagents and consumables used to perform NGPS on the Platinum or Platinum Pro instrument. It also provides Platinum Analysis Software, a cloud-based solution that automates data analysis workflows and provides a user-friendly interface and visualization of the sequencing results. Its products are used in antibody characterization, biomarker identification, protein identification, protein variants, protein barcoding, and post translational modification analysis applications. Quantum-Si incorporated was founded in 2013 is headquartered in Branford, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/3_jYbQgGHcecb8myG3s_MA/SW6DmSzVFlVG_Bb57iRnMLHFkw7s2FEn0vXsClo0Mrnaq0wbfTLQ6_Yodc2s-4kQFNo75ELxOL1l5hvOJRtFv9oPMToxMAy6kvdvb6fnhG0LrcivnNAYJ6_NWDbUtDzaUQon1tHzLtFg-yLPhxFNC1uy31cqyoF6XZBZYwjnA-K8SDyHSmTUtv5i5K140Z3X/zpNzECqcaZWVSSosAAYfKrKNVt2F7CUMy4jYLIwP1QI",
    "price": 2.28,
    "prevClose": 2.54,
    "absReturn": -0.26000000000000023
  },
  {
    "fullTicker": "MVIS:USA",
    "baseTicker": "MVIS",
    "rank": 9.519,
    "description": "MicroVision, Inc. develops and sells lidar sensors and software used in automotive safety and autonomous driving applications. It offers a suite of light detection and ranging (lidar) sensors and perception; and validation software for automotive OEMs, advanced driver-assistance systems, and autonomous vehicle applications, as well as non-automotive applications including industrial, robotics, and smart infrastructure. The company also provides MAVIN DR, a dynamic view lidar system, which combines short, medium, and long range sense and field of view into one form; lidar sensors under the MOVIA brand name; and MOSAIK, a software that automates manual data classification or annotation process. In addition, it provides engineering services for its hardware and software products. The company markets its products to customers directly, through trade shows, and its website. MicroVision, Inc. was founded in 1993 and is headquartered in Redmond, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/TyD2REsbxAqeFJIAtHaqEA/rxFL2tKh9S2VY3paUvms0k1EcIgVDKNOpntLw8uAY8ITAVrH6tnuPheXUaioVPIGPHU3MkhOEdonmzMY9ccRqOoVKgrdoqvMCMZ7mX6h9t5AiXfa9kOjismojJJ9hAoH8SOI0jgs8_6ue1cTECTniND--3wlYddFvnQlgj6JC2Z4Qs-y54eGSl3hkOBxbE10/UDtchi0O9X1np8nirNTKiwNlZqfw9L0JTePIkiJeFVQ",
    "price": 1.17,
    "prevClose": 1.24,
    "absReturn": -0.07000000000000006
  },
  {
    "fullTicker": "UOKA:USA",
    "baseTicker": "UOKA",
    "rank": 17.5761,
    "description": "MDJM Ltd provides end-to-end services in the life cycle of a residential real estate project in the People's Republic of China. The company offers real estate agency services; and real estate consulting services; and training and evaluation to agency sales services. It also provides planning and design; marketing and sales; delivery and after-sales; and advertising services. In addition, it offers property leasing; furnishings; routine property maintenance and management; and hospitality and butler services. In addition, the company operates hotel and restaurant. It serves real estate developers, real estate design institutes and agencies, urban planning bureaus of various levels of governments, and urban rail transportation companies, as well as urban infrastructure development companies. The company was formerly known as MDJLEAD LTD. and changed its name to MDJM Ltd in May 2018. MDJM Ltd was founded in 2002 and is based in Cupar, the United Kingdom.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/dL24VLYU9DMs35RMdQ96xA/erG5NuEnmG_QJSL9szXPbKwURamMKgJ-IvxkH2vf3izMaHmD30dji7hxtOGI0njVXrngIg1Dv1BtSbUMQcYW2OqND06DxM1mp8oNnu9C5r-xK9b7wWQ2VMC070zEaq2FcEv_3jWZvExZan_FNiz2EmwGo7wfi-t6bbes2RhNaE0/iv3KmFlGEVUB3oTEK0ZQT5BP6Ce5dKNxz60wkitHz5w",
    "price": 3.28,
    "prevClose": 3.17,
    "absReturn": 0.10999999999999988
  },
  {
    "fullTicker": "AGRO:USA",
    "baseTicker": "AGRO",
    "rank": 21.6046,
    "description": "Adecoagro S.A., an agro-industrial company, engages in various businesses in Argentina, Brazil, and Uruguay. The company operates through two segments, Farming; and Sugar, Ethanol and Energy. The Farming segment is involved in the production of a range of agricultural commodities, including soybean, corn, wheat, peanut, sunflower, cotton, and others; planting, harvesting, processing, and marketing of rice; genetic development of seeds; and production of dairy products, such as raw milk, ultra-high temperature milk, UP milk, powdered milk, semi-hard cheese, cream, cream and cocoa flavored milk, chocolate milk, and other dairy products. The segment also generates electricity through burning biogas extracted from effluents produced by its dairy cattle; and provides grain warehousing and conditioning, and handling and drying services to third parties. The Sugar, Ethanol and Energy segment produces sugar, ethanol, and energy; and sells carbon credits and renewable natural gas certificates. It also engages in the land transformation activities, which is involved in the identification and acquisition of underdeveloped and undermanaged farmland, and the realization of value through the strategic disposition of assets. The company was founded in 2002 and is based in Luxembourg, Luxembourg.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/y-X8zHQrTObg5d4CZi6ZgA/UEk2qa58pSuKbHON1o3hxYQ0f5YQC8_a7mVI31Yr3-4Z0CUbBRtOEzb1T3-vvG_bN5UNO4mAyab0xYml8orTgI8gFfWaMmA8lTr9r-g3hoT1dauGsdsL9LlXxSx8BT3eCWNhJwElCxJvK1XUP-Y1MegbGeEPeKKQRYUihna_0Zw/po1XX5MUGoAF726LJJb1Zp1ApLEZm0KQb-1TVdBxIOQ",
    "price": 7.64,
    "prevClose": 7.61,
    "absReturn": 0.02999999999999936
  },
  {
    "fullTicker": "SFIX:USA",
    "baseTicker": "SFIX",
    "rank": 38.6028,
    "description": "Stitch Fix, Inc., sells a range of apparel, shoes, and accessories for women's, petite, maternity, men's, plus, and kids through its website and mobile application in the United States. It offers denim, dresses, blouses, skirts, shoes, jewelry, and handbags under the Stitch Fix brand. The company was formerly known as rack habit inc. and changed its name to Stitch Fix, Inc. in October 2011. Stitch Fix, Inc. was incorporated in 2011 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/S6vgSHz7Ltc3Aq-kwDHzhw/sM-Cmi0LcUqDva2AUui9Y9gpzZ7uaTwgceVQAIXUiVFJffDE5_2WBuZEPFlNs6EAcg_2ESplZlKVcRrw65Wv39FMGVGWcle_GARL_sUc9i4CPFRfH-VvH7Zdq2svik1YhAwPzS-ORBc2Y9txFKAjv8dVXsx8x_22-fwuCci9nokXZKwQLA4AH2IyW8LoRKVp/8Ahs0WahVpVUod2YrGt8owHwA7-yACD9EwxL8m1KrAs",
    "price": 4.13,
    "prevClose": 4.09,
    "absReturn": 0.040000000000000036
  },
  {
    "fullTicker": "NXPI:USA",
    "baseTicker": "NXPI",
    "rank": 45.81,
    "description": "NXP Semiconductors N.V. offers various semiconductor products in China, the United States, Germany, Japan, Singapore, South Korea, Mexico, the Netherlands, Taiwan, and internationally. The company's product portfolio includes microcontrollers; application processors, including i.MX application processors, and i.MX 8 and 9 family of applications processors; communication processors; wireless connectivity solutions, such as near field communications, ultra-wideband, Bluetooth low-energy, Zigbee, Thread, and Wi-Fi and Wi-Fi/Bluetooth integrated SoCs; analog and interface devices; radio frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. Its products are used in various applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, contract manufacturers, and distributors. N.V. was incorporated in 2006 and is headquartered in Eindhoven, the Netherlands.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/N8L12bXUj4lTj_16qW-yfA/OSQcSukBhLMqDZ-Vkc75uqJdES7FcajBD-SJ996vBXSr2h-aUfgrnmMIYGWaGWfiPRiTcobHR16ZlcsWHB2zOZS5_Be1hyq79-6DkIVW1NKBgLC6Lvf5pkdGkEkILbet1g09sL9qyzAjva8OiJ63X32UfrYadNOQ8F9WFOZtL4jPM1Dt1DA04pRdUbmxMQLZ/7CW9ZZHCzB9MLBbsV7NsS63UzQyi-xwXa0xV0KdExBA",
    "price": 214.35,
    "prevClose": 217.41,
    "absReturn": -3.0600000000000023
  },
  {
    "fullTicker": "DSX:USA",
    "baseTicker": "DSX",
    "rank": 55.5839,
    "description": "Diana Shipping Inc. provides shipping transportation services. The company transports a range of dry bulk cargoes, including commodities, such as iron ore, coal, grain, and other materials in shipping routes worldwide. As of March 1, 2024, it operated a fleet of 38 dry bulk vessels, including 4 Newcastlemax, 8 Capesize, 5 Post-Panamax, 6 Kamsarmax, 9 Ultramax, and 6 Panamax. The company was formerly known as Diana Shipping Investments Corp. and changed its name to Diana Shipping Inc. in February 2005. Diana Shipping Inc. was incorporated in 1999 and is based in Athens, Greece.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/8yb2ZvQ9b4vdFCcDXZU5aQ/kwdDB31o0Ou55EGeng8R5jomRM_X3Z-pBnevO7JYNDqBuRjXWhdSRyJSiX9axYOjVEPQdOYegNOmvjNyO52Jo9XHZz5C-3JPr_3_Yo2spq8WMDP6tgAsQWxJ8D8ByUywFoH7_ZCChcAL3pfF1Kr9qpEnLTORbiNqL2SlFZKlo0aNn-au9l8UockOg8xupyij/6iRC2Vdj4HceBoSSZwTivFCltvWkQ_MpeWA-6WwnEJ8",
    "price": 1.69,
    "prevClose": 1.75,
    "absReturn": -0.06000000000000005
  },
  {
    "fullTicker": "MBLY:USA",
    "baseTicker": "MBLY",
    "rank": 66.1567,
    "description": "Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers a portfolio of end-to-end ADAS and autonomous driving solutions comprising Base ADAS, a front camera that delivers a combination of intelligent safety features to avoid unsafe driving situations; Cloud-Enhanced ADAS, which leverages crowdsourced data to offer accurate localization, as well as a safer, smoother, and natural driving experience; and Surround ADAS that offer eyes-on/hands-off functionality for highway ODDs with features, such as automatic lane change, front and rear collision avoidance, traffic jam assist, and a Highway Pilot function, as well as includes DXP support that enables customers to customize the driving experience. It also provides SuperVision, a eyes-on/hands-off driver assist system for autonomous vehicles; Mobileye Chauffeur, an eyes-off/hands-off solution for consumer vehicles; and Mobileye Drive, a fleet-focused end-to-end self-driving system that enables automakers, public transportation companies, and transportation network operators to offer a no-driver solution for robotaxis, ride-pooling, public transport, and goods delivery. In addition, the company offers EyeQ SoC that provide drivers with basic safety features covered by front-facing sensing, such as collision warning, lane departure warnings, pedestrian and cyclist collision warning, headway monitoring and warning, speed limit indicator, blind spot detection, and others; True Redundancy, which is an AI system architecture; and Road Experience Management solutions. It provides its products and services to original equipment manufacturers through automotive suppliers, as well as fleet owners and operators. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Corporation.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/yLImGeoaFi0tRiIXSRuuZw/C2Y1h18VfS5cT_XmcJpIoP5LmRHoShUVQceifeLq8mhCNjGUqEpndn532ml810A147DASPTuZNnlK5YA-WUCFKSflWEbojvk6ELK8WTHujvDUH1Z2QXHZCVtrbxkJ4GUWbhctxyI-uF1H6C22nFwcv8T2FsMpLMV3vnPikL9AKY/gMfA-vzjE4acc39esQ_m0QeH1XAf_DTIGyxItn_016A",
    "price": 14.03,
    "prevClose": 14.5,
    "absReturn": -0.47000000000000064
  },
  {
    "fullTicker": "KAI:USA",
    "baseTicker": "KAI",
    "rank": 70.8312,
    "description": "Kadant Inc. supplies technologies and engineered systems worldwide. It operates in three segments: Flow Control, Industrial Processing, and Material Handling. The Flow Control segment develops, manufactures, and markets fluid-handling systems and equipment, such as rotary joints, syphons, turbulator bars, expansion joints, and engineered steam and condensate systems; and doctoring, cleaning, and filtration systems and related consumables consisting of doctor systems and holders, doctor blades, cleaning shower and fabric-conditioning systems, forming systems and wear surfaces, and water-filtration systems. The Industrial Processing segment develops, manufactures, and markets ring and rotary debarkers, stranders, chippers, engineered knife systems, industrial automation and control, recycling and approach flow systems, and virgin pulping process equipment for use in the packaging, tissue, wood products, and alternative fuel industries. The Material Handling segment offers conveying and vibratory equipment, and baling products; and manufactures and sells biodegradable and absorbent granules for carriers in agricultural, home lawn and garden, professional lawn, turf, and ornamental applications, as well as for oil and grease absorption. The company markets and sells its products, services, and systems through direct sales, independent sales agents, and distributors. The company was formerly known as Thermo Fibertek, Inc. and changed its name to Kadant Inc. in July 2001. Kadant Inc. was incorporated in 1991 and is headquartered in Westford, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/1Hp7o2ZRDirv362df0NC5A/X4Jayso3U5zlHywM0IJWLox3sOuapDf78C5CDpYjQFLrt4FpkrQyhxsaWMTp6TiVOfPB6bLY7zIPXF4m9XiT_fojshAQnvQjXljUktoEFCWPywixTsz4ZuKOav9Ikud0ZBg4ZIjKr8idIBPbctDbSAf7JjuLDJw9UEPisjJqqzE/dFk75p0_fMcNqgfkSzIxW3xqKXoDyU7HR_MUfV-0R4c",
    "price": 302,
    "prevClose": 297,
    "absReturn": 5
  },
  {
    "fullTicker": "MO:USA",
    "baseTicker": "MO",
    "rank": 87.1324,
    "description": "Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and oral tobacco products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. Altria Group, Inc. was founded in 1822 and is headquartered in Richmond, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760968800000/PzIsQS-8pkgl8gvUW6010A/N_NrSxX75Sxhybt9eqAUjmRYh8IN_J9IFKI9e1UdoSKjr-_b2gRyKODPuhlAI_njDtCG2S9zcbpv6Frz1Zs5mOswe5vSDUiwhY2wjGuhGwDsVd_heRfLIcdyStKE2mM--c92uEzdhSjLjZCIFP5JppPr_JN-Jio42JzPyPRz6nE/aJlnq_8qtyRBF6gpDDvgBP56fLKlu-hbrW1HcMrUGak",
    "price": 65.05,
    "prevClose": 64.26,
    "absReturn": 0.789999999999992
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 664.39,
    "prevClose": 660.64,
    "absReturn": 3.75
  }
]