[
  {
    "fullTicker": "BETR:USA",
    "baseTicker": "BETR",
    "rank": 1.3259,
    "description": "Better Home & Finance Holding Company operates as a homeownership company in the United States. The company provides government-sponsored enterprise (GSE) conforming loans, U.S. Federal Housing Administration insured loans, U.S. Department of Veterans Affairs guaranteed loans, and jumbo loans to GSEs, banks, insurance companies, asset managers, and mortgage real estate investment trusts. It also offers real estate agent services, title insurance and settlement services, and homeowners insurance services. The company formerly known as Better Mortgage Corporation and changed its name to Better Home & Finance Holding Company in August 2023. Better Home & Finance Holding Company is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/J4pcgyz6HP2FTJzzkZOEfg/3-Nfx55AdxHTIo_rJ9cd9y1YSQ-u07Mnm1AtwxXoA_VXT3Ea0d7z7SW7-x5Bt0r4k_ywBdRglJeYpWwSZvM90-K0ypMEmSEhE16KoVhEZpG7zhf0PYZpbqleU3R-Rk_aYJWlxFQ2t4z4QDv9hJmhpTA3-ns1C7JKiPus_-8OHrYD5uTYvsdLx2WQb0cCkpT_/eb4YpceZ8XVQgfy-Cn13qKS44yG-qMknFIV2HrMvRMo",
    "price": 45.7,
    "prevClose": 45.05,
    "absReturn": 0.6500000000000057
  },
  {
    "fullTicker": "NAOV:USA",
    "baseTicker": "NAOV",
    "rank": 13.341,
    "description": "NanoVibronix, Inc., through its subsidiary, NanoVibronix Ltd., focuses on the manufacture and sale of noninvasive biological response-activating devices that target biofilm prevention, wound healing, and pain therapy. Its product portfolio includes UroShield, an ultrasound-based product to prevent bacterial colonization and biofilm in urinary catheters, enhance antibiotic efficacy, and decrease pain and discomfort associated with urinary catheter use. The company also offers PainShield, a patch-based therapeutic ultrasound technology to treat pain, muscle spasm, and joint contractures; and WoundShield, a patch-based therapeutic ultrasound device intended to facilitate tissue regeneration and wound healing by using ultrasound to increase local capillary perfusion and tissue oxygenation. It sells its products directly to patients, as well as through distributor agreements in the United States, Israel, Europe, Australia, India, and internationally. The company was incorporated in 2003 and is headquartered in Elmsford, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/6JvFKit2IKr8KqYTNJj9Lw/kiqEXJGC1syNUezL9P1f482FHYe0pMlsij-KggJA0_h5myBReQXrH7lzIe-Rx85xXy1avBIObi2JzgbaSK4KnzLt7RPLY5FaJncRQx3xePd0y6C1Fpqujux2GbgTMcJElG8ljwMfN8UsMOTSXXvjw6MsAKrvokyT7lzQE0I_WwxnU2eHG5Q0sCSI21-T60JT/VQVSjcQtD4mkK2H3RHH94YLEk8AmzNkQ2EyUsmyFCWA",
    "price": 4.13,
    "prevClose": 3.74,
    "absReturn": 0.3899999999999997
  },
  {
    "fullTicker": "QMCO:USA",
    "baseTicker": "QMCO",
    "rank": 17.3842,
    "description": "Quantum Corporation provides products for storing and managing digital video and unstructured data in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers Myriad All-Flash File and Object Storage Software for high performance enterprise unstructured data applications such as AI, machine learning, and data analytics; Unified Surveillance Platform Software that unified compute and storage for video surveillance recording, storage, and analytics; StorNext Hybrid Flash/Disk File Storage Software for video editing, post-production, and streaming applications, as well as digital file archives; and CatDV Asset Management Software for indexing, cataloging, enriching workflow orchestration. It also provides ActiveScale Object Storage Software that scalable and durable storage; DXi Backup Appliances to build backup appliances for high-speed backup and recovery and multisite data protection; and Scalar Tape Storage that secure storage for long term data archiving and offline data protection which are used by hyperscalers and enterprises. In addition, the company sells linear tape-open (LTO) a tape drives for small business data protection and archiving; and LTO media for use in tape storage systems. Further, it offers global support, customer support agreements, software subscriptions, installation, education, and consulting and training services, as well as Quantum-as-a-Service. The company sells its products through a network of distributors, value-added resellers, direct marketing resellers, original equipment manufacturers, and other suppliers, as well as directly to corporate entities and government agencies. Quantum Corporation was founded in 1980 and is headquartered in San Jose, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/ksI-5D-jZlvl3ApqKDBbrg/103l5nuv8Ydv5BJrgqpEpmfOdOTrYKDafwqUCnH7c_XvcTKt1PDHzEYtbBfSkgX53pScpITsBq2BM9boZYzmC7Ok6y7Q2XBgY_38Y4wOGTE8Re3WbgaG3G9qbS80VGPw80MA-gSRfDQ9VZApRPmnO5m0nJmm2gLQQCspQc3ofpk/b6lM58hBLjAo6AHc_Jovpuasa8qqP6XBFWTZJrbxdsc",
    "price": 6.97,
    "prevClose": 6.98,
    "absReturn": -0.010000000000000675
  },
  {
    "fullTicker": "GPRE:USA",
    "baseTicker": "GPRE",
    "rank": 32.0347,
    "description": "Green Plains Inc. produces low-carbon fuels in the United States and internationally. It operates in two segments, Ethanol Production, and Agribusiness and Energy Services. The Ethanol Production segment produces, stores, and transports ethanol, distiller grains, and ultra-high protein and renewable corn oil. The Agribusiness and Energy Services segment engages in the grain procurement and commodity marketing businesses; and marketing ethanol for a third-party producer, as well as buys and sells ethanol, distiller grains, renewable corn oil, grain, natural gas, and other commodities in various markets. This segment also provides grain drying and storage services to grain producers. The company was formerly known as Green Plains Renewable Energy, Inc. and changed its name to Green Plains Inc. in May 2014. Green Plains Inc. was incorporated in 2004 and is headquartered in Omaha, Nebraska.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/uORKBVuvRziM1OU0HkVVGQ/BGtnpcLKnwGVsMCQzZ8lYd5rTIL-kWqcFmhq_5ZAeK56_qcmiDqbOqBR5EG1R_1G-uNhsb8YELBfphZqmYpJhiw9A2wEeXjrerEUVZj5qWyWE3YQ7kIYR-uZqWqLB2yIl795weUHF_fpkOVLic-hbbiGSK4g2zIObBIhZYbBob8/TJ9RWstGDq9E_krDneKgFv2dgp-TBjan-nQdpahY2KE",
    "price": 9.71,
    "prevClose": 9.81,
    "absReturn": -0.09999999999999964
  },
  {
    "fullTicker": "SUGP:USA",
    "baseTicker": "SUGP",
    "rank": 33.9663,
    "description": "SU Group Holdings Limited, through its subsidiaries, operates as an integrated security-related services company in Hong Kong. It operates through two segments, Security-Related Engineering Services Business; and Security Guarding and Screening Services Business. The company primarily provides security-related engineering, security guarding and screening, and related vocational training services. It also engages in the design, supply, installation, maintenance, and testing and commissioning of various security systems. In addition, the company offers threat detection systems, including X-ray machines, trace detection products, metal detectors, and mail screening machines; traffic and pedestrian control systems, such as traffic control system, automatic fare control systems, turnstiles, automatic door system, and people counting systems; and extra-low voltage systems comprising closed-circuit television, access control, public address, and building management systems to commercial properties, public facilities, and residential properties. Further, the company provides screening services, such as the detection of explosives, and incendiary devices in air cargo consignment and detection of dangerous goods through threat detection systems by screeners; and training courses for basic security services, mandatory basic safety, and training revalidation courses. Additionally, it offers equipment leasing services. SU Group Holdings Limited was founded in 1998 and is headquartered in Kwun Tong, Hong Kong. SU Group Holdings Limited is a subsidiary of Exceptional Engineering Limited.",
    "logo": "",
    "price": 6.1294,
    "prevClose": 6.14,
    "absReturn": -0.010599999999999277
  },
  {
    "fullTicker": "TTAM:USA",
    "baseTicker": "TTAM",
    "rank": 49.6153,
    "description": "Titan America SA, through its subsidiaries, manufactures, distributes, and sells heavy building materials and services in the United States. The company offers cement and supplementary cementitious materials, aggregates, ready-mix concrete, fly ash, concrete block, and other ancillary products to construction companies, ready-mix concrete producers, and industrial clients, as well as public sector. It also provides insurance brokerage, real estate holding, trading, and transportation brokerage services. The company was founded in 1989 and is based in Brussels, Belgium. Titan America SA is a subsidiary of Titan Cement International S.A.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/pd8M65JhMh5RpUu03BNK5A/wFNoe9J8k9WjXKUPdpEPQ9raybQyHQXviK1hpZDz8nvXRxI_Xrn3h5bjLGWxMl-Qt3Qt07QZFsD3c3_ZP2ZmP1IJDW9z7R95np3kdJtSNPqZ1qxH9Cnw-hjXB3yL2zn5Stn-vXZZRoHb88OBPlKsARJA_H-W27_Kc22sTlbdpS9QTjG83FWTRKWEEuxZRM3p/msj8MWghIzmB8qfBsmQw_o8WOv1oruVfSx_L1qstsuM",
    "price": 15.26,
    "prevClose": 14.85,
    "absReturn": 0.41000000000000014
  },
  {
    "fullTicker": "DVA:USA",
    "baseTicker": "DVA",
    "rank": 55.4428,
    "description": "DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure in the United States. The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also offers outpatient, hospital inpatient, and home-based hemodialysis services; operates clinical laboratories that provide routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESRD patients; and management and administrative services to outpatient dialysis centers. In addition, the company offers integrated care and disease management services to patients in risk-based and other integrated care arrangements; clinical research programs; physician services; and comprehensive kidney care services. Further, it engages in the provision of inpatient dialysis services and related laboratory services; and transplant software business. The company was formerly known as DaVita HealthCare Partners Inc. and changed its name to DaVita Inc. in September 2016. DaVita Inc. was incorporated in 1994 and is headquartered in Denver, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/VoUuvEqAwqBqzf3BieQkGg/Ocd_Wj9Qi00Qr1iT7TUhMTsfzQQlTjHYeV1_1yxslQOEU02WD4lt3JsBc04CAwvwfs-4yiWc_5KsjPvUY2kBecehEsy5m2pXnHT3gLbIMTsA0bnWFFunFRd7jb_u6nwE3cEyCoB6MGF71zOmKV4HVwuJFq-dgVce7__TF915Dow/Tfe0WDmraFJ7tDJ-8doY8YJvofHCGKsSA2p26-lcoDk",
    "price": 119.49,
    "prevClose": 120.25,
    "absReturn": -0.7600000000000051
  },
  {
    "fullTicker": "SYY:USA",
    "baseTicker": "SYY",
    "rank": 69.9787,
    "description": "Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/9SakNUFbKw0MIGl0WK9ssg/qQnAB-Lf9eMysqgBEguGDCyQR-uphOvwJLYLpBvDnEqOo-tJ4ARbUZhOmt538g4oQrbw_iihPMpigT1YNaWPofI4MROHV740X6CzY37Nox9zlg7MdjwdD0_UgdFnNYJDB1PFjhIUlCNboQt5W7422CyLPK9iX9idMlmCSlVjTxw/QepYoNp74kQ1iN9ssZQSLpob5p0iEIUAdbuZ51M3OH8",
    "price": 74.7,
    "prevClose": 76.63,
    "absReturn": -1.9299999999999926
  },
  {
    "fullTicker": "ACTG:USA",
    "baseTicker": "ACTG",
    "rank": 77.2794,
    "description": "Acacia Research Corporation operates as an acquirer and operator of businesses across industrial, energy, and technology sectors in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It operates through four segments: Intellectual Property Operations, Industrial Operations, Energy Operations, and Manufacturing Operations. The company is involved in investing in IP; and licensing and enforcement of patented technologies. It also designs and manufactures printers, including hardware and embedded software, as well as consumable products, such as inked ribbons for various industrial printing applications. In addition, the company acquires, explores, develops, and produces oil and natural gas resources located in Texas and Oklahoma; and designs and manufactures purchase brochure, folder, applications display holders, plastic injection-molded office supply and arts, crafts and education products, plastic and aluminum air venting and air control products, extruded vinyl chair mats, safety reflectors for bicycles, and mud flaps and splash guards for the heavy duty truck market. Acacia Research Corporation was incorporated in 1993 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/4EdcBUSGFToui0HMoAzHww/HqW6vu4tM5gf5MXCdqXOVksdYKUnk9QNuUnMoKDqGK5UC3-FgMAERQC3nUeAnoFTEa9jE8-y6mMpKQsmlmub8Z2MBDGE8La_aIBwz-fX8bz1o2lnTuRNp63ROXviiUUnIlIX0gn0Kl3hG1Y8ywYz7vUDz_oQpxdymiSgjh4xSAAe-ku5rHO5phYOTnVGcARu/JiGXYMfeqJ5wdUP8uwRPaZMBDyJPS07uMTFkGIHz-SM",
    "price": 3.6,
    "prevClose": 3.58,
    "absReturn": 0.020000000000000018
  },
  {
    "fullTicker": "MWA:USA",
    "baseTicker": "MWA",
    "rank": 91.357,
    "description": "Mueller Water Products, Inc. manufactures and markets products and services for the transmission, distribution, and measurement of water used by municipalities, and the residential and non-residential construction industries in the United States, Israel, and internationally. It operates in two segments, Water Flow Solutions and Water Management Solutions. The Water Flow Solutions segment provides valves for water systems, such as iron gate, butterfly, tapping, check, knife, plug, and ball valves, which are used to control distribution and transmission of potable water and non-potable water, as well as in water transmission or distribution, water treatment facilities, or industrial applications. It also offers service brass products. The Water Management Solutions segment offers dry-barrel and wet-barrel fire hydrants for water infrastructure development; fire protection systems, and water infrastructure repair and replacement projects; pipe repair products, such as couplings, grips, and clamps used to repair leaks; residential, fire protection, and commercial water metering products and systems; water leak detection and pipe condition assessment products and services; machines and tools for tapping, drilling, extracting, installing, and stopping-off; gas valve products for use in gas distribution systems; and intelligent water solutions, including pressure control valves, advanced pressure management, network analytics, event management, and date logging. It sells its products under the Canada Valve, Centurion, Ez-Max, Hydro Gate, Hydro-Guard, HYMAX, HYMAX VERSA, Jones, Krausz, Milliken, Mueller Systems, Mueller, Pratt, Pratt Industrial, Repamax, Repaflex, Singer, Echologics, Echoshore, ePulse, Hersey, LeakFinderRT, Sentryx, and U.S. Pipe Valve and Hydrant brands. The company was founded in 1857 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764072000000/DGpCKR2gowPB4RMer5z8qg/9RBHmLR5Bc3FdFCn0gcXgxE7jrKTzt8YTwGVVaNorNyD0UU6_QkyMrrvSMaleqIHz3GHDH7Sj0056_0HU4MSRjFiU3sibE-hRaD64NuyhOHuYtSutbXudKYqmdoZAMw4fQIuyaKKc5x66u_q9PoQEWMACh-24zlfG-SlduaMMMpcTvj5w56xt1CHtRgsX4jO/mG77egXz_83cawgcjDbyZVPt5R5aA1zCWXunSqAFOa4",
    "price": 23.66,
    "prevClose": 23.73,
    "absReturn": -0.07000000000000028
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 668.73,
    "prevClose": 659.03,
    "absReturn": 9.700000000000045
  }
]