[
  {
    "fullTicker": "PRZO:USA",
    "baseTicker": "PRZO",
    "rank": 3.0333,
    "description": "ParaZero Technologies Ltd., an aerospace company, designs, develops, manufactures, distributes, and sells autonomous parachute safety systems for commercial drones in the United States, Israel, Canada, Europe, and internationally. The company offers SafeAir system, a smart parachute system that monitors unmanned aerial systems flight in real-time, as well as identifies critical failures and autonomously triggers a parachute in the event of an emergency. Its autonomous parachute system portfolio includes SafeAir Phantom, SafeAir Mavic, SafeAir Mavic 3, SafeAir M-200 Pro, SafeAir M-300 Pro, SafeAir M350 Pro, SafeAir M-600 Pro, SafeAir M30 Pro, SafeAir V1EX, SafeAir Parallel, SafeAir 350, and Custom Integrations. The company serves system manufacturers, resellers, and online stores. The company was incorporated in 2013 and is headquartered in Kiryat Ono, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/Oowt7KBOLu4d-FLVb0GgsQ/IJQj-HtLAc4IoMMVSAOuoo7zDYp2E08Gw0CuERrS1B2e42uCbjn2CgN7Uy5VmecKapnDK21UWLiK-WqFDlXv7j44grWrYM4lBMKQH1LbJy6VI6oyKixmTttGoo8uzapQD0M2cEvCzLuqL6TDYlvDaSUziJF0a3EAyP2ktGCcZXyf7kYRPnmGpqePapqxDSlt/YBLvQvdltY0_2wSTL1-k59LQieCLC2AwH5CclLxG4bI",
    "price": 1.15,
    "prevClose": 1.16,
    "absReturn": -0.010000000000000009
  },
  {
    "fullTicker": "CAVA:USA",
    "baseTicker": "CAVA",
    "rank": 6.764,
    "description": "CAVA Group, Inc. owns and operates a chain of restaurants under the CAVA brand in the United States. It also offers dips, spreads, and dressings through grocery stores. In addition, the company provides online and mobile ordering platforms. The company was founded in 2006 and is headquartered in Washington, District Of Columbia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/7M62c6yIusFpQch5kReNaQ/8Tzy205fNIDmkgdYQwMei75dYkwwuhQ4ml3b_t85uXbbmG_M0gT8IPv8YtriETX-Ty9LtDuovqHW3uBUxeFOqafNstpHw9IpznFxg2B4p5trbBT1cdhZYlaC10TxHoLEUvE0lDjvQEmawhXSa7rf4M8kBWhXocDW77GhtLGw5EGybcU1wEmle8YVDGoUsqJr/Y1jfPYNPWEQxujMpBkiePkMjq-Ix4qNWVx2J0_8eHgY",
    "price": 56.91,
    "prevClose": 56.04,
    "absReturn": 0.8699999999999974
  },
  {
    "fullTicker": "VFC:USA",
    "baseTicker": "VFC",
    "rank": 18.6699,
    "description": "V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/E_umaLwXp1fwBJSBP16uzA/1fojiNvIGXlVwOBTypLL1v4XmmPUcvkvUT_gTM4X4sBP6DttH-98yETcsDNCwhodhqspW1yrbJ7oW9OgNuTSQTkc547s4E2i8yZLi04QxOIYJHE2bqSqD3UeYnV-oIiUNbzz6HDssRTXXPA8WRm086cFUhW1ALWzxNd-mcKioJY/ZV7X75v-R12Mifo4F1Qv8RtW_Mf3SDG0Hf5Otc0ehVQ",
    "price": 18.62,
    "prevClose": 18.36,
    "absReturn": 0.26000000000000156
  },
  {
    "fullTicker": "PCAR:USA",
    "baseTicker": "PCAR",
    "rank": 27.6723,
    "description": "PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Canada, Europe, Mexico, South America, Australia, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name, as well as provides finance and leasing products and services to customers and dealers. This segment offers equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/9O07kEev16axdWROhPbnAQ/ztj32OXQ7Ib5lfZZjkOZ8URV-Tr87sClh53IptLDyBZSvLeWDDW4nNumlK8xf6lMBrc0Ui8DAN6NVXTdaU2SnY4QrH2CV82dclyKOFASsfE9RJWKHQtsJ82coSHFe4bpKLiticz2Y0CALlRxp7d5AdpSj-BMX5a_GnRZQZj1d0c/6RkEfvSvcs_O6dPiqf6mvOvw_lb5LRpVmh8Ja4Wci3s",
    "price": 111.57,
    "prevClose": 110.118217225812,
    "absReturn": 1.4517827741879898
  },
  {
    "fullTicker": "PCG:USA",
    "baseTicker": "PCG",
    "rank": 37.502,
    "description": "PG&E Corporation, through its subsidiary, Pacific Gas and Electric Company, engages in the sale and delivery of electricity and natural gas to customers in northern and central California, the United States. It generates electricity using nuclear, hydroelectric, fossil fuel-fired, fuel cell, and photovoltaic sources. The company owns and operates interconnected transmission lines; electric transmission substations, distribution lines, switching and distribution substations; and natural gas transmission, storage, and distribution system consisting of distribution pipelines, backbone and local transmission pipelines, and various storage facilities. It serves residential, commercial, industrial, and agricultural customers, as well as natural gas-fired electric generation facilities. PG&E Corporation was incorporated in 1905 and is based in Oakland, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/POnWJnWMX0L5IIRzPOhxYg/tSGXJEIuXAGQGSbjwNFezGNkcsISup3uqKZgSg5mLtg0b7mzETdE3CyyX5fxWylYyR798Tr-JhTOZX9hOg_8mWg3Lt1xcKap2FAXw8YfmranCWAJ-lUz5bJ766uNHaMed0WvEAEBn5qy61IqnYuPn0DSQc41dLzBVpjdNK6Zu9A/TIiJwFu0FYnLCmKc3CT1kwKrIqN3QQt3l7c6K0y5bWE",
    "price": 15.73,
    "prevClose": 15.82,
    "absReturn": -0.08999999999999986
  },
  {
    "fullTicker": "GAIA:USA",
    "baseTicker": "GAIA",
    "rank": 51.3058,
    "description": "Gaia, Inc. operates a digital video subscription service and online community for underserved member base in the United States, Canada, Australia, and internationally. It has a digital content library with various titles in Spanish, German, and French languages available to its subscribers on internet connected devices. The company's network comprises Seeking Truth that provides topics that include ancient wisdom and metaphysics; Transformation channel that offers content in the areas of spiritual growth, personal development, and expanded consciousness; Alternative Healing channel focuses on food and nutrition, holistic healing, alternative and integrative medicines, and longevity; and Yoga channel, which provides access to streaming yoga, Eastern arts, and other movement based classes. The company was formerly known as Gaiam, Inc. and changed its name to Gaia, Inc. in July 2016. Gaia, Inc. was incorporated in 1988 and is headquartered in Louisville, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/KlmDEo2yQI6K7Y_H3nEX_Q/nrhcDBwxOdwUDG-pvoaw2VhlesOl484RpLIg6dkXFKjgP4UA6lph3Y8c1S5n6f_FD_G5Zew_WmlIrO3Dz6v0Dgje_yFwTwEWfk5wIDwheovy-nPyuppoesQ5oNsleU_seCLnb81WmYheVK2goOryicTVrMZkvMgqhhV43qU15sg/4izdCKZLkT7JK7BY_caufN6-DdwgodD3eNIll4wBC_8",
    "price": 3.78,
    "prevClose": 3.86,
    "absReturn": -0.08000000000000007
  },
  {
    "fullTicker": "UPS:USA",
    "baseTicker": "UPS",
    "rank": 64.12,
    "description": "United Parcel Service, Inc., a package delivery and logistics provider, offers transportation and delivery services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery services for express letters, documents, packages and palletized freight through air and ground services in the United States. The International Package segment provides small package operations in Europe, the Indian sub-continent, the Middle East and Africa, Canada and Latin America, and Asia. The company offers a range of guaranteed day- and time-definite international shipping services; day-definite services; cross-border ground package delivery; contract-only, e-commerce solutions for non-urgent, and cross-border shipments; and international service for urgent and palletized shipments. It also provides international air and ocean freight forwarding, contract logistics, custom brokerage and insurance, mail services, healthcare logistics, distribution, and post-sales services. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/hzklHMLfoB13eR_SGD05kA/pWI2o4lh8gKj3LOKzasG5aX0o0kSSbWVX5656k1pDVmguQaKY-elcMzrECJn4g2G6Qor-e1N8G1tWTKgADmLlazuCKSbdWzfKimd-3l_VxXHzMnjucNpEzTt0hc9DK0S02yT-TcBWzkuaaceMayH9nLJtIRNaTFf61J_4xbj7KvdJ6X4hPeHcB4BCwy5kyxs/QBOQz_M_pIcZommZYR0aKMveJqOowCbVbmtT9wGGTIY",
    "price": 101.92,
    "prevClose": 102.08,
    "absReturn": -0.1599999999999966
  },
  {
    "fullTicker": "ISRG:USA",
    "baseTicker": "ISRG",
    "rank": 72.3277,
    "description": "Intuitive Surgical, Inc. develops, manufactures, and markets products that enable physicians and healthcare providers to enhance the quality of and access to minimally invasive care in the United States and internationally. The company offers the da Vinci Surgical System that enables surgical procedures using a minimally invasive approach; and Ion endoluminal system, which extends its commercial offerings beyond surgery into diagnostic endoluminal procedures enabling minimally invasive biopsies in the lung. It also provides a suite of stapling, energy, and core instrumentation for its multi-port da Vinci surgical systems; progressive learning pathways to support the use of its technology; infrastructure of service and support specialists, a complement of services to its customers, including installation, repair, maintenance, 24/7 technical support, and proactive system health monitoring; and integrated digital capabilities providing connected offerings, streamlining performance for hospitals with program-enhancing insights. The company sells its products through direct sales organizations, such as capital and clinical sales teams. Intuitive Surgical, Inc. was incorporated in 1995 and is headquartered in Sunnyvale, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/AEZq2Xou7PTni8aQxXqrmg/YONh-3VOZKF9IWDu9K6p0UOfisKc35MYImImaGWkAymnGXrmW-3SSfj7gw6lQ3mS18JAp35vTB9WDMQSceDkNzZ5XZseQWDW3ChsZNP_Fal77QucUF0C_kLg-Q1ZoQ7Kt_Y5AK2R5blGJkwwVNACsnplVnlDAMtOvmc78HZwKN1Qa4MnW1jYaVei5gwkQCY3/vNaHr6swIPF4wtg5NARSEjApqHPxdi9plb-OSQGIuZo",
    "price": 572.47,
    "prevClose": 561.89,
    "absReturn": 10.580000000000041
  },
  {
    "fullTicker": "TTC:USA",
    "baseTicker": "TTC",
    "rank": 86.8613,
    "description": "The Toro Company designs, manufactures, markets, and sells professional turf maintenance equipment and services. It operates through two segments: Professional and Residential. The company offers riding and walking mowers, greens rollers, all-wheel drive articulating tractors, turf sprayer, utility vehicles, aeration, bunker maintenance, and other specialty turf equipment; sprinkler heads, controllers, turf sensors, valves, and operating software; riding rotary and reel mowers and attachments, infield grooming equipment, multipurpose vehicles, and debris management products; and all-wheel drive articulating tractors, sidewalk snow and ice solution vehicles, and related attachments and accessories. It also provides zero-turn radius riding mowers, walk behind and stand-on mowers, turf application and renovation, and tree care equipment; horizontal directional drills and drilling guidance and support equipment, walk and ride trenchers, vacuum excavators, utility locators and inspection systems, pipe rehabilitation, and replacement solutions, as well as drive chucks and sub savers, drill pipe, starter rods and quick connects, bits and blades, rock tools, reamers, and swivels; and snow removal and ice management solutions. In addition, the company offers rotors, sprinkler bodies and nozzles, valves, drip tubing and subsurface irrigation, and electric control devices, as well as wired and wireless rain, freeze, climate, and soil sensors; drip tape, polyethylene tubing, drip line, emitters, filters, fitting, and design software and related solutions; and stand-on skid steers, walk-behind trenchers, stump grinders, material handlers, and other concrete construction equipment. Further, it provides walk power mowers, zero-turn riding mowers, and snow throwers; and grass and hedge trimmers, blower-vacuums, chainsaws, edgers, cultivators, string mowers, and related parts and accessories. The company sells its products through a network of distributors, dealers, mass retailers, hardware retailers, equipment rental centers, home centers, and online channels. The company was founded in 1914 and is headquartered in Bloomington, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/XmmcHE5qsRuz5yyaXUCeeA/Oh2M8gz66fsjiizif1jXUxZfr5g9gbzMG9TbVbww6RQHQTVUdP90RAg2blQAY0u-9XB0mYAyWEKTORojf7_BCnVbg80a_9kTsWdq1HRvykUXos9JDyy7wxmynzqV_5AYor86_a8hnL1TcJAYiiz3PFOyO_MHtRLTjAtCgguZT3U/4mjuAucN9qzSfLpTS_qLtkG_LLDLPkfahUxlJT3IatU",
    "price": 77.67,
    "prevClose": 78.19,
    "absReturn": -0.519999999999996
  },
  {
    "fullTicker": "AFYA:USA",
    "baseTicker": "AFYA",
    "rank": 93.0414,
    "description": "Afya Limited operates as a medical education group in Brazil. The company operates through three segments: Undergrad, Continuing Education, and Digital Services. It offers educational products and services, including medical schools, medical residency preparatory courses, graduate courses, and other programs to lifelong medical learners enrolled across its distribution network, as well as to third-party medical schools. The company provides digital health services, such as subscription-based mobile app and website portal that focuses on assisting health professionals and students with clinical decision-making through tools, such as medical calculators, charts, and updated content, as well as prescriptions, clinical scores, medical procedures and laboratory exams, and others. It offers health sciences courses, which comprise medicine, dentistry, nursing, radiology, psychology, pharmacy, physical education, physiotherapy, nutrition, and biomedicine; and degree programs and courses in other subjects and disciplines, including undergraduate and post graduate courses in business administration, accounting, law, civil engineering, industrial engineering, and pedagogy. In addition, the company provides medical postgraduate specialization programs; printed and digital content; and an online medical education platform and practical medical training services. Further, it offers iClinic, a practice management software; educational health and medical imaging solutions through an interactive platform; Cliquefarma, a free-to-use website that tracks prescription drugs, cosmetics and personal hygiene product prices; Shosp, a clinical management software; RX PRO, a solution that connects physicians with the pharmaceutical industry; and Glic, a free diabetes care and management app solution for physicians and patients. The company was founded in 1999 and is headquartered in Nova Lima, Brazil.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766239200000/DZ8zU9ixUL38UCZMMhhXQw/L3BMrearxSS9OockX1E4YD5e_o-4PVJALDwfAs4hKz7GZvs96ifkYnyIcxpveKaEE0Uv_OS1pc9eyYv4hGpkuchHlAfjZfDt4tmOJXS2ecOqc6vVm_6LlvRQ37k-hcZWhBy5LQFDraKmiwZv3fSc8rnuHS_cXtO_3jrLCcQKfDo/QFl7_dwF5h1mhurx7CXDxUPK2d2wGzuRdS89-dUy4Ss",
    "price": 14.56,
    "prevClose": 14.64,
    "absReturn": -0.08000000000000007
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 680.59,
    "prevClose": 674.494485045818,
    "absReturn": 6.095514954182022
  }
]