[
  {
    "fullTicker": "KO:USA",
    "baseTicker": "KO",
    "rank": 20.779,
    "description": "The Coca-Cola Company, a beverage company, manufactures and sells various nonalcoholic beverages in the United States and internationally. The company provides sparkling soft drinks and flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers comprising restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Crystal, Dasani, dogadan, Fuze Tea, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, I LOHAS, Powerade, Topo Chico, Core Power, Del Valle, fairlife, innocent, Maaza, Minute Maid, Minute Maid Pulpy, and Simply brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/gUxbTH257Yjew056qaKkYQ/gDsdxWuX_G-Y22aFi1t3BvUgK_FOv02VXsDUvcyWbXxZ53FPwgVLMjfKvmWJfmrlUqYE797GmPGEF-FyrJxIrztvhgYOpYj_yLpBpSAcRHjHOgYrMcvoo1rKqiw-d2jsxhf5lGKeVk8F3WljhAnxOi0YRfUp2xmSGpBLE0GYLmbibxYg0-wgHzbRiuYuJb4y/Pf9ik7oiEcoBYVrlk-ixS13rgeceB_ze6d5vtDPCjA0",
    "price": 68.84,
    "prevClose": 69.21,
    "absReturn": -0.36999999999999034
  },
  {
    "fullTicker": "ACCO:USA",
    "baseTicker": "ACCO",
    "rank": 32.0529,
    "description": "ACCO Brands Corporation designs, manufactures, and markets consumer, school, technology, and office products in the United States, Canada, Brazil, Mexico, Chile, Europe, the Middle East, Australia, New Zealand, and Asia. It operates in two segments, ACCO Brands Americas and ACCO Brands International. The company offers note taking products, computer and gaming accessories, planners, workspace machines, tools and essentials, and dry erase boards and accessories, as well as filing and organization products, and writing and art products; and shredding, laminating and binding machines, stapling, punching, and do-it-yourself tools. It sells its products under the Five Star, PowerA, Tilibra, AT-A-GLANCE, Kensington, Quartet, GBC, Mead, Swingline, Barrilito, Foroni, Hilroy, Leitz, Rapid, Esselte, Rexel, PowerA, NOBO, Franken, Derwent, Marbig, Artline, and Spirax brands. The company distributes its products through various channels, including mass retailers, e-tailers, discount, drug/grocery, and variety chains, warehouse clubs, hardware and specialty stores, independent office product dealers, office superstores, wholesalers, contract stationers, and technology specialty businesses, as well as sells products directly to commercial and consumer end-users through its e-commerce platform and direct sales organization. The company was founded in 1893 and is headquartered in Lake Zurich, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/ixc_eHpVslFlNUEzVPP0nQ/67lBZszbNgxNNdPNY9V1HNuqdcTkQt9bd61WPgRT9fim9-RX8A7tfXgkeRL4B3P9j7yHYqqhrkLacMln1b3SYeolWlxzS-cWl2SBPTqeRPyYGk7t7UW022RgVWZ6pQEcMGyKx8lcNkltTpxwtcn9iR6idVfUGxM2m2g_BZq-pS-86L7ECfWa96MrO63czHQ7/DGpH9D16zto54IxgifN_v5ijN972XPTgIl43XQpUHhc",
    "price": 3.37,
    "prevClose": 3.39,
    "absReturn": -0.020000000000000018
  },
  {
    "fullTicker": "AKA:USA",
    "baseTicker": "AKA",
    "rank": 35.519,
    "description": "a.k.a. Brands Holding Corp. operates a portfolio of online fashion brands in the United States, Australia, New Zealand, and internationally. The company offers streetwear apparel, dresses, tops, footwear, headwear, wardrobe staples, and accessories through its online stores under the Princess Polly, Petal & Pup, Culture Kings, and mnml brands. It also operates physical stores. The company was founded in 2018 and is headquartered in San Francisco, California. a.k.a. Brands Holding Corp. is a subsidiary of New Excelerate, L.P.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/F5E4DeH5aNXkA_oFsuGDdw/b9C1Kqh8adWVVFDBD9uZi8-EBTfELgZDc829f3g4jBHNKi_PYmP6dtftsgBPk7qhFwkAV4aXl4h8ZHuygFgefFUTH-5zxs0d5wepagul8_Pxd7HudGwNF-PAkevPb-ZK0NjT_Ydh-zP24P-JT7MF0l5IYysdjRV0Dk_Fj3Xme0v5ayDFMn5udbESlaySjvh6/gJjoqaMOER006-f5Md_vg8LWn71MNNxbjxUXvf9ubmg",
    "price": 10.71,
    "prevClose": 10.81,
    "absReturn": -0.09999999999999964
  },
  {
    "fullTicker": "MNKD:USA",
    "baseTicker": "MNKD",
    "rank": 45.8639,
    "description": "MannKind Corporation, a biopharmaceutical company, focuses on the development and commercialization of therapeutic products and services for endocrine and orphan lung diseases in the United States. It offers Afrezza Inhalation Powder, an inhaled insulin used to improve glycemic control in adults with diabetes; the V-Go wearable insulin delivery device, which provides continuous subcutaneous infusion of insulin in adults; and Tyvaso DPI for the treatment of pulmonary arterial hypertension and pulmonary hypertension. The company's product pipeline includes MNKD-101, a nebulized formulation of clofazimine, which is in Phase 3 study, for the treatment of severe chronic and recurrent pulmonary infections, including nontuberculous mycobacterial lung disease; MNKD-201, a dry-powder formulation of nintedanib, which is in phase 1 clinical study, for the treatment of idiopathic pulmonary fibrosis (IPF); MNKD-301, which is in preclinical stage, for cystic fibrosis; and Pediatric Afrezza, which is in phase 3 clinical trial for the treatment of diabetes mellitus. It has collaboration and license agreement with United Therapeutics Corporation for development, regulatory, and commercial activities of Tyvaso DPI; and collaboration agreement with Thirona to evaluate the therapeutic for the treatment of pulmonary fibrosis. Further, the company has supply and distribution agreement with Biomm S.A. for the commercialization of Afrezza in Brazil; license and distribution agreement with Cipla Ltd. for the marketing and distribution of Afrezza in India; and co-promotion agreement with Amphastar for marketing of Baqsimi (glucagon) nasal powder. MannKind Corporation was incorporated in 1991 and is headquartered in Danbury, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/Ca-RLhYMsd5D-addYqsLKw/tTXXCgyNui9sHDInFczshRyVgKb85dQKpCSxqgS5E0Tg5ew46_5WrIZGOcfWPUkkXFNCWBeuA3C1bIckq6raHLqABpBV6zwq7aPelhuy_KcDyrSFtv-UtzR7xtEeZ_G4WQ5oWVyWOw7RsyMucz2H0-7HA4tQG5tzwBL23zLW4rE/2Z20Mz183riO8looVVPQt2JlWmnk9VibkDnpRp9kGGw",
    "price": 3.77,
    "prevClose": 3.81,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "SPOT:USA",
    "baseTicker": "SPOT",
    "rank": 47.5612,
    "description": "Spotify Technology S.A., together with its subsidiaries, provides audio streaming subscription services worldwide. It operates through two segments, Premium and Ad-Supported. The Premium segment offers unlimited online and offline streaming access to its catalog of music and podcasts without commercial breaks to its subscribers. This segment sells directly to the end users. The Ad-Supported segment provides on-demand online access to its catalog of music and unlimited online access to the catalog of podcasts to its users on their computers, tablets, and compatible mobile devices. The company also offers sales, distribution and marketing, contract research and development, and customer and other support services. Spotify Technology S.A. was incorporated in 2006 and is based in Luxembourg City, Luxembourg.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/VTQ7pFpAv7Bho3-LCMwj0Q/Yeql1kQeVTvGgL7lb3xItgnoF-MMQocS58TJe4IjMeIqL_tKt-9DwNxogai12kkHIQ6OEztB0kNoOXqKeSDxgEFC1EHLf-KOzSBF7kiSe6uRSr1RV-ox5PchnAlsUFH_AzvdzyMdcNm9JjFknKJbk7fFG9Rg74kVZZiUpK837aFEolUDRcR5TkTbQ23znq25/ov1dFvDNjtCuRRD-0t1WWmpWuUvemDpf2WWZagglrW0",
    "price": 707.6,
    "prevClose": 710.19,
    "absReturn": -2.590000000000032
  },
  {
    "fullTicker": "MDU:USA",
    "baseTicker": "MDU",
    "rank": 55.0652,
    "description": "MDU Resources Group, Inc. engages in the regulated energy delivery businesses in the United States. The company operates through three segments: Electric, Natural Gas Distribution, and Pipeline. It generates, transmits, and distributes electricity in Montana, North Dakota, South Dakota, and Wyoming. The company also distributes natural gas in Idaho, Minnesota, Montana, North Dakota, Oregon, South Dakota, Washington, and Wyoming; and supplies related value-added services. In addition, it provides natural gas transportation and underground storage services through a regulated pipeline system primarily in the Rocky Mountain and northern Great Plains regions; and cathodic protection non-regulated energy-related services. Further, the company offers transportation and storage services. MDU Resources Group, Inc. was incorporated in 1924 and is headquartered in Bismarck, North Dakota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/J3dIB25e3FfRtc47YzB__A/nB7jIfFmKhkJyar7QUaH03PT8st7KtKmwoC2o-wSPEHLrA7eqrLtroQZGVV7vuDKRkW6D6MKYlqvOSD2KDWaYOw1sXqef87viDtZGR1A75AYGlXe-RlciQjNE3iNuFMn-8osg1hI4oGZY34Z47P9YZbYdaoYqD6Ded0P0vu3_QjdEqreZ9ZVLXGpcHOPypu8/hh1zhcb0spgGv0e7ukO0b-UXsrghYm12I47zkeaJESQ",
    "price": 15.99,
    "prevClose": 16.14,
    "absReturn": -0.15000000000000036
  },
  {
    "fullTicker": "VIAV:USA",
    "baseTicker": "VIAV",
    "rank": 62.2298,
    "description": "Viavi Solutions Inc. provides network test, monitoring, and assurance solutions for communications service providers, hyperscalers, network equipment manufacturers, original equipment manufacturers, government, and avionics customers in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa. The company operates through three segments: Network Enablement (NE), Service Enablement (SE), and Optical Security and Performance Products (OSP). The NE segment offers testing solutions that access the network to perform build-out and maintenance tasks. Its solutions include instruments, software, and services to design, build, activate, certify, troubleshoot, and optimize networks; and test and measurement instrumentation for aviation, aerospace, government, defense, communication and safety. It also offers support and professional services, such as repair, calibration, software support, and technical assistance for the products; and system integration projects, including project management, installation, and implementation, as well as product and technology training, and consulting services. The SE segment provides embedded systems and enterprise performance management solutions for communication service providers, enterprises, and cloud operators with visibility into network, service, and application data. Its solutions include instruments, microprobes, and software, which monitor, collect, and analyze network data to reveal the actual customer experience and to identify opportunities for new revenue streams and network optimization. The OSP segment offers optical products for anti-counterfeiting, consumer electronics, industrial, government, automotive, and industrial markets. The company was formerly known as JDS Uniphase Corporation. Viavi Solutions Inc. was founded in 1923 and is headquartered in Chandler, Arizona.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/3yTcvZ3TaXhbUEZd-Vy0LQ/uGPfqvnPXSRgxsjkpoHJ6xHb6rGcLq1nJFLaSztoFd6uS-yZ4dXDyFHDKb670UV9JrQ5iZsVHj1NihiXhbv4cpL6PPoV55r7-JmdIDKX0HCLvINMJOBZ90OxLd9e5gahTfnvJlEx46N7fpDzEt1YAQ_BWI0Bthr--o2y4h2z6-LPfQ3hasgiV_LdRpsoDyVU/C5yWGfkHTjvXjxw0KpQlgzvkUVzm9eKwTT7CcGv8R84",
    "price": 9.4,
    "prevClose": 9.34,
    "absReturn": 0.0600000000000005
  },
  {
    "fullTicker": "BRY:USA",
    "baseTicker": "BRY",
    "rank": 70.8951,
    "description": "Berry Corporation operates as an independent upstream energy company in the western United States. It operates through two segments, Exploration and Production (E&P); and Well Servicing and Abandonment. The E&P segment engages in the development and production of onshore, low geologic risk, and long-lived oil and gas reserves primarily located in California and Utah. The Well Servicing and Abandonment segment provides wellsite services in California to oil and natural gas production companies with a focus on well servicing, well abandonment services, and water logistics. The company was founded in 1909 and is headquartered in Dallas, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/ngV-ntXjLBE2OdU39UrXWg/gXZPDhZ1rHLbE0eJ4uRrIEXfI45_3FkhS8VfAVbEcruVYLu6Y5W7iJNqukZbOwGVUYegWb8ZCDLm00SZ3q-xhDpsgUr2XpCiJdnulHBn1VZGQLjptavwG_qXj2_Wa35gnm9hO5fS5aOqvwPDiegkVyZl0-ArQl6x5dGZqe3kSow/nqDT6WNCcVOmJZh8Bk9Yku7USMljhSjDpwYP-EkspOA",
    "price": 3.3,
    "prevClose": 3.27,
    "absReturn": 0.029999999999999805
  },
  {
    "fullTicker": "CMRE:USA",
    "baseTicker": "CMRE",
    "rank": 81.9725,
    "description": "Costamare Inc. owns and operates containerships and dry bulk vessels worldwide. Its containerships are chartered to liner companies providing transportation of cargoes. The company also charters dry bulk vessels to various customers providing worldwide transportation for dry bulk cargoes. As of February 12, 2025, it had a fleet of fleet of 68 containerships and 38 dry bulk vessels. The company was founded in 1974 and is based in Monaco.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/p5DvSnd-cVjLoNISdzFATQ/B5s082Jobt7ptrQcOUOWf93bGcXU1AdlFezLKTPTBZrcXSRfqeimuBAbnvIbU7z2bxjKx3T-50KU_Kt6wF0b5lqJ-sKcATFHmdWL3KzIRztjSBFc7KymkquC-rgZbY9W43leRFEgUHD4itxYKxmEJd86KhMt2g2GMJkCHlCW0bA/B_m89eDnfcwHSZX7mXI17YjvH_eS3nn5P_6oBIRVmaY",
    "price": 9.19,
    "prevClose": 9.57,
    "absReturn": -0.3800000000000008
  },
  {
    "fullTicker": "PGNY:USA",
    "baseTicker": "PGNY",
    "rank": 91.4418,
    "description": "Progyny, Inc., a benefits management company, provides fertility, family building, and women's health benefits solutions in the United States. The company offers fertility benefits solutions, such as differentiated benefits plan design that includes smart cycle treatment bundle; personalized concierge-style member support services; and a selective network of fertility specialists. It also offers Progyny Rx, an integrated pharmacy benefits solution that provides access to the medications needed during their treatment and offers care management services. In addition, the company offers assistance service program where various services can be offered through a reimbursement program, including adoption, surrogacy, doula, and travel reimbursement when travel is required to receive medical services. The company was formerly known as Auxogyn, Inc. and changed its name to Progyny, Inc. in 2015. Progyny, Inc. was incorporated in 2008 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750464000000/_cb4uDTkozc5SHLMX4CgcA/UJ8nHWHWILI4INL8NUuhnpzR0y8ExPYyKOPfc_7dgiRYxqMlDpnr3lF-35bkZfNh81gIJADjjB3OmaJjdcjasTp2xZA2zVRWU4-eDb3CwuojUxy-zEanjCjGhyH7Vo95H8jlruxpFkfNw8c1bGg1U83xVVyWyTXU04wy9UYD4Q4/YRrvOp2ibsf3HKr9kNUwzHzWW6xjws8GpqlQTRrpg0o",
    "price": 20.97,
    "prevClose": 21.65,
    "absReturn": -0.6799999999999997
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 594.28,
    "prevClose": 595.67474973375,
    "absReturn": -1.394749733750018
  }
]