[
  {
    "fullTicker": "PRAA:USA",
    "baseTicker": "PRAA",
    "rank": 52.2079,
    "description": "PRA Group, Inc., a financial services company, engages in the purchase, collection, and management of portfolios of nonperforming loans worldwide. The company purchases accounts that are primarily unpaid obligations of individuals owed to credit originators. It also purchases and collects nonperforming loans, which are sold by credit originators when they choose not to pursue, or have been unsuccessful in, collecting the full balance owed. In addition, the company is involved in purchasing and collecting on nonperforming loans where the customer is involved in a bankruptcy or similar proceeding; and purchase and provide fee-based services for class action claims recoveries. Its nonperforming loans, includes general purpose and private label credit cards, consumer loans, auto loans, overdrafts, and small business loans. The company was formerly known as Portfolio Recovery Associates, Inc. and changed its name to PRA Group, Inc. in October 2014. PRA Group, Inc. was founded in 1996 and is headquartered in Norfolk, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/XNrwv1WO8AcRd_CmB9ZDiw/Mb1sUcNBUykKe3FMs4p-mUNfy61Qg-T0POmms_fRmGm8NHDtqA9XEzbgrFgKujOcXbtqvv4M3kEP6cPOhikXpXBs103gc06Py6FmxOXlEH0NcGlypg98BqvstD_vCLCEiDyGcIRMwVFHmDMC6q-fvNlEzl1r201PeQK93ZOlZHE/BPQuW-WBxHKC4f-5dW9HlsHePSzSQ8ZNbOhgPakL7kY",
    "price": 16.94,
    "prevClose": 16.82,
    "absReturn": 0.120000000000001
  },
  {
    "fullTicker": "LVLU:USA",
    "baseTicker": "LVLU",
    "rank": 60.7463,
    "description": "Lulu's Fashion Lounge Holdings, Inc. operates as an online retailer of women's apparel, footwear, and accessories. The company offers formals, casuals, dresses, tops, bottoms, wedding dresses, rompers and jumpsits, intimates and sleepwear, swimwear, shoes, and accessories under the Lulus brand. It sells its products through owned media, which primarily consists of its website, mobile app, social media, email, and SMS; and earned and paid media, as well as social media platforms. The company also operates bridal boutique stores that offers bridal gowns, bridesmaids dresses, bridal accessories, shoes, and others. The company primarily serves Millennial and Gen Z women. Lulu's Fashion Lounge Holdings, Inc. was founded in 1996 and is headquartered in Chico, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/mJ8KpAL3QV6WiR-b2OQP4Q/xkLiZTZfZXvR3kPXRFOMAb7JvOJH53N-O1fRbVaFtr5fzy3eAYBjiHxFccA3A_c7O4J7N8LE1N57_vC-gwFerJwpK4MH6O6VzGyjoqgsp-mi8lVxI5g2GcatwVaVpNHWb_2GPOUfTS5QDQKo_EEFRn8wMBVPN_MYbPdDiGoDND5xOoAi-P2VjilOU56BwT5IHFbkXcazMykVn8hPMRsOew/xzhLBvl-u1rVkgeEwnTgxNsq2X67MEd400Uo2IYLL44",
    "price": 5.5,
    "prevClose": 5.15,
    "absReturn": 0.34999999999999964
  },
  {
    "fullTicker": "AP:USA",
    "baseTicker": "AP",
    "rank": 64.7711,
    "description": "Ampco-Pittsburgh Corporation, together with its subsidiaries, engages in manufacture and sale of specialty metal products and customized equipment to commercial and industrial users worldwide. The company operates through Forged and Cast Engineered Products (FCEP); and Air and Liquid Processing (ALP) segments. The FCEP segment produces forged hardened steel rolls, cast rolls and, forged engineered products that are used in cold rolling mills by producers of steel, aluminum, and other metals; cast rolls for hot strip mills, medium/heavy section mills, roughing mills, and plate mills; and forged engineered products for narrow and wide strip and aluminum mills, back-up rolls for narrow strip mills, and leveling rolls and shafts. The ALP segment produces custom-engineered finned tube heat exchange coils and related heat transfer products for various industries, including OEM/commercial, nuclear power generation, and industrial manufacturing; custom-designed air handling systems for institutional, pharmaceutical, and general industrial building markets; and manufacture centrifugal pumps for the fossil fueled power generation, marine defense, and industrial refrigeration industries. Ampco-Pittsburgh Corporation was incorporated in 1929 and is headquartered in Carnegie, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/o47oCIKwfjFKX4KyKw_eEA/61Iui7rqnoI2wmFQiaxLaUDUab2IxcGU7kLvojtndbBIA5k7pWuf31FfJ42Q2A9vUtNvLdisIpsceKo4luneJsMaeRN_9MtTI1stC5OzC4RUYUZPIDcTTuDAc3c820-y8WMtoBKMDbtjhutTlfCVeuPYALA2OYRByD5qEk7_h6R1_7crcNbpodRWLKNNn1Yb/N__7zXhDBEpTD8KKiDexaGNzXe8BB4aKhSaqi5wf7nA",
    "price": 4.09,
    "prevClose": 3.64,
    "absReturn": 0.44999999999999973
  },
  {
    "fullTicker": "MHK:USA",
    "baseTicker": "MHK",
    "rank": 67.5086,
    "description": "Mohawk Industries, Inc. designs, manufactures, sources, distributes, and markets flooring products for residential and commercial remodeling, and new construction channels in the United States, Europe, Latin America, and internationally. It operates through three segments: Global Ceramic, Flooring North America, and Flooring Rest of the World. The company provides ceramic, porcelain, and natural stone tiles products for floor and wall applications; natural stones, porcelain slabs, and quartz countertops, as well as installation materials; floor covering products comprising broadloom carpets, carpet tiles, rugs and mats, carpet pads, laminates, medium-density fiberboards, wood floorings, vinyl tiles, and sheet vinyl; and roofing panels, insulation boards, mezzanine flooring products, medium-density fiberboard, decorative panels, and chipboards. It also licenses its intellectual property to flooring manufacturers. The company sells its products under the American Olean, Daltile, Decortiles, Eliane, Elizabeth, Lentex Flooring, EmilGroup, KAI, Kerama Marazzi, Marazzi, Ragno, Aladdin Commercial, Durkan, Foss, IVC Resilient Design, Karastan, Mohawk, Mohawk Group, Mohawk Home, Pergo, Portico, Quick-Step, Feltex, GH Commercial, Godfrey Hirst, Hycraft, IVC Home, Lentex, Leoline, Moduleo, Redbook, Unilin, and Vitromex brands. It offers its products to home centers, company-owned service centers and stores, floor covering retailers, ceramic tile specialists, e-commerce retailers, residential builders, independent distributors, commercial contractors, and commercial end users. The company was incorporated in 1988 and is headquartered in Calhoun, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/rPjmLfl8_Tbhslx08_JPpg/wHexNLx-p5eZIJxqCG41LLH6zbTu6nG8kKzkjsUsqEVwbYAt0yy9RbZwjt8LDeKYNIR-CbJy6gqH2xxbHpR_GaJ_qC8my7jdwoVpDtENOIOsr5py_lwfXo3HmNU9H3TuqfKqH71mHxYwa-7t2FOanHh8yKajaHH486tHjldNgH6MCYO4jdsfa_MG9B9Pl5iQ/UsJIpubr2m3-lsb4s_zowLs85mSStHbFWG-il4FsHyo",
    "price": 107.88,
    "prevClose": 109.49,
    "absReturn": -1.6099999999999994
  },
  {
    "fullTicker": "VICR:USA",
    "baseTicker": "VICR",
    "rank": 73.9286,
    "description": "Vicor Corporation, together with its subsidiaries, designs, develops, manufactures, and markets modular power components and power systems for converting electrical power in the United States, Europe, the Asia Pacific, and internationally. The company offers a range of brick-format DC-DC converters; complementary components provide AC line rectification, input filtering, power factor correction, and transient protection; and input and output voltage, and output power products, as well as sells electrical and mechanical accessories. It also designs, sells, and services custom power systems solutions. The company serves independent manufacturers of electronic devices, original equipment manufacturers, and their contract manufacturers in the aerospace and aviation, defense electronics, satellites, factory automation, instrumentation, test equipment, transportation, telecommunications and networking infrastructure, and vehicle markets. Vicor Corporation was incorporated in 1981 and is headquartered in Andover, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/Ilp9UoVa6PbQzTKIBN6L3Q/X0sZGWGrXqYJsaxXoAHln0q-P7GRD3YavAIULr-Xcus44LrtbQHWAN7u3XvsM2VRkWsLxaQMS_d1Sdm9wXJiNQStL2u4eM2AjWQ-gE_BYyTBnNgGQSgScET6Npi3CYTT8I4RSNfFsxntpA7n6wrHzHJT30669QKrnZPZYhcCnL0/WFH6tT8tfw9jte1SzCWKSbFdR9UHSpYyPBPFncZMrwA",
    "price": 104.4,
    "prevClose": 98.29,
    "absReturn": 6.109999999999999
  },
  {
    "fullTicker": "VCYT:USA",
    "baseTicker": "VCYT",
    "rank": 76.7476,
    "description": "Veracyte, Inc. operates as a diagnostics company in the United States and internationally. The company offers Afirma Genomic Sequencing Classifier for cancerous thyroid nodules; Decipher Prostate Genomic Classifiers for prostate cancer diagnosis; Decipher Bladder Genomic Classifier for bladder cancer diagnosis; Prosigna Breast Cancer Assay for breast cancer diagnosis; and Percepta Nasal Swab Test for lung cancer diagnosis. It is also developing the nCounter analysis system services. The company was formerly known as Calderome, Inc. and changed its name to Veracyte, Inc. in March 2008. Veracyte, Inc. was incorporated in 2006 and is headquartered in South San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/Ed9vZzQ7sSjRYgJiiDkNkg/AHhEuFpb9GNhnkMsc59uiC8XeWtcfRE4JX_pAGeV3UUxNGu9ocWexHVCBs2NLOcAfcjUqYCm6RCPXc-1Rv0cBBpnbJwO0ETXZ3TtFJVsZld8aujj2LsdxkySp23VBr_vZh6VtSepWp01NJvxj8uQhfUXmEfBQuhdTARKPG231VE/mHygqJ-dfySUau3w3TNcIyotNI7eDwBzHEedaBDP7gQ",
    "price": 42.92,
    "prevClose": 42.04,
    "absReturn": 0.8800000000000026
  },
  {
    "fullTicker": "BDX:USA",
    "baseTicker": "BDX",
    "rank": 80.1695,
    "description": "Becton, Dickinson and Company develops, manufactures, and sells medical supplies, devices, laboratory equipment, and diagnostic products for healthcare institutions, physicians, life science researchers, clinical laboratories, pharmaceutical industry, and the general public worldwide. The BD Medical segment provides peripheral intravenous (IV) and advanced peripheral catheters, central lines, acute dialysis catheters, vascular access technology, vascular care and preparation products, needle-free IV connectors and extensions sets, closed-system drug transfer devices, hazardous drug detections, hypodermic syringes and needles, anesthesia needles and trays, enteral syringes, and sharps disposal systems; IV medication safety and infusion therapy delivery systems, medication compounding workflow systems, automated medication dispensing and supply management systems, informatics and analytics and pharmacy automation systems, and medication inventory optimization and tracking systems; hemodynamic monitoring systems; and prefillable drug delivery systems. The BD Life Sciences segment offers specimen and blood collection products; automated blood and tuberculosis culturing, molecular testing, microorganism identification and drug susceptibility, and liquid-based cytology systems, as well as rapid diagnostic assays, microbiology laboratory automation products, and plated media products; and fluorescence-activated cell sorters and analyzers, antibodies and kits, reagent systems, and solutions for single-cell gene expression analysis, as well as clinical oncology, immunological, and transplantation diagnostic/monitoring reagents and analyzers. The BD Interventional segment provides hernia and soft tissue repair, biological and bioresorbable grafts, biosurgery, and other surgical products; surgical infection prevention; peripheral intervention products; and urology and critical care products. The company was founded in 1897 and is headquartered in Franklin Lakes, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/TGBzprtpUQyvPpS7wnkoZA/NtWFILgUtcUQiY83ww8_bwurL4CiBOLiW8y7VAQk1y8NjjKXg4LRtYJfJzqQPXgxeUNRpCwKwI9N_ydzbnWv6_4IgpxpoZmg0iPGW7scMacmc_OAzTyRsFQuQMLlceGv8j-G3MyuDaKXsHVeMcQ5qJyhHx0fPVacI3SQCBmp0sQWY-WtNRozAQ0uOZ3v-iN2/K7ym5h1Pb1B6QqjB1nGAJ1BJqtdqEcYeD01Rizutfr0",
    "price": 195.59,
    "prevClose": 194.7,
    "absReturn": 0.8900000000000148
  },
  {
    "fullTicker": "AXL:USA",
    "baseTicker": "AXL",
    "rank": 85.286,
    "description": "American Axle & Manufacturing Holdings, Inc., together with its subsidiaries, designs, engineers, and manufactures driveline and metal forming technologies that supports electric, hybrid, and internal combustion vehicles. It operates through two segments, Driveline and Metal Forming segments. The Driveline segment offers front and rear axles, driveshafts, differential assemblies, clutch modules, balance shaft systems, disconnecting driveline technology, and electric and hybrid driveline products and systems for light trucks, sport utility vehicles, crossover vehicles, passenger cars, and commercial vehicles. The Metal Forming segment provides range of products, such as engine, transmission, driveline, and safety-critical components for traditional internal combustion engine and electric vehicle architectures, including light vehicles, commercial vehicles, and off-highway vehicles, as well as products for industrial markets. It operates in North America, Asia, Europe, and South America. The company was founded in 1994 and is headquartered in Detroit, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/oCJbbu0yOVnQhMJepB-sEQ/R8Go9se0a4aMydFcMgdN8Z8xrsjND6e9SBZ1wmcmC06iQcFbWNyOAAKBr6Hr6UXhQ8X3j3hJnk0HAsTTDbnk3XLhKrdjSW0qq6vb6d5NNisnEG-zybfbXeyYqaK3gUqH7yLQBOy_vGz6Q4TKQLGze54jeQ1HtDS-Qe9hQtvAPQJ9ucn-cyD6eKquc3wmoeYeS8Wba0H4eQ1TgSyTKDTnEA/OP5nLXymoeURBoCpw2Na9LJxI-wF3tk3Tuw0JPjCLYE",
    "price": 6.63,
    "prevClose": 6.7,
    "absReturn": -0.07000000000000028
  },
  {
    "fullTicker": "SIG:USA",
    "baseTicker": "SIG",
    "rank": 91.9179,
    "description": "Signet Jewelers Limited operates as a diamond jewelry retailer. It operates in three segments: North America, International, and Other. The North America segment operates jewelry stores in jewelry stores in malls, mall-based kiosks, and off-mall locations in the United States and Canada primarily under the Kay Jewelers, Zales Jewelers, Jared Jewelers, Diamonds Direct, Banter by Piercing Pagoda, Peoples Jewellers, Rocksbox brands, as well as operates online through its digital brands, James Allen and Blue Nile. This segment also engages in jewelry subscription business. Its International segment operates stores in shopping malls, off-mall locations, and online primarily under the H.Samuel and Ernest Jones brands in the United Kingdom, Republic of Ireland, and Channel Islands. The Other segment engages in the purchase and conversion of rough diamonds to polished stones, as well as the provision of diamond polishing services. Signet Jewelers Limited was founded in 1862 and is headquartered in Hamilton, Bermuda.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/BzzViyXmueIrhxPh0cbdgQ/lE9Sxye0Plb0RaPRM-9K3eLjtOaDh6YbTMQuulPWXbSgaZaXp247JkhsqrryLGC7dti_CDgSXkZpEbSU-oEHCbFrfv0J532RlUpLhyn1zlZOl4I_4oT_rNNbzEGG9IQa0MbWCYVTTgthjyQyPahD-jnU7koX6295q41Dpo916W6MvTl1pXhGjqVcIvTBwizy/qxmo41-sQA5Pmbd0nRtmQLGZDhXZVKrR5DNyKlu6wow",
    "price": 83.33,
    "prevClose": 83.01,
    "absReturn": 0.3199999999999932
  },
  {
    "fullTicker": "MDXG:USA",
    "baseTicker": "MDXG",
    "rank": 97.7513,
    "description": "MiMedx Group, Inc. develops and distributes placental tissue allografts for various sectors of healthcare. The company processes the human placental tissues membrane, and umbilical cord and the placental disc utilizing its patented and proprietary PURION process to produce allografts that retains the tissue's inherent biological properties and regulatory proteins, including cytokines, chemokines, and growth factors. Its patented and proprietary processing method employs aseptic processing techniques in addition to terminal sterilization. The company's wound care products include EPIFIX, EPICORD, and EPIEFFECT sheets for use as protective barriers that enables a healthcare provider to select an appropriate size graft based on the size of the wound to reduce product waste. Its surgical and other product offerings consist of AMNIOFIX and AMNIOEFFECT for applications in a variety of applications and surgical settings, including lower extremity repair, plastic surgery, vascular surgery, and various orthopedic repairs and reconstructions. The company's products are used in the areas of wound care, burn, and surgical fields in healthcare. It sells its products through direct sales force and independent sales agents, as well as to individual customers and independent distributors in the United States. MiMedx Group, Inc. was founded in 2006 and is headquartered in Marietta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/dVffNcw_9qcw2O0S-Dq79g/abtkaXZA-hPqX4iLMcKXw_9x8QjPyqbdYq8ktJoWRTM3REoz6rUQ-cTpM5snf1wUNtWgnIccKyAx3Mu9h_F5faVFR2gHvlH1LXXdxAStdXHe8nBfHfLeSSjNecPOyFUGvDT6cBbOysKpQ2rknvfM7kZXDT5TPQFAXdIxIWlwtXGneuG-WldwsJAh4kaloHtD/HRPF99_wI49OePwGu4BQmqrBeDrr3njyvXgfkUJbsEA",
    "price": 7.05,
    "prevClose": 7.25,
    "absReturn": -0.20000000000000018
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 680.59,
    "prevClose": 674.494485045818,
    "absReturn": 6.095514954182022
  }
]