[
  {
    "fullTicker": "MSW:USA",
    "baseTicker": "MSW",
    "rank": 5.9874,
    "description": "Ming Shing Group Holdings Limited, through its subsidiaries, engages in wet trades works. The company's works include plastering, tile laying, brick laying, floor screeding, and marble works in Hong Kong. It serves public and private sectors. The company was incorporated in 2022 and is based in San Po Kong, Hong Kong.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/PvnQmmupZbTC5OF_-7ZnPg/8MIWtgn7DhXcqNhv85opC-HW4s18BmlKtXy5eM52EjhmpYD0kUe498K9Og-eyKoDJNWfGkhcxvu64M4GO7r661u1Hc2vn3RkRvAuyL78Df7urBEXUiD3WSAg7YAxlF4EFH5oQ1dtLFmrL_73JsWnSlzaaNReV0e5UJ1pzffedSpLvn3mA4YwZahz9cSBxiLR/KUNowikLIBGad8I0F-WH0Sgw1eG4zWkQiDaaoYQ88Sw",
    "price": 2.335,
    "prevClose": 2.4,
    "absReturn": -0.06499999999999995
  },
  {
    "fullTicker": "KOPN:USA",
    "baseTicker": "KOPN",
    "rank": 10.1888,
    "description": "Kopin Corporation, together with its subsidiaries, invents, develops, manufactures, and sells microdisplays, subassemblies, and related components for defense, enterprise, industrial, and consumer products in the United States, the Asia-Pacific, Europe, and internationally. It offers miniature active-matrix liquid crystal displays, liquid crystal on silicon displays/spatial light modulators, organic light emitting diode displays, microLED display technologies, application specific integrated circuits, backlights, and optical lenses; and head-mounted and hand-held VR products. The company's products are used for soldier thermal weapon rifle sights, avionic fixed and rotary wing pilot helmets, armored vehicle targeting systems, and training and simulation headsets; industrial and medical headsets; 3D optical inspection systems; and consumer augmented reality and virtual reality wearable headsets systems. Kopin Corporation was incorporated in 1984 and is headquartered in Westborough, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/yi9oU5k-nLEj77E0GtTbXg/4GwnnZxuzMtJIcIhUn-Z6zPBKWSlM8DiDu7Jnp6ju4rKEtc-peh5ScO1QBk9RZsAXq-K9vyGkQG2HYl0Up392qUay1Ulvp12dUFA9EOK8lcY0Y-t_0dWXE8ZS8bao7VfZM6rc_xm7j4yibDOE6xURlaELc-PGSn1-RYzgM7Nl4E/Bgm3xpTIpJTm8_wSixe9bB1pB1OC27ibiVRytHy0bis",
    "price": 3.685,
    "prevClose": 3.99,
    "absReturn": -0.30500000000000016
  },
  {
    "fullTicker": "ALUR:USA",
    "baseTicker": "ALUR",
    "rank": 23.0311,
    "description": "Allurion Technologies Inc. focuses on ending obesity with a weight loss platform to treat people who are overweight. Its platform, the Allurion Program, features swallowable and procedure-less intragastric balloon for weight loss (the Allurion Balloon), as well as offers access to AI-powered remote patient monitoring tools, a proprietary behavior change program, secure messaging, and video telehealth that are delivered by the Allurion Virtual Care Suite. Allurion Technologies Inc. is headquartered in Natick, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/7vG78ICvveI5xRgspvgOiQ/jUQ3MqAL83R-s0lI4vmz8PkB7eBeXCDOc_lqShcoaN0FqYr4PnZu1uV9eGbhbSVWedRHxHb1Hy2B2G2AfdD4j1c2oFC_N2h9O0kZDwhE5Fkv8bJQD8S2bkyFlp-vEQ6e9uGVKtWvLIMaTOvibadab3VPnyXx6QcjqoO9BGNAGSFKyR5_HgCrOcZw0xulZVmM/LAGx_Rvxh8VCngvwEo4yO52oknQi20CVIOW975aG6VA",
    "price": 2.03,
    "prevClose": 2.05,
    "absReturn": -0.020000000000000018
  },
  {
    "fullTicker": "ADCT:USA",
    "baseTicker": "ADCT",
    "rank": 23.8646,
    "description": "ADC Therapeutics SA focuses on advancing its proprietary antibody drug conjugate (ADC) technology platform to transform the treatment paradigm for patients with hematologic malignancies and solid tumors. Its flagship product is ZYNLONTA, a CD19-directed ADC, received accelerated approval from the U.S. Food and Drug Administration and conditional approval from the European Commission for the treatment of relapsed or refractory diffuse large B-cell lymphoma (DLBCL) after two or more lines of systemic therapy. The company is also seeking to continue expanding ZYNLONTA into international markets and into earlier lines of DLBCL and indolent lymphomas, including follicular lymphoma (FL) and marginal zone lymphoma (MZL) as a single agent and in combination through its LOTIS-5 confirmatory Phase 3 clinical trial and LOTIS-7 Phase 1b clinical trial, as well as through investigator-initiated trials (IITs). In addition, it is investigating a CD-22 targeted compound, ADCT-602 that is in a Phase 1/2 investigator-initiated study in relapsed or refractory B-cell acute lymphoblastic leukemia. Further, its clinical-stage pipeline consists of ADCT-601 (mipasetamab uzoptirine) targeting AXL as a single agent and/or in combination in sarcoma, pancreatic, and NSCLC, as well as pre-clinical stage pipeline includes a portfolio of next generation investigational ADCs targeting Claudin-6, NaPi2b, PSMA, and other undisclosed targets. The company was incorporated in 2011 and is headquartered in Epalinges, Switzerland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/yWehS9b3ihS4wa7tqao_KQ/LU3e2hr98mQ3XklAPipZDWcDrmfWEhm3sPXDz1wt-rvXcBB5h-TWpobECWeNDiSTZR-Pi8ZGoTAdK4fjLbCQNp5m416MmljeRgkqtGOLq_ZDTbcgeHHBov2PsLoR6nwfIGwTLvvIxsLfCEt0kpIGMzQRNTLoC32JWwFWwz1iUulafdM66VPsXCGh3wIEWV-o/izbBZh-xY42SOaQPGQuLe4pu6KKqkwITNf3nIZIZGTo",
    "price": 4.145,
    "prevClose": 4.26,
    "absReturn": -0.11500000000000021
  },
  {
    "fullTicker": "SNBR:USA",
    "baseTicker": "SNBR",
    "rank": 34.4787,
    "description": "Sleep Number Corporation, together with its subsidiaries, designs, manufactures, markets, distributes, retails, and services sleep solutions in the United States. It offers smart beds and adjustable bases, pillows, sheets, and other bedding products. The company sells its products direct-to-consumer retail touch points, including stores, online, phone, and chat. The company was formerly known as Select Comfort Corporation and changed its name to Sleep Number Corporation in November 2017. Sleep Number Corporation was incorporated in 1987 and is headquartered in Minneapolis, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/wNFX1TLLM-bblvSeMwrXig/lCwQs0F8M5S4CLeD0ftxBaw-clQWPHWpbIuyY2cWQ93tkj3Yolb9ct_jImd3X_8kGnp-bV1RQlO7ueC-r1rIpALSgFZUTrL5oAOQ9D5-ruYWoCiUdC08HTFq7h0r0gAhGDxHL4LAO0_tsN9wgRHdXhujbWfdM6SAldQ5EnZx0ct7Q_TK_QGtVC4VlPvR4GeC/w92QcHP0g4y-5loAUKvmeo-n6i2LI5eDDgG2m84UOak",
    "price": 6.515,
    "prevClose": 6.55,
    "absReturn": -0.03500000000000014
  },
  {
    "fullTicker": "JACK:USA",
    "baseTicker": "JACK",
    "rank": 44.8716,
    "description": "Jack in the Box Inc. operates and franchises quick-service restaurants under the Jack in the Box and Del Taco brands in the United States. The company was founded in 1951 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/o1qSJxcKT8M_a8BMECAdpg/18K2F1MKXzyJWVbx4MceDcKMxS-fSzTDPgGFS3yd3eY14Bl073VfL0SJh1r1cSbi3fE-QK-aoXCowHNh_mRxBittkAz09lg64ejfsOStHElq7av6F0GbHeqNbLFFwI8d7TqQspJmpE09Ot2f6eyXSqMJE65GLYly8chUilJ3H7YgTkbnx8C3uG1I3OrR_wu6/s0gSNDzn2mTtxo_8WBBIaYzE8BoBsqQZddsRob_AhE0",
    "price": 17.4,
    "prevClose": 19.28,
    "absReturn": -1.8800000000000026
  },
  {
    "fullTicker": "GWW:USA",
    "baseTicker": "GWW",
    "rank": 58.7175,
    "description": "W.W. Grainger, Inc., together with its subsidiaries, distributes maintenance, repair, and operating products and services primarily in North America, Japan, and the United Kingdom. It operates through two segments, High-Touch Solutions North America and Endless Assortment. The company provides safety, security, material handling and storage equipment, pumps and plumbing equipment, cleaning and maintenance, and metalworking and hand tools. It also offers technical support and inventory management services. The company provides safety, security, material handling and storage equipment, pumps and plumbing equipment, cleaning and maintenance, and metalworking and hand tools. It also offers technical support and inventory management services. The company serves smaller businesses to large corporations, government entities, and other institutions, as well as commercial, healthcare, and manufacturing industries through sales and service representatives, and electronic and ecommerce channels. W.W. Grainger, Inc. was founded in 1927 and is headquartered in Lake Forest, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/ksxA5msOfSWkwkVSFgCrEA/sVifBoA7d8X5Gw9aSdtqs5Peks9cDUh8CbxBgkP-YVwvfW7bQUN3LfOcy4hfVofC9hwPjWTO0dpKhCwMOr01mxe8aa9xOAhjjChfP3Ux_mj_bTpqoa11ExbQ-NEeuhI_Qyu-Vy61quhSIinJYLTriXB2LwF8F03pZMcZeq61F3E/c0HxObmQabYI2H3t5-ZM3OSA4d_1NJ9d7P6zjmglo0E",
    "price": 957.82,
    "prevClose": 957.99,
    "absReturn": -0.16999999999995907
  },
  {
    "fullTicker": "ORI:USA",
    "baseTicker": "ORI",
    "rank": 68.1919,
    "description": "Old Republic International Corporation, through its subsidiaries, provides insurance underwriting and related services primarily in the United States and Canada. The company operates in two segments, Specialty Insurance and Title Insurance. The Specialty Insurance segment offers accident and health, aviation, commercial auto, commercial multi-peril, commercial property, excess and surplus, general liability, home and auto warranty, inland marine, travel accident, and workers' compensation insurance products; and financial indemnity products for specialty coverages, including errors and omissions, fidelity, directors and officers, and surety. This segment provides its insurance products to businesses, state and local governments, and other institutions in transportation, commercial construction, healthcare, education, retail and wholesale trade, forest products, energy, general manufacturing, and financial services industries. The Title Insurance segment offers lenders' and owners' policies to real estate purchasers and investors based upon searches of the public records. This segment also provides escrow closing and construction disbursement services; and real estate information products, national default management services, and various other services pertaining to real estate transfers and loan transactions. Old Republic International Corporation was founded in 1923 and is based in Chicago, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/3g7Xt_0sozrvIXoE4b_-xA/0GEksbUUV_5r2ogaGo_Z7nJvRuaODVlNrQeJ5vJdEM0x1-DEWG6Snm51FNAgkrurGO4ouuRnGeN-WqyTCCHN6wu6ClqjUIJKfClfxPICr1qofg9W2m0-TM9KKtTkeRwdLt57T2Jf5S3JO3W2cQl7AfUJcl1sTnPiz5G8VD99MMqwjw39KFtHcwN9ubGFK9H0/pwPRob9FHf-5RRX2rX6C3rF2nE1z64poLIW1iMWh7ug",
    "price": 41.105,
    "prevClose": 42.8,
    "absReturn": -1.6950000000000003
  },
  {
    "fullTicker": "ARTNA:USA",
    "baseTicker": "ARTNA",
    "rank": 78.925,
    "description": "Artesian Resources Corporation, through its subsidiaries, provides water, wastewater, and other services in Delaware, Maryland, and Pennsylvania. The company distributes and sells water to residential, commercial, industrial, governmental, municipal, and utility customers, as well as for public and private fire protection in the states of Delaware, Maryland, and Pennsylvania; and offers wastewater collection, treatment infrastructure, and wastewater services to customers in Delaware. It also provides contract water and wastewater services; water, sewer, and internal service line protection plans; and wastewater management services, as well as design, construction, and engineering services. In addition, the company offers services to other water utilities, including operations and billing functions; owns real estate properties, including land for office buildings, a water treatment plant, and wastewater facility; and provides design, installation, maintenance, and repair services related to existing or proposed storm water management systems. As of December 31, 2023, it served approximately 95,900 customers in Delaware; 2,600 customers in Maryland; and 40 customers in Pennsylvania through 1,470 miles of transmission and distribution mains. Artesian Resources Corporation was founded in 1905 and is headquartered in Newark, Delaware.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/5doSld3DjSGCm40fV5tqEA/0mdhwEPQzf5kDon61wdkmK-ocxZkJpp4HPqW22Jt5-cQM50lbbyOshNwvARwP5U5WJ9QiE4Zz81pGUrnYhIsEL6lUg6uJSDxNAL7qLeHizgH8akCd9uhrrxluTCzqcRvaVzo2xivCNNfyn7tdwDswNWrqkSeQXtgy7g-pVLFJ8xFHsScLjyWMGJSK-fpBaBP/aLvsDiYLtCw3a0q01IqfQv3z5INb3yDFbzDAnDQZ9yk",
    "price": 33.58,
    "prevClose": 33.3,
    "absReturn": 0.28000000000000114
  },
  {
    "fullTicker": "AREN:USA",
    "baseTicker": "AREN",
    "rank": 95.6625,
    "description": "The Arena Group Holdings, Inc., together with its subsidiaries, operates digital media platform in the United States and internationally. The company offers the Platform, a proprietary online publishing platform comprising publishing tools, video platforms, social distribution channels, newsletter technology, machine learning content recommendations, notifications, and other technology. The company also offers content from individual creators to the HubPages network of premium content channels, such as PetHelpful, dengarden and Fashionista for writers, explorers, knowledge seekers, and conversation starters to connect in an interactive and informative online space under the HubPages brand. In addition, it operates the media business for Sports Illustrated brand. Further, the company owns and operates brands, including TheStreet, a financial news and information provider to investors and institutions, and produces business news and market analysis for individual investors; The Spun, an online independent sports publication; Parade, an entertainment coverage with stories and health content; and Men's Journal, a suite of digital assets that provides audience with access to premium active lifestyle brands. The company was formerly known as TheMaven, Inc. and changed its name to The Arena Group Holdings, Inc. in February 2022. The company is based in New York, New York. The Arena Group Holdings, Inc. operates as a subsidiary of Authentic Brands Group Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760652000000/l8HUBWosHFqZ-tv39qWnxw/pOrsreOsQ6eBcMhPc-JUeDTlMuWnJ-ApF03EMXZutvOLKeeue8Zwy6GMjUyFsML98azk2xQfpxSfC1_xemCS9y8_nb0eZlRxMvxwsNxiSXZpssuplo2f30RbMfgdezDcsNoaF2etkRCz4CQrYpRlAU4ck5a2gqfoYgOFctIfhUn_VASNy5RkNCLrMZun5I_3/QoZYaAxow7NRXV4-LsDkkMuXBxB1kXavvKJD3Y1rZlM",
    "price": 4.77,
    "prevClose": 4.88,
    "absReturn": -0.11000000000000032
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 659.86,
    "prevClose": 665.17,
    "absReturn": -5.309999999999945
  }
]