[
  {
    "fullTicker": "HOUS:USA",
    "baseTicker": "HOUS",
    "rank": 33.0569,
    "description": "Anywhere Real Estate Inc., through its subsidiaries, provides residential real estate services in the United States and internationally. It operates through three segments: Anywhere Brands, Anywhere Advisors, and Anywhere Integrated Services. The company franchises the Better Homes and Gardens Real Estate, Century 21, Coldwell Banker, Coldwell Banker Commercial, Corcoran, ERA, and Sotheby's International Realty brands; and provides global relocation services under Cartus brand, as well as lead generation activities. It also operates a full-service residential real estate brokerage business under the Coldwell Banker, Corcoran, and Sotheby's International Realty brand names to assist home buyers and sellers in listing, marketing, selling, and finding homes; and involved in real estate auction joint venture. In addition, the company provides full-service title, escrow, and settlement services to consumers, real estate companies, corporations, and financial institutions. The company was formerly known as Realogy Holdings Corp. and changed its name to Anywhere Real Estate Inc. in June 2022. Anywhere Real Estate Inc. was incorporated in 2006 and is headquartered in Madison, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/e4IF4F10IdV-GIJzZhX5Zg/otX9zB4ABolfWLPlXSDNQTJ8eu4RQVkwhPTL5rD0sxQe_aKvy4ETpvsgXgkTCqiKzuQbfXq0GznnsNAMXMzUWWXjfiE9Y2HPtt5bCYfHvaGtwSrIzuJFbI2JNAThx5GetAEe3fTnv190oESGojKogR0VxpTe3Atwkjmge8aag0tggkhEUsh-U93qhpAY8Vnf/GyJgrUXhX-6A97elREPKQIF-gzqE19G8Q5Po-Oai8xM",
    "price": 7.14,
    "prevClose": 6.81,
    "absReturn": 0.33000000000000007
  },
  {
    "fullTicker": "OGE:USA",
    "baseTicker": "OGE",
    "rank": 39.6233,
    "description": "OGE Energy Corp., through its subsidiary, operates as an energy services provider in the United States. The company generates, transmits, distributes, and sells electric energy. It also owns and operates coal-fired, natural gas-fired, wind-powered, and solar-powered generating assets. The company provides retail electric service to approximately 709,000 customers that covers a service area of approximately 30,000 square miles. OGE Energy Corp. was founded in 1902 and is based in Oklahoma City, Oklahoma.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/NtBgX266ZNJ1tHrqZ1qYCQ/x3dLHJIW8tg6rU6-ebA1zUTeK2bVm124T4Po-WsF1bZEbJb55IUAfxmYaqttxsXPOHfUCaWPw0X0OK7k-asOfJwpejyfnf5ihhoOBC8DiLA2C30Ua6w8giDvAXRl0HtIelIFsDWsqrjEqn1LJTgQ7t8m6NeeWQYTrAT82p9RNDOWW-6n94DhrzaEILixGbD4/mSh8ISKi3ryx7o3rq9amsqWh2Vcrj9GGRSH56dNUwPI",
    "price": 44.47,
    "prevClose": 44.2,
    "absReturn": 0.269999999999996
  },
  {
    "fullTicker": "COHU:USA",
    "baseTicker": "COHU",
    "rank": 45.5504,
    "description": "Cohu, Inc., through its subsidiaries, provides semiconductor test equipment and services in the United States, China, Malaysia, the Philippines, Singapore, and internationally. It supplies test and inspection metrology automation systems, micro-electromechanical system test modules, test contactors, thermal subsystems, and data analytics software for semiconductor manufacturers and test subcontractors. The company also provides semiconductor automated test equipment for wafer level and device package testing; various test handlers, including pick-and-place, turret, gravity, strip, film frame, laser marker, and thermal sub-systems; interface products comprising test contactors, and probe heads and pins; spares and kits; various parts and labor warranties on test and handling systems, and instruments; and training on the maintenance and operation of its systems, as well as application, data management software, and consulting services on its products. In addition, it offers data analytics product that includes DI-Core, a software suite used to optimize Cohu equipment performance, which provides real-time online performance monitoring and process control. Further, the company provides artificial intelligence process control and analytics-based monitoring software. It markets its products through direct sales force and independent sales representatives. The company was formerly known as Cohu Electronics, Inc. and changed its name to Cohu, Inc. in 1972. Cohu, Inc. was incorporated in 1947 and is headquartered in Poway, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/HrHs0CwtvhBqW_CWatYJFg/67mrtkaifUSqPYHlYcl3TYdZiXuDVzjbu7tPbfbONkv1en-x18EqEZh3onAYsCv1NHdJU3o32qVDEmF0mUj3tz6X3rqj66KGjDR6sGjDZ_V5UFmnh61lIg5IIAELSpjodNbbYI9x3J0s7kobX69QgAaHfK4BEs2BdIKr5D4I9gc/MkJ-ObAX6u8hx-8snHOjPPoQ8RUVzrngfgDDcCdXqJI",
    "price": 20.65,
    "prevClose": 21.25,
    "absReturn": -0.6000000000000014
  },
  {
    "fullTicker": "ES:USA",
    "baseTicker": "ES",
    "rank": 51.3046,
    "description": "Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates through Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution segments. It is involved in the transmission and distribution of electricity; solar power facilities; and distribution of natural gas. The company operates regulated water utilities that provide water services to residential, commercial, industrial, municipal and fire protection, and other customers in Connecticut, Massachusetts, and New Hampshire. The company was formerly known as Northeast Utilities and changed its name to Eversource Energy in April 2015. Eversource Energy was incorporated in 1927 and is headquartered in Springfield, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/BAwCFqPuyiKX4xatIgMqUg/F-xmcRofkMaNPhs_cfFnoQd5l7NMUgzPVLiRa1VjEERa5pbWfn0p9lVk7KBsJvwSOKVzXgBhx-LJNQZyvWNMT8duvcWpREYpdXXgGh_zj6bI9ztFhyz_SaE9EyYdgWQbdlnkHR28gksxNx45zXcY70dNrSUAI_CsL7GDRTtAK-D15AeOkengz-XiYUQq15ze/WsZUx0lgQuqqiKsUIXmc02KaSdK4tAgQ2b5kKl9ofGI",
    "price": 65.7,
    "prevClose": 65.05,
    "absReturn": 0.6500000000000057
  },
  {
    "fullTicker": "HUBS:USA",
    "baseTicker": "HUBS",
    "rank": 61.1543,
    "description": "HubSpot, Inc., together with its subsidiaries, provides a cloud-based customer relationship management (CRM) platform for businesses in the Americas, Europe, and the Asia Pacific. The company's CRM platform includes Marketing Hub, a toolset for marketing automation and email, social media, SEO, and reporting and analytics; Sales Hub offers email templates and tracking, conversations and live chat, meeting and call scheduling, lead and website visit alerts, lead scoring, sales automation, pipeline management, quoting, forecasting, and reporting; Service Hub, a service software designed to help businesses manage, respond, and connect with customers; and Content Hub enables businesses to create new and edit existing web content. It offers Operations Hub, which is designed for customer data to automate business processes, data cleanup, and provide customer insights and connections; and Commerce Hub, a B2B commerce suite. In addition, the company provides professional services to educate and train customers on how to utilize its CRM platform; and customer success, as well as phone and/or email and chat-based support services. It serves mid-market business-to-business companies. The company was incorporated in 2005 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/ddpa4Ix6SnZMw47n62ppgA/WhOW60WhdsZa4ZBkk60DL_s6twxLx9oUprYRo0RA9iPGc4HLqy05vk5wluQmm3WLIIUAksjcU3tsG921dCXGDnXZNPUPHwTinKnluDPFptGPcTOczQHw0JMSIEY-rAOMLJR9GbUls_2JalDx3Oy1_JPmQYN5ZTzXoSc0rb1Y9Lo/XAEi4cEv3Tprj3gf2ZeVkayDBujS5j2roPIrRMOXPZc",
    "price": 491.48,
    "prevClose": 496.79,
    "absReturn": -5.310000000000002
  },
  {
    "fullTicker": "IDCC:USA",
    "baseTicker": "IDCC",
    "rank": 66.2519,
    "description": "InterDigital, Inc. operates as a global research and development company focuses on wireless, visual, artificial intelligence (AI), and related technologies. The company engages in the design and development of technologies that enable connected in a range of communications and entertainment products and services, which are licensed to companies providing various products and services, including makers of wireless communications devices, consumer electronics, IoT devices, and cars and other motor vehicles, as well as providers of cloud-based services, such as video streaming. It designs and develops a range of innovations for use in digital cellular and wireless products and networks. The company also develops cellular technologies, such as technologies related to CDMA, TDMA, OFDM/OFDMA, and MIMO for use in 2G, 3G, 4G, and 5G wireless networks, as well as mobile terminal devices; and 3GPP technology portfolio in 5G, 5G, advanced and 6G, as well as technologies for mobile phones, automobiles and autonomous vehicles, wearables, smart factories and smart homes, robots, drones, and other connected consumer electronic products. In addition, it provides video coding and transmission technologies; and researches and develops artificial intelligence and machine learning solutions. Further, the company's patented technologies are used in various products that include smartphones, tablets, consumer electronics, and base stations; televisions, laptops, gaming consoles, set-top boxes, streaming devices, and connected automobiles. InterDigital, Inc. was incorporated in 1972 and is headquartered in Wilmington, Delaware.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/118E29oIARHS2BoyLT6Ufw/ylLcIo8dAW90lnCLloTszoYZY_BbbaI0l9LW6cDtUQtX444pELn5HIsc-d2TmS_su6DW9Ty4dvFtzag9F06-MmTLvaISLqS7J9d_igoq-XPRCkKzIcrdkJDJVZ7KTNXli0yLrdxzpWt9u96FRp2n2qTeOR3mqZhvZadMtoAzdaiK61gbk2Iu10z7wmhzsIdl/twQAe7iDTgWvDGdAZi_tslsUBnqD5Lm2ZWhinbZhTpI",
    "price": 322.87,
    "prevClose": 324.87,
    "absReturn": -2
  },
  {
    "fullTicker": "NWPX:USA",
    "baseTicker": "NWPX",
    "rank": 70.9867,
    "description": "Northwest Pipe Company, together with its subsidiaries, engages in the manufacture and sale of water-related infrastructure products in North America and Canada. It operates through two segments, Engineered Steel Pressure Pipe (SPP) and Precast Infrastructure and Engineered Systems (Precast). The SPP segment provides large-diameter and high-pressure steel pipeline systems for use in water infrastructure applications, which are primarily related to drinking water systems. Its products are also used for hydroelectric power systems, wastewater systems, seismic resiliency, and other applications. In addition, this segment makes products for industrial plant piping systems and certain structural applications. The Precast segment offers stormwater and wastewater technology products, precast, and reinforced concrete products, including reinforced concrete pipe, manholes, box culverts, vaults and catch basins, pump lift stations, oil water separators, biofiltration units, steel casing pipes, and bar-wrapped concrete cylinder pipes, as well as pipeline system joints, fittings, specialized components, and other environmental and engineered solutions. The company sells its water infrastructure products under the ParkUSA, Geneva Pipe and Precast, Permalok, and Northwest Pipe Company brands primarily to installation contractors. Northwest Pipe Company was incorporated in 1966 and is headquartered in Vancouver, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/GhlEmUJaxtuoK_0ADJT8_A/nQz4zxuQ-1-50fJ32sAa4cKw42zKGE35cT0unzNDF2hsMA3Z8wFcXSsc5bdKh4EDti4puW8IppARQhmv2UHi2qwslZgUhVZhvDW7j_iCHq0BknpTHv6ZFolPUhLVpr_9DsU4pvqbZomAXgqtVZ4rPA7rbYeDi9RLjZefyjpjv0dfDeJcNQtwlbYW4f_-iSQC/oYDI-ixXyRENEvXmJlpAfqOGBXDwXziO_0h4l5WG3Tw",
    "price": 51.27,
    "prevClose": 53.32,
    "absReturn": -2.049999999999997
  },
  {
    "fullTicker": "PBI:USA",
    "baseTicker": "PBI",
    "rank": 79.7477,
    "description": "Pitney Bowes Inc., operates as a technology-driven company that provides SaaS shipping solutions, mailing innovation, and financial services to small businesses, large enterprises, and government entities around the world. It operates through SendTech Solutions and Presort Services segments. The SendTech Solutions segment provides physical and digital shipping and mailing technology solutions, and other applications for sending, tracking and receiving of letters, parcels and flats, supplies, and maintenance services, as well as financing alternatives to finance equipment and product purchases. The Presort Services segment offers mail sortation services, which allow clients to qualify volumes of first-class mail, marketing mail, marketing mail flats, and bound printed matter for postal workshare discounts. It markets its products, solutions, and services through direct and inside sales force, global and regional partner channels, direct mailings, and digital channels. The company was formerly known as Pitney Bowes Postage Meter Company. Pitney Bowes Inc. was incorporated in 1920 and is headquartered in Stamford, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/PYTBX5vEQswiqkR0nKCImw/7LkpjmYzDkJ_fNExUF1eBSu9kHE7mafA8Hde-qWlyvlm4g64pK3J9CcQsnwkBkgEOQXJofRP_YqLP91LvKgPVDJwrMcf6STPlC8Cuh6LUnPne1JFYC8CS2MYYaJBnr7TeaxFnRqEXqjheaZWQWySn8tStF4GyE00lb5NR10L4Qk-goDxU6Pum5zswBQ7Ounb/-Q9-os_8Us0XDaCFmaFnVBJGJEwsbeV92xCw0C9oz9I",
    "price": 11.41,
    "prevClose": 11.43,
    "absReturn": -0.019999999999999574
  },
  {
    "fullTicker": "PRTH:USA",
    "baseTicker": "PRTH",
    "rank": 84.8281,
    "description": "Priority Technology Holdings, Inc. operates as a payment technology company in the United States. The company operates through three segments: Small and Medium-Sized Businesses (SMB) Payments, Business-To-Business (B2B) Payments, and Enterprise Payments. The company offers SMB payments solutions, such as full-service acquiring and payment-enabled solutions for B2C transactions, leveraging proprietary software platform, distributed through independent sales organizations, direct sales and vertically focused independent software vendors channels. It also offers MX product suite, which includes MX Connect and MX Merchant products, which provides flexible and customizable set of business applications that helps to manage critical business work functions and revenue performance using core payment processing. Additionally, the company offers CPX, a platform that offers accounts payable automation solutions, including virtual card, purchase card, ACH +, dynamic discounting, or check. Further, it provides market-leading accounts payable automation solutions to corporations, software partners and financial institutions, including Citibank, Visa, and Mastercard. Additionally, the company offers embedded finance and BaaS solutions to customers to modernize legacy platforms and accelerate software partners' strategies to monetize payments. It serves SMB and enterprises, as well as distribution partners, including retail and wholesale independent sales organizations, financial institutions, and independent software vendors and value-added resellers. The company was founded in 2005 and is headquartered in Alpharetta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/V8c3yniFZFamAH_pjlBX2g/itqWAVgFc3dBAXu8rk3XxJy0w-xNAyQ_OVzcICR5evyGHQuBn7XCehFhVgcJzi_ujBtGls8tddU-v-vW11TKWnqF1CYp13hcAkfVIfrZfOQfNDY6RgNMHimL58zFFNtmBuWUehXMa9pH4DPJ2NYh3SlvMIkoOCbonRi85urH8km2c4DzZCC0KV-nWkJgD-zLtPadCA-5TjV55ESpvpGkIQ/isaexj0cSM2iPqCVOz_HFhnU1luh_j_UHSPK27Px3Dc",
    "price": 7.54,
    "prevClose": 7.63,
    "absReturn": -0.08999999999999986
  },
  {
    "fullTicker": "DLB:USA",
    "baseTicker": "DLB",
    "rank": 92.6041,
    "description": "Dolby Laboratories, Inc. engages in the design and manufacture of audio, imaging, accessibility, and other hardware and software solutions primarily for application in the television, broadcast, and live entertainment industries in the United States and internationally. The company develops and licenses its audio technologies, such as AAC, HE-AAC, and extended HE-AAC, a digital audio codec solution; AVC, a digital video codec used in STBs, mobile devices, cameras, and broadcast television services and other products; and Dolby Atmos and Dolby Vision include encoding technologies that artists use to create more compelling and immersive audio and video experiences. Its audio technologies also include DD+, an advanced surround sound audio codec technology; Dolby AC-4, an audio codec that uses cutting edge compression; and HEVC, a next-generation digital video codec that compresses video. In addition, the company offers Dolby Cinemas, a premium large format cinemas that deliver a Dolby branded premium cinema offering with Dolby Vision, Dolby Atmos, and a Dolby theater design; Dolby.io, a next generation SaaS product of immersive, interactive, and social experiences with real-time engagement for live events, especially sports; and digital cinema servers, cinema processors, amplifiers, loudspeakers, and audio and imaging hardware and software products for the cinema, television, broadcast, communication, and entertainment industries. Further, it provides various services to support theatrical and television production for cinema exhibition, broadcast, and home entertainment. The company serves film studios, content creators, post-production facilities, and broadcasters. Dolby Laboratories, Inc. was founded in 1965 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757944800000/-ZpLg-wq8yXJkJMLcCLP5g/V4b6iFVaL_JwAs1zNmQhfQE43L06PIVvZ7-nwPZgsIxhUFl4mPEpY3VdxYnwYlnoHNlE1rF8kp8Xb42xfCF4stQ3X9FS5LLkXvCWRvApURM2QM2Ff-6oL4EtOms8-NwhDrXhG_qAwwae3DKxguDyjO1vE3Lmjkg-8csXeQU4bYaRDVpBzsD-hfZ0BKEapxY7/vjsIu47u7TeZ8RHwzd6GDkUlJlU07r-WoRGddsSWjUc",
    "price": 71.44,
    "prevClose": 72.11,
    "absReturn": -0.6700000000000017
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 657.41,
    "prevClose": 657.63,
    "absReturn": -0.22000000000002728
  }
]