[
  {
    "fullTicker": "UPST:USA",
    "baseTicker": "UPST",
    "rank": 3.4897,
    "description": "Upstart Holdings, Inc., together with its subsidiaries, operates a cloud-based artificial intelligence (AI) lending platform in the United States. The company operates through three segments: Personal Lending, Auto Lending, and Other. Its platform includes personal loans, automotive retail and refinance loans, home equity lines of credit, and small dollar loans. Upstart Holdings, Inc. was founded in 2012 and is headquartered in San Mateo, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/RI04IyTadgSHiTCNl4PBxw/DInIIDaTnp358M2b9M13utuNxOaXnOZ79MFnzorE4Nmh1l-y7OgUTL1r0IJToBTaoqc-4-RFvxS414cX0b_SuTKuGjmxt_FZpEkvM8nB3y_yxs1HIrpEAM9u8KTKy2jOmrWqY4DPPqL_UV45_ETlIOhgeDm0i-pUXMMAe3nLeV5wA4wEAT5wSToR3B81BF5B/KDmIQ2i9EPVcdSDZ-InesT7GWD0cp6oQpcGT-PoBGtE",
    "price": 39.25,
    "prevClose": 38.77,
    "absReturn": 0.4799999999999969
  },
  {
    "fullTicker": "CWH:USA",
    "baseTicker": "CWH",
    "rank": 20.7758,
    "description": "Camping World Holdings, Inc., together its subsidiaries, retails recreational vehicles (RVs), and related products and services in the United States. It operates through two segments, Good Sam Services and Plans; and RV and Outdoor Retail. The company provides a portfolio of services, protection plans, products, and resources in the RV industry. It also offers extended vehicle service contracts; vehicle roadside assistance plans; property and casualty insurance; travel protection, travel planning, and directories; and publications, as well as operates the Coast to Coast Resorts and Good Sam Campgrounds. In addition, the company provides new and used RVs; vehicle financing; RV repair and maintenance services; protection plans and services; various RV parts, equipment, supplies, and accessories, which include towing and hitching products, satellite and GPS systems, electrical and lighting products, appliances and furniture, and other products; and collision repair services comprising fiberglass front and rear cap replacement, windshield replacement, interior remodel solutions, and paint and body work. Further, it offers co-branded credit cards; operates Good Sam Club, a membership organization that offers savings on a range of products and services; and facilitates an RV rental platform that connects travelers with RV owners. The company serves customers through dealerships and service centers, and online and e-commerce platforms. Camping World Holdings, Inc. was founded in 1966 and is headquartered in Lincolnshire, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/mpd9myaGKAn9aY_TypvkMg/CygMuhwuWvoI9StyGVKgGM0L80WEGAvpVR2b5T3nCKjN-26QqtMfD8AFo3pX9rwK8kbu1GN_UTOdJTQL3RpkucPF-Cm4sMCn4576I3LltepeuE1J72XYYbR_FwX7BYBu77anmfqjwxaNCwgIwD_DQYda5dDayUCGcdCPjm4V87cdNaMhLkxSl1gQDeXsltO1/e7ueh2YkkgBFkz68dUFxXXlx8xDNZoNl4D4Bhl1_ANA",
    "price": 11.535,
    "prevClose": 11.64,
    "absReturn": -0.10500000000000043
  },
  {
    "fullTicker": "WYNN:USA",
    "baseTicker": "WYNN",
    "rank": 25.3043,
    "description": "Wynn Resorts, Limited designs, develops, and operates integrated resorts. It operates through four segments: Wynn Palace, Wynn Macau, Las Vegas Operations, and Encore Boston Harbor. The Wynn Palace segment operates private gaming salons and sky casinos; a luxury hotel tower with suites, and villas, including a health club, spa, salon, and pool; food and beverage outlets; retail space; meeting and convention space; and performance lake and floral displays. The Wynn Macau segment operates casino space with private gaming salons, sky casinos, and a poker room; a luxury hotel tower, that include health clubs, spas, a salon, and a pool; food and beverage outlets; retail space; meeting and convention space; and Chinese zodiac-inspired ceiling attractions. The Las Vegas Operations segment operates casino space with private gaming salons, a sky casino, a poker room, and a race and sports book; a luxury hotel tower with suites, and villas, including swimming pools, private cabanas, full-service spas and salons, and a wedding chapel; food and beverage outlets; meeting and convention space; retail space; and theaters, nightclubs, a beach club. The Encore Boston Harbor segment operates casino space with gaming areas, and a poker room; a luxury hotel tower including a spa and salon; food and beverage outlets and a nightclub; retail space; meeting and convention space; and a waterfront park, floral displays, and water shuttle service. Wynn Resorts, Limited was incorporated in 2002 and is based in Las Vegas, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/R7mMO3INGNQOhELDwdgkHw/Iags-Ya88C10u-NFGCDVPXLBpTk67lE_iqMFaCKGYdt3ZtVFraf0_bU3_thD28MMO9EKNNpOOGLqbdMY0IR3ERa7NqM-cMxtawL0PPXfN77NZsChFQ7DevKvCIc7z84h5kcU-j25etyv1nDnRKA6884-Rk_9jtoCl5DoH6cLzK7YVu877dDbGx0necO5hKQQ/oSCAk5mxxWY6Ie4njizJD3VdHwnzORmQnYZl8RmDry0",
    "price": 126.235,
    "prevClose": 128.88,
    "absReturn": -2.644999999999996
  },
  {
    "fullTicker": "PI:USA",
    "baseTicker": "PI",
    "rank": 37.8348,
    "description": "Impinj, Inc. operates a cloud connectivity platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. Its platform wirelessly connects items and delivers data about the connected items to business and consumer applications. The company's platform comprises endpoint ICs, a miniature radios-on-a-chip that attaches to a host item and includes a number to identify the item. Its platform also consists of systems products that consists of reader ICs, readers, and gateways to wirelessly provide power to and communicate bidirectionally with endpoint ICs on host items, as well as to read, write, authenticate, and engage the endpoint ICs on those items; and software and algorithms that enable its partners to solve enterprise business problems, such as retail self-checkout and loss prevention. The company primarily serves retail, supply chain and logistics, automotive, aviation, banking, datacenters, food, healthcare, industrial and manufacturing, linen and uniform tracking, sports, and travel industries through original equipment and device manufacturers, tag service bureaus, systems integrators, value-added resellers, independent software vendors, and other solution partners. Impinj, Inc. was incorporated in 2000 and is headquartered in Seattle, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/mfekQUeUHhhlLSV9dMGdEA/q9bhQqD1mB1o5bnvdLwYe0_o3jvRfiijyK4IBIEyrG9yzbm7ANpKMG0rjUMfrLuJh-U8GoywIHj3zqRaJluglGZxzLvcezMYUYbR5CdbMBcbSsirXN7JSb9Eo-oN1h1DPO93F5U5gJ7OQ3jCX3WQrMxHYDlgylfnKAC5QP11ePM/P5mDLtVwMRAhn3BHVLmawvr4b0V4nbbjPRBIU6f0YzA",
    "price": 156.335,
    "prevClose": 160.51,
    "absReturn": -4.174999999999983
  },
  {
    "fullTicker": "TMDX:USA",
    "baseTicker": "TMDX",
    "rank": 45.7556,
    "description": "TransMedics Group, Inc., a commercial-stage medical technology company, engages in transforming organ transplant therapy for end-stage organ failure patients in the United States and internationally. The company offers Organ Care System (OCS), a portable organ perfusion, optimization, and monitoring system that utilizes its proprietary and customized technology to replicate near-physiologic conditions for donor organs outside of the human body. Its OCS includes OCS LUNG for the preservation of standard criteria donor lungs for double-lung transplantation; OCS Heart, a technology for preservation of DBD donor hearts deemed unsuitable due to limitations of cold storage and for ex vivo reanimation, functional monitoring, and beating-heart preservation of donation-after-circulatory-death hearts; and OCS Liver for the preservation of DBD and DCD of donor livers. The company also developed national OCS program, a turnkey solution for outsourced organ retrieval; and provides OCS organ management and logistics services, including aviation and ground transportation, and other coordination activity. The company was founded in 1998 and is headquartered in Andover, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/jChGbeY_QWK7kHSWd3jGHg/htbp0hnZHc53gCsfo3Jqg2QErqUNJmGb2Pg8YLIXCT8wDKDaCyjnyhSwBYvd--sgIzgBXpvtEkpDYNnxdzHll39lNO6_B5-fbZGqjMvhD2YgloHXanuWuKEoKhICuK3LyOWehK_bDzdpas8Sb2x5H9MT55lrhvbPWvjehmZ6uWJmmX1_zam5icf76KUYQ1n8/_GkJ1GzzjftaUiDF1l76EL0FEIsyS0B0nQ_4l9kKMQY",
    "price": 122.12,
    "prevClose": 122.39,
    "absReturn": -0.269999999999996
  },
  {
    "fullTicker": "WRB:USA",
    "baseTicker": "WRB",
    "rank": 62.9768,
    "description": "W. R. Berkley Corporation, an insurance holding company, operates as a commercial line writer worldwide. The company operates in two segments, Insurance, and Reinsurance & Monoline Excess. The Insurance segment underwrites commercial insurance business, including excess and surplus lines, admitted lines, and specialty personal lines. This segment also provides accident and health insurance and reinsurance products; insurance for commercial risks; casualty and specialty environmental products; insurance coverages for fine arts and jewelry exposures; excess liability and inland marine coverage for small to medium-sized insureds; and commercial general liability, umbrella, professional liability, directors and officers, commercial property, and surety products, as well as products for technology, and life sciences and travel industries. In addition, it offers cyber risk solutions; crime and fidelity insurance products; medical professional coverages; workers' compensation insurance products; management liability and general insurance products; personal lines insurance solutions, including home, condo/co-op, auto, fine arts and collectibles, liability, collector vehicle, and recreational marine; law enforcement, public officials and educator's legal, and employment practices liability, as well as incidental medical, property, and crime insurance products; at-risk and alternative risk insurance program management services; professional liability; energy and marine risks; and insurance products to the Lloyd's marketplace. The Reinsurance & Monoline Excess segment provides treaty and facultative reinsurance solutions; property and casualty reinsurance products; facultative reinsurance products include automatic, semi-automatic, and individual risk assumed reinsurance; and turnkey products, such as cyber, employment practices liability insurance, liquor liability insurance and violent events. The company was founded in 1967 and is headquartered in Greenwich, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/CL8AU9JgzeI5uW-jlqUDLw/PiHEv1R7d2ppTLqzUcZ55tJ_kudbCcXBofx9UYdIoOmrNOijJTPiZI7dhdgv2s0KHfiHJdoaJt0IXMx5AodYH3O8JtVfR0KMtROA9RGHvSPdlzFvApqtFDa6P0EyoldLQKXA7pDi_aaCiA_7YnOm7o68-MQAvOoWJTK2uigk2KfJrMV1v6Uiz7xdoBgnsBn5/5bp-za5wW0UXaC2liPvRnvhPoHCoqczb7W8RDQOcqEg",
    "price": 76.495,
    "prevClose": 75.84,
    "absReturn": 0.6550000000000011
  },
  {
    "fullTicker": "KLAC:USA",
    "baseTicker": "KLAC",
    "rank": 67.0346,
    "description": "KLA Corporation, together with its subsidiaries, engages in the design, manufacture, and marketing of process control, process-enabling, and yield management solutions for the semiconductor and related electronics industries worldwide. It operates through three segments: Semiconductor Process Control; Specialty Semiconductor Process; and PCB and Component Inspection. The company offers inspection and review tools to identify, locate, characterize, review, and analyze defects on various surfaces of patterned and unpatterned wafers; metrology systems that are used to measure pattern dimensions, film thickness, film stress, layer-to-layer alignment, pattern placement, surface topography, and electro-optical properties for wafers; chemical process control equipment; wired and wireless sensor wafers and reticles; wafer defect inspection, review, and metrology systems; reticle inspection and metrology systems; and semiconductor software solutions that provide run-time process control, defect excursion identification, process corrections, and defect classification to accelerate yield learning rates and reduce production risk. It also provides etch, plasma dicing, deposition, and other wafer processing technologies and solutions for the semiconductor and microelectronics industry. In addition, the company offers direct imaging, inspection, optical shaping, inkjet and additive printing, UV laser drilling, and computer-aided manufacturing and engineering solutions for the PCB market; inspection and electrical testing systems to identify and classify defects, as well as systems to repair defects for the display market; and inspection and metrology systems for quality control and yield improvement in advanced and traditional semiconductor packaging markets. The company was formerly known as KLA-Tencor Corporation and changed its name to KLA Corporation in July 2019. KLA Corporation was incorporated in 1975 and is headquartered in Milpitas, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/H_xz-P1FuTkzn9UI23uBdQ/iMYHmbt4uW5dgLx3pOlN5cit0F-iogbYIsAZ1Fmg1nfMJBzMEG6qUvHLsvO2aEY7tF9H5Cm_JkKGCB7xL98tT3vS7jQ2QRZMIsg5yUjM8bbYrYB2eEDSE1YjppxwQMlOIlUvqAS-nCT_Sxnf4hypYzS7NvOXx_hw3hL4PME1FKr-oNpEJRN-lDhuxIimevRo/WuuS-KBfyNm2KRmbSw1pytmsSnaDvzHXyyRqu9-X3HQ",
    "price": 1191.66,
    "prevClose": 1217.95,
    "absReturn": -26.289999999999964
  },
  {
    "fullTicker": "AMWL:USA",
    "baseTicker": "AMWL",
    "rank": 80.5876,
    "description": "American Well Corporation, an enterprise platform and software company, delivers digitally enabling hybrid care in the United States and internationally. The company offers Converge, a cloud-based platform that enables health providers, payers, and innovators to provide in-person, virtual and automated care; and delivers virtual primary care, post-discharge follow-up, chronic condition management, virtual nursing, e-sitting, on-demand and scheduled virtual visits, specialty consults, automated care, and behavioral health, as well as offers specialty care programs, including dermatology, musculoskeletal care, second opinion, and cardiometabolic care for patients and members. It also provides Carepoint devices, which transforms proprietary carts, peripherals, tablets, and TVs into digital access points in clinical settings. In addition, the company offers Amwell Medical Group network services consisting of primary and urgent care, behavioral health therapy, lactation counseling, and nutrition services. Further, it provides professional services to facilitate implementation, workflow design, systems integration, and service expansion for its products, as well as patient and provider engagement services. The company sells its products through field sales professionals, channel partners, and value-added resellers. It serves providers, payers, and the government, as well as the higher education sector. American Well Corporation was incorporated in 2006 and is headquartered in Boston, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/HGLNpPSGh7pvFzHtGZ3wbw/RsD9Wt__0eVD0Tk8biQHKxya1A-2GThahsEmDOr6-yHfTerWRBJoAe38UtlB6sQdwZMijxGLx_JS_brepoE4sfM3IZKxdoa9MsUn0gD5ZXyjaq2SDDpz3Vks2VKwoPB2jrJu53k0bmwnWqqXqbWYyiaig2Y8U-1yxEM5xVrZxskXgG6jE7PgwaSjd2fyguFl/4SqP9x7MRnWK6pwEinCUlZqWaZzF55fUaWU1O3wFSS8",
    "price": 3.96,
    "prevClose": 4.04,
    "absReturn": -0.08000000000000007
  },
  {
    "fullTicker": "BDC:USA",
    "baseTicker": "BDC",
    "rank": 94.4003,
    "description": "Belden Inc. provides signal transmission solutions for mission critical applications in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It operates through two segments, Smart Infrastructure Solutions and Automation Solutions. The Smart Infrastructure Solutions segment offers copper cable and connectivity solutions, fiber cable and connectivity solutions, interconnect panels, racks and enclosures, and signal extension and matrix switching systems for use in local area networks, data centers, access control, 5G, fiber to the home, and building automation applications. It also provides power, cooling, and airflow management products for mission-critical data center operations; and end-to-end fiber and copper network systems. This segment serves commercial real estate, education, financial, stadiums and venues, military installations, and broadband and wireless service providers, as well as data centers, government, healthcare, and hospitality sectors. The Automation Solutions segment offers network infrastructure and digitization solutions; and products and solutions covering various aspects of data handling, including acquisition, transmission, orchestration, and management for applications in discrete automation, process automation, energy, and mass transit. It sells its products to distributors, end-users, installers, and original equipment manufacturers (OEMs). The company was formerly known as Belden CDT Inc. and changed its name to Belden Inc. in May 2007. Belden Inc. was founded in 1902 and is headquartered in Saint Louis, Missouri.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1762898400000/GKDzgOjjZrhnYGtt2rxr_g/dDgANzLVbICTVz3PJFHeqlQD_fhv2Tkwyii0imSJlrgAfeNC0dSPNWQOUuWSGgg1k4uiMshvoGPTgEsw39aM7Np8EdcSssFH-OJgLMgDXQt012pgB_yTnI2dhHdKjDjv7e1TjDBl4F0Gxm8JbfyvJQmksG6UA3ETmMCBoXh2UTk/Fs1FEYFlHtO-sQQFbed_v4IXKM9jAY5zzv4ehD4SOEA",
    "price": 115.47,
    "prevClose": 118.9,
    "absReturn": -3.430000000000007
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 683.205,
    "prevClose": 681.44,
    "absReturn": 1.7649999999999864
  }
]