[
  {
    "fullTicker": "SNBR:USA",
    "baseTicker": "SNBR",
    "rank": 30.2106,
    "description": "Sleep Number Corporation, together with its subsidiaries, designs, manufactures, markets, distributes, retails, and services sleep solutions in the United States. It offers smart beds and adjustable bases, pillows, sheets, and other bedding products. The company sells its products direct-to-consumer retail touch points, including stores, online, phone, and chat. The company was formerly known as Select Comfort Corporation and changed its name to Sleep Number Corporation in November 2017. Sleep Number Corporation was incorporated in 1987 and is headquartered in Minneapolis, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/tZ0rDCgmESkrFFLxXWpcOw/kUi4SKQHJJkNLu3yGKnW2MJQxNwb3cx1UesXCIWTKnzKKqAS8RPSka4TgTpZ1WRX2RB58IZOwVi5Tj7DhpX0g-imlb70Dd18zFtCbE3LgQeYFM8FWPrBpFBxrEkIYG0ADgqS5UC8GU51Cg8AExnOzCCWYpFXtr6JH5wytEs9Gzz9jXO6msAirsZD5i1K9e9N/ovM7tV6DF4KWOznJIw7nVZb0Ofl3ir032zmMCvJZYcM",
    "price": 11.13,
    "prevClose": 10.68,
    "absReturn": 0.45000000000000107
  },
  {
    "fullTicker": "KBH:USA",
    "baseTicker": "KBH",
    "rank": 33.1786,
    "description": "KB Home operates as a homebuilding company in the United States. The company operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells a variety of homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also provides financial services, such as mortgage banking services comprising residential consumer mortgage loan originations to homebuyers; property and casualty insurance services, as well as earthquake, flood, and personal property insurance products to homebuyers; and title services. It conducts operations in Arizona, California, Colorado, Florida, Idaho, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is based in Los Angeles, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/KAvy45BH7qVcOzp3drTtRQ/RPObqMwzoscEPSzrity69gv68buPjQQURXjmIkvsC6QzC_L9tBwy7lPiV99vJ7nt2eFTcpIVntUyThvs5HrLDJDyGU0nDAJA_hsWF4TwpRjke3t3G6eti_3UXmYw91meDOB0d3oDf4JMbgHzGm-WjTecIFTVYjBPLVEVSf5bB9k/eyLNft0Io6h6XGnSZpFiJsVHzBFLG6cFTmJLd6W1iS8",
    "price": 62.88,
    "prevClose": 63.03,
    "absReturn": -0.14999999999999858
  },
  {
    "fullTicker": "XRAY:USA",
    "baseTicker": "XRAY",
    "rank": 43.1935,
    "description": "DENTSPLY SIRONA Inc. develops, manufactures, and markets dental equipment supported by cloud-enabled solutions, dental products, and healthcare consumable products in urology and enterology worldwide. It operates in four segments: Connected Technology Solutions, Essential Dental Solutions, Orthodontic and Implant Solutions, and Wellspect Healthcare. The Connected Technology Solutions segment offers imaging equipment, motorized dental handpieces, treatment centers, and other instruments; and intraoral scanners, 3-D printers, and mills, as well as CEREC, a full-chairside economical restoration of esthetic ceramic dentistry offering. Its Essential Dental Solutions segment offers motorized endodontic handpieces, files, sealers, irrigation needles, and other tools for root canal procedures; restorative products; curing light and dental diagnostic systems; ultrasonic scalers and polishers; and dental anesthetics, prophylaxis paste, dental sealants, and impression materials. The Orthodontic and Implant Solutions segment offers SureSmile, a clear aligner solution that includes whitening kits and retainers; VPro, a high frequency vibration technology device; SureSmile Simulator; DS Core platform, which creates 3D visualization of patient outcomes; dental implant products; digital dentures; crown and bridge porcelain products; bone regenerative and restorative solutions; treatment planning software; educational programs; custom abutments; tapered immediate load screws; regenerative bone growth factor; artificial teeth; and precious metal dental alloys. Its Wellspect Healthcare segment offers intermittent urinary catheters under the LoFric brand and irrigation systems under the Navina brand. The company was formerly known as DENTSPLY International Inc. and changed its name to DENTSPLY SIRONA Inc. in February 2016. DENTSPLY SIRONA Inc. was founded in 1877 and is headquartered in Charlotte, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/qCjUiBesBT6MIcpaNaUVJA/rZWhLxYzqzjF9IMUjG029Uy_VSxETKNd-olGJ9aIoD7y1um9Ho_gtxpkeIYHnjJrocG8K8bZThhWcK_HycIuPmBmBbm29IbaKAUI2ORAXjdjBHIBpzmqLdEGYETvkm2XtlpaBRYIEQFMYIZ-i47RIiCDT2b7gdxUNt-fbuicSyyTFd39xicyIjfR4mzKRZ3o/yz29JnhrCiZSRLo4jtu_MAhwD3or-kWRcydZPaeNEEE",
    "price": 13.85,
    "prevClose": 13.87,
    "absReturn": -0.019999999999999574
  },
  {
    "fullTicker": "ITGR:USA",
    "baseTicker": "ITGR",
    "rank": 52.6613,
    "description": "Integer Holdings Corporation operates as a medical device contract development and manufacturing company in the United States, Puerto Rico, Costa Rica, and internationally. The company offers products for interventional cardiology, structural heart, heart failure, peripheral vascular, neurovascular, interventional oncology, electrophysiology, vascular access, infusion therapy, hemodialysis, non-vascular, urology, and gastroenterology procedures. It also provides cardiac rhythm management products, including implantable pacemakers, implantable cardioverter defibrillators, insertable cardiac monitors, implantable cardiac pacing and defibrillation leads, and heart failure therapies; neuromodulation products, such as implantable spinal cord stimulators; and non-rechargeable batteries, feedthroughs, device enclosures, machined components, and lead components and sub-assemblies. In addition, the company offers rechargeable batteries and chargers; orthopedics, minimally invasive surgery, and general surgery devices; and portable medical devices, including patient monitoring, ventilators, portable defibrillators, portable ultrasound, and X-Ray machines. Furthermore, the company provides medical technologies. It serves multi-national original equipment manufacturers and their affiliated subsidiaries in the cardiac rhythm management, neuromodulation, orthopedics, vascular, and advanced surgical and portable medical markets. Integer Holdings Corporation was formerly known as Greatbatch, Inc. and changed its name to Integer Holdings Corporation in July 2016. The company was founded in 1970 and is headquartered in Plano, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/02I_X6ey2pUkxemeOPNd_w/7_y3u-5Q_8xA0k-MNB8AgXdMuohFJ6HG7_BJdbxDd-rzNS0wItIoODH2mZb_2LEb2MmFyBqxdkAhYX3JZsIhqwhS0UZh3iuDIzBylj6Vfwr1ONm3AGQgL8JT6HIiGh8FDQsoqJzZQAaCtWhKMjmKtccDJhZ9mFFJxgSUCmjVwM6W7x00tOQiDPostPUylT5O/e7oPrykwb-8WNwlQFDkZnrc55DODIsppOPxD0USNFRA",
    "price": 106.79,
    "prevClose": 106.77,
    "absReturn": 0.020000000000010232
  },
  {
    "fullTicker": "CHEF:USA",
    "baseTicker": "CHEF",
    "rank": 57.0884,
    "description": "The Chefs' Warehouse, Inc., together with its subsidiaries, distributes specialty food and center-of-the-plate products in the United States, the Middle East, and Canada. It offers includes specialty food products, such as artisan charcuterie, specialty cheeses, unique oils and vinegars, truffles, caviar, chocolate, and pastry products; and center-of-the-plate products consisting of custom cut beef, seafood, and hormone-free poultry, as well as broadline food products comprising cooking oils, butter, eggs, milk, and flour. The company serves menu-driven independent restaurants, fine dining establishments, country clubs, hotels, caterers, culinary schools, bakeries, patisseries, chocolatiers, cruise lines, casinos, and specialty food stores. It markets its center-of-the-plate products directly to consumers through a mail and e-commerce platform. The Chefs' Warehouse, Inc. was founded in 1985 and is headquartered in Ridgefield, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/x6z9bat8qHGU2Se5CUKKJw/W5U5BMDeypaYSyq0h29ftEZPGQxLzzHMt_S6V3I0IkurOulZwRYT7AhlmF0kp7pbwi1wkYC_yj4FVAuE0pJ_Wruxa0FRTXaCRV91rNfA_EOXnsNKZ_O42qskcDrWCqg-CfP438mFpxn_Njg60gkIJl5yu2kRShLADfIB45b7mAK39noJkJJtOZVGeE9ConRO/h0gS_WrtpN3s92rY7EsOUKB1NkAEukQqqa9917vbC-k",
    "price": 61.55,
    "prevClose": 61.29,
    "absReturn": 0.259999999999998
  },
  {
    "fullTicker": "L:USA",
    "baseTicker": "L",
    "rank": 66.639,
    "description": "Loews Corporation, through its subsidiaries, provides commercial property and casualty insurance in the United States and internationally. The company offers specialty insurance products, such as management and professional liability, and other coverage products; surety and fidelity bonds; professional liability coverages and risk management services to various professional firms, including architects, real estate agents, and accounting and law firms; standard and excess property, marine and boiler and machinery coverages, workers' compensation, general and product liability, commercial auto, umbrella, and excess and surplus coverages, and specialized loss-sensitive insurance programs and total risk management services relating to claim and information services; directors and officers, errors and omissions, employment practices, fiduciary, fidelity, and cyber coverages, as well as for small and mid-size firms, public and privately held firms, and not-for-profit organizations; and insurance products to serve the health care industry, including professional and general liability, as well as associated casualty coverage to aging services, allied medical facilities, dentists, physicians, nurses, and other medical practitioners. It also provides warranty and alternative risk and run-off long-term care insurance products. The company markets its insurance products and services through independent agents, brokers, and managing general underwriters. In addition, it engages in the transportation and storage of natural gas and natural gas liquids; and provision of ethane supply and transportation services for industrial customers in Louisiana and Texas, as well as operates a chain of 25 hotels. Further, the company develops, manufactures, and markets a range of extrusion blow-molded and injection molded plastic containers, as well as manufactures commodity and differentiated plastic resins. Loews Corporation was incorporated in 1969 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/uzq7OV9WAbmzcw6HjsqP8A/oEGWfCT_kbGjPF9A3iQBvXYfmoCehF3fSEp8qgL2iv1kO67K2TUvK55atlPisl-5Bi3SpFltdn8ORF0oXi-jpAYvTD0UrUBYc2BaPI95vQSvsRaeqweZll_70P2_E3l7cfnCfiKZQOA8eDbeSYxMDyHjIUg28i6UPCpffjcbAPY/XAMpk9sv2GY2RaWzAH8DTG4GwmeHBTmsWdEVKYSz1Oo",
    "price": 95,
    "prevClose": 95.58,
    "absReturn": -0.5799999999999983
  },
  {
    "fullTicker": "TISI:USA",
    "baseTicker": "TISI",
    "rank": 71.1988,
    "description": "Team, Inc., together with its subsidiaries, provides a suite of conventional, specialized, and proprietary mechanical, heat-treating, and inspection services in the United States, Canada, Europe, and internationally. It operates through Inspection and Heat Treating (IHT) and Mechanical Services (MS) segments. The IHT segment offers non-destructive evaluation and testing, radiographic testing, ultrasonic testing, magnetic particle inspection, liquid penetrant inspection, positive material identification, electromagnetic testing, alternating current field measurement, and eddy current testing services. This segment also provides long-range guided ultrasonic, phased array ultrasonic testing, terminals and storage inspection and management program, rope access, mechanical and pipeline integrity, and heat treating services. The MS segment offers engineered composite repair, emissions control/compliance, hot tapping, valve insertion, field machining, bolted joint integrity, vapor barrier plug and weld testing, and valve management services, as well as leak repair services. Team, Inc. was founded in 1973 and is headquartered in Sugar Land, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/7Rv-aVh6bwwRtMfNZ5oJYw/VVHISMpfsSqHdFTrXhYva_3ombugF6Yrp3ksV-m7gGXIW-XfIdgTPeB6KqY3ABEHkKGlfz8Y88rn5gHhEvSl4v8YI4FTjpDpAljqaJDEDVpXiWgheLHJb2TZw7w_m8dfZe4jFCy9o0kOMSh3VzktE18_pWHNmpa9LPeXZ-NtJxo/_oayfXScDYiai0Bh-aY9XJd1Ckerz6uqdca4mg0_4os",
    "price": 19.25,
    "prevClose": 18.03,
    "absReturn": 1.2199999999999989
  },
  {
    "fullTicker": "EBS:USA",
    "baseTicker": "EBS",
    "rank": 77.0022,
    "description": "Emergent BioSolutions Inc., a life sciences company, provides preparedness and response solutions for accidental, deliberate, and naturally occurring public health threats in the United States. The company offers NARCAN Nasal Spray for the emergency treatment of known or suspected opioid overdose; Vaxchora vaccine for the prevention of cholera; Vivotif vaccine for oral administration for the prevention of typhoid fever; Anthrasil for the treatment of inhalational anthrax; BioThrax, an anthrax vaccine; CYFENDUS for post-exposure prophylaxis of disease following suspected or confirmed exposure to Bacillus anthracis; and Raxibacumab injection for the treatment and prophylaxis of inhalational anthrax. It provides ACAM2000, a smallpox vaccine; CNJ-016 to address complications from smallpox vaccination; TEMBEXA for the treatment of smallpox disease caused by variola virus in adult and pediatric patients; Botulism Antitoxin Heptavalent for the treatment of symptomatic botulism; Ebanga for the treatment of Ebola; Trobigard, an atropine sulfate obidoxime chloride auto-injector. In addition, the company is developing EBS-LASV to prevent Lassa fever; EBS-MARV to prevent Marburg virus disease; EBS-SUDV to prevent Sudan virus disease; Pan-Ebola mAbs for the treatment of ebola virus; and WEVEE-VLP for equine encephalitis virus infections. Further, it provides contract development and manufacturing services comprising drug substance and product manufacturing, and packaging, as well as technology transfer, process, and analytical development services. The company was incorporated in 1998 and is headquartered in Gaithersburg, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/Pn2Gm4Ykx7PeRJVU9mRV-Q/BLSDWE4C7IKnn7gD8D03d9ByVZORHAaSBSKf3tkSBEE8x_4kuJICDKposat2nhVIEF__pFIVqxGlEVHocS2VsqcGHAWjXdXpb_xs7rZaCWnAHMp5lXy1il6ek3M4z1Mm0ooYa2bNIhjYAr9rIChMmK6e2JrwLgvCJs9G4vOGyRx6RpcUzwEZCMXT9HjhbRAD/3MD0zIPTN_fpmTnJfZw06GTAWvpUgx1LQLXQipGx-nU",
    "price": 8.84,
    "prevClose": 8.82,
    "absReturn": 0.019999999999999574
  },
  {
    "fullTicker": "PBH:USA",
    "baseTicker": "PBH",
    "rank": 86.4202,
    "description": "Prestige Consumer Healthcare Inc., together with its subsidiaries, develops, manufactures, markets, distributes, and sells over the counter (OTC) health and personal care products in North America, Australia, and internationally. The company operates in two segments, North American OTC Healthcare and International OTC Healthcare. It offers analgesic powders under the BC and Goody's brand; diaper rash treatments and skin protectants for babies under the Boudreaux's Butt Paste brand name; sprays and lozenges to relieve sore throats and mouth pain under the Chloraseptic brand; eye care products that provide relief from redness and itchiness under the Clear Eyes brand name; at-home removal of common and plantar warts under the Compound W brand; and Debrox for ear wax removal. The company also provides dental guards, floss picks, interdental brushes, dental repair and kits, and tongue cleaners under the DenTek brand; Dramamine for motion sickness relief; enemas and other laxative products under the Fleet brand name; Gaviscon for upset stomach; cough drops under the Luden's brand; Monistat for yeast infections in women; Nix for lice and parasite treatments; feminine care products, including washes, cloths, and sprays under the Summer's Eve brand; TheraTears for dry eyes; nasal saline sprays and washes under the Fess brand name; and Hydralyte for oral rehydration. It sells its products through mass merchandisers; and drug, food, dollar, convenience, and club stores, as well as e-commerce channels. The company was formerly known as Prestige Brands Holdings, Inc. and changed its name to Prestige Consumer Healthcare Inc. in August 2018. Prestige Consumer Healthcare Inc. was founded in 1996 and is headquartered in Tarrytown, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/bIpIbQTIAO6c_O8e2XUN0g/3e1Md4bpqt6DKUZ7uLGhNXEw-wOBOsP3z6rp8AyO_Wr3OwfwhWGHDh1FMaYhuKDRG6U9uEnkf4OTzidHPUnO0G0cLVH4bT61jk4-EJw9oh9UBi17be-VLjbRfJA62akU-CJDGdhuRK2E38VzI5dPQ1gv8LkjVnxleU3pHYX0yAvOUrSCXup1Wa0W9l35UdbkH9QAMvhfzxfdOLkokoThNg/D0epQGmeA3r-k-bQo7E08aJObVxVSfjcgdhpSUYIH0o",
    "price": 64.99,
    "prevClose": 64.6,
    "absReturn": 0.39000000000000057
  },
  {
    "fullTicker": "ENVA:USA",
    "baseTicker": "ENVA",
    "rank": 96.4185,
    "description": "Enova International, Inc., a technology and analytics company, provides online financial services in the United States, Brazil, and internationally. The company provides installment loans; line of credit accounts; CSO programs, including arranging loans with independent third-party lenders and assisting in the preparation of loan applications and loan documents; and bank programs, such as marketing services and loan servicing for near-prime unsecured consumer installment loan. It offers money transfer services. It markets its financing products under the CashNetUSA, NetCredit, OnDeck, Headway Capital, Simplic, and Pangea names. The company was founded in 2003 and is headquartered in Chicago, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755525600000/WPETNZBK5GlZo8nYylkhNg/kF5rRK0TmHekqWhErLzGhTz1fgqAKN1BcgzmNFD-9qtHtCgyj6hF6l01TLFD6lGE-EmVXzOqIZLBR8YX7epRCe-FuZWJ7zrsTgykoXD8z-BYYI9gLoT-oPTaLDXl5RNJtyeGa79a9P40Wyrfj3gK4op8cggnKS1quWfIRR0EQ6ZnvfaMu9A-TEDopyNrh5jv/7KEoT88-p74LKaEFMZX_oU6SE97d0SaNjUB7w8ntUts",
    "price": 106.98,
    "prevClose": 110.09,
    "absReturn": -3.1099999999999994
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 643.44,
    "prevClose": 644.95,
    "absReturn": -1.509999999999991
  }
]