[
  {
    "fullTicker": "CRBP:USA",
    "baseTicker": "CRBP",
    "rank": 4.9331,
    "description": "Corbus Pharmaceuticals Holdings, Inc., a biopharmaceutical company, develops products to defeat serious illness. It develops CRB-701, an antibody drug conjugate (ADC) that targets the expression of Nectin-4 on cancer cells to release a cytotoxic payload of monomethyl auristatin E (MMAE), which is in Phase I clinical trial; CRB-601, an anti-integrin monoclonal antibody that blocks the activation of TGFß expressed on cancer cells for the treatment of solid tumors; CRB-913, a highly peripherally restricted cannabinoid type-1 (CB1) receptor inverse agonist for the treatment of obesity. It has a licensing agreement with Jenrin Discovery, LLC to develop and commercialize the licensed products, including the Jenrin library of approximately 600 compounds, and multiple issued and pending patent filings. The company was incorporated in 2009 and is based in Norwood, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/EoA6AjM1bgICVwstO_GXFA/16whp32xclDckIZo8QFQkelPPee66-ll2v1Z3_-5W9YHOy2eishAk1IdIxtuxkTLSwVcrxR1H6CsV7AIXqTONLE5F-5V0NjMNa7dSey9Po2IKFXQFgljLeMDzndu3gFT8SudqTJlxms88BxVOa2jF_ncpNchW0GFUQuhnFn2JrKWmhQIttgRYXqp-iLRb4AS7yLTBg3ESFgjmTWPUG7lEA/TsOtxww1b1kLcng7nJdvb46XYevslyx_khrgclDS0Dw",
    "price": 7.475,
    "prevClose": 7.4,
    "absReturn": 0.07499999999999929
  },
  {
    "fullTicker": "SAIA:USA",
    "baseTicker": "SAIA",
    "rank": 11.7636,
    "description": "Saia, Inc., together with its subsidiaries, operates as a transportation company in North America. The company provides less-than-truckload services for shipments between 100 and 10,000 pounds. It also offers other value-added services, including non-asset truckload, expedited, and logistics services. As of December 31, 2024, it operated 214 owned and leased terminals; and owned approximately 6,600 tractors and 26,200 trailers. The company was formerly known as SCS Transportation, Inc. and changed its name to Saia, Inc. in July 2006. Saia, Inc. was founded in 1924 and is headquartered in Johns Creek, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/j4hxzkQbYUAMGyLoSW6kqw/lN7bdGGWCkN_rRF1HDEIoQB3LSkeQFLwpzseM_hSrmLqlK7izM1EAmTRiNx-Wh6WFQYvry2eByDQpnjssoiQmpJxJ8emKz1HYsl__lbr_3zW9d3Hvm5ntaR3vg04HyP8BuUFGPnqJBeFj1vBC5LN6ElqvgyeAPiaRurOP-t9SDs/_Bdlmwn7mLCL72jI-K2ClqnlCFTOPTAP3XCxgbGyXiA",
    "price": 276.89,
    "prevClose": 264.32,
    "absReturn": 12.569999999999993
  },
  {
    "fullTicker": "YMAB:USA",
    "baseTicker": "YMAB",
    "rank": 18.3592,
    "description": "Y-mAbs Therapeutics, Inc., a commercial-stage biopharmaceutical company, focuses on the development and commercialization of radioimmunotherapy and antibody based therapeutic products for the treatment of cancer in the United States and internationally. It offers DANYELZA, a monoclonal antibody in combination with granulocyte-macrophage colony-stimulating factor for the treatment of pediatric patients with relapsed or refractory high-risk neuroblastoma in the bone or bone marrow. The company is also developing DANYELZA for the treatment of patients with second-line relapsed osteosarcoma and is in Phase II clinical study; GD2-SADA, which is in Phase I clinical trial for the treatment of GD2 positive solid tumor; and Omburtamab, an antibody for the treatment of central nervous system/leptomeningeal metastases from neuroblastoma. In addition, it engages in the developing of CD38-SADA and GD2-GD3 Vaccine. The company has a license agreement with Memorial Sloan Kettering Cancer Center, and MSK and Massachusetts Institute of Technology to develop and commercialize licensed products. Y-mAbs Therapeutics, Inc. was incorporated in 2015 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/TJOtLOJEIuM3EC2Ljzpzlg/D9_fKNK27UUkIQf2XRkebBGgs2zYxZUGMabH_D65awE67VBepDkR3ZHxN-xg8WPDh9NNU4NN6udh2pgp2PCP84E08vySEXs_kiA64a9Z4r3P9jKW2GxUvIRi9yyxebaH-ibWUamETinStvXVE6T0uFWuTn0hEK9yaiQKaIK3zv1Zf660jlZEL7B5L-WgTt2w/HwXOpeKizl5UTIRInt9cB6X5ubvEvu5wx2OKR8Q1x2Q",
    "price": 4.395,
    "prevClose": 4.32,
    "absReturn": 0.07499999999999929
  },
  {
    "fullTicker": "WALD:USA",
    "baseTicker": "WALD",
    "rank": 24.485,
    "description": "Waldencast plc operates in the beauty and wellness industry in the United States, Canada, Europe, the Middle East, India, Australia, and New Zealand. The company operates through two segments, Obagi Medical and Milk Makeup. It offers skin care products to minimize signs of skin aging, address dark spots, hyperpigmentation, fine lines and wrinkles, and protect and enhance skin tone and texture; cosmetics; and other beauty products. In addition, the company provides foundation, concealer, primer, blush, setting spray, and bronzer categories, as well as sells liner, eyeshadow, and lip color products. It serves distributors, retailers, physicians, and directly to consumers through its e-commerce platforms, and third-party logistics and delivery providers. The company was incorporated in 2020 and is headquartered in White Plains, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/8FAi2er-qJ-hXrsmz7FToQ/6VILtT81qqSPCfeXyJIItlgTneCORNvF-yeqvY-d1z_hYuYWNjWJXU4SkGVGUU_fNGFi4pvhTIob7ld1Y7x0a3a_Y-jcwsnj9J5Cn2xd7bx02SERcqJoYeuVisYdw_L6UA815OeJiX9AeddzFUN1suXQA6Q70epuc8jaQ72li6s/ZXZAGwNyGy2pmT9t6XoyHQkhzTp2cMZhTDE1KjYYr4w",
    "price": 2.43,
    "prevClose": 2.37,
    "absReturn": 0.06000000000000005
  },
  {
    "fullTicker": "CIVI:USA",
    "baseTicker": "CIVI",
    "rank": 37.6581,
    "description": "Civitas Resources, Inc., an exploration and production company, focuses on the acquisition, development, and production of crude oil and associated liquids-rich natural gas. Its assets include DJ Basin assets comprising of approximately 356,800 net acres located in Weld, Arapahoe, Adams, and Boulder counties, Colorado; and Permian Basin assets comprising of 120,400 net acres located in Upton, Reagan, Glasscock, Martin, Midland, Reeves, and Loving counties, Texas, and Eddy and Lea counties, New Mexico. The company was formerly known as Bonanza Creek Energy, Inc. Civitas Resources, Inc. was incorporated in 2010 and is based in Denver, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/zY67gRavImIx0QIMMUZxLQ/NL3uFDiUdGmIfDi7CYKXvZpWVdwxd9yz5s7gsApo29tGHcZh7ZJKw4Uw4USkr2VlK2fGnkACXS99RqExDaiKPCdFwCjhNNBateHf1lu7LeAIyIaKGRE_NXIF8M_zVCRg8r6B939DHhruyCDAvB10b4sMHxK9B_UVK1_aL7FQWaEVOnUCpehwYgHWeeHFz60_/gk_tEm-nZdJEudy7dx8RpcMBeSQqA9DYG9IHSb15rxU",
    "price": 28.17,
    "prevClose": 27.65,
    "absReturn": 0.5200000000000031
  },
  {
    "fullTicker": "INOD:USA",
    "baseTicker": "INOD",
    "rank": 45.5548,
    "description": "Innodata Inc. operates as a data engineering company in the United States, the United Kingdom, the Netherlands, Canada, and internationally. The company operates through three segments: Digital Data Solutions (DDS), Synodex, and Agility. The DDS segment engages in the provision of artificial intelligence (AI) data preparation services; collecting or creating training data; annotating training data; and training AI algorithms for its customers, as well as AI model deployment and integration services. This segment also provides a range of data engineering support services, including data transformation, data curation, data hygiene, data consolidation, data extraction, data compliance, and master data management. The Synodex segment offers an industry platform that transforms medical records into useable digital data with its proprietary data models or client data models. The Agility segment provides an industry platform that offers marketing communications and public relations professionals to target and distribute content to journalists and social media influencers; and to monitor and analyze global news channels, such as print, web, radio, and TV, as well as social media channels. It serves banking, insurance, financial services, technology, digital retailing, and information/media sectors through its professional staff, senior management, and direct sales personnel. The company was formerly known as Innodata Isogen, Inc. and changed its name to Innodata Inc. in June 2012. Innodata Inc. was incorporated in 1988 and is headquartered in Ridgefield Park, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/zgERvAIChmQtshGTZiGUXg/9HqjYbUWzf7yhA-QbVabB208a4Qg2FDrxmZDokvD3aB20nPjZcHiQJTPRCbO0lPORwY5gIN72R9_TuFqjRQn2c_LNjgD4bKXqajXP-tbCHO_CBt3UVNybHGMVGPIvcgqQ1mrW1thRjxSQPCiwP2e3RcI2clmrD2WGZZF8A1JQn0/GF-1zPXOmBQ_C5luT6QnDRmi_rjMUF9Ygx6lKIXn5O0",
    "price": 39.25,
    "prevClose": 36.48,
    "absReturn": 2.770000000000003
  },
  {
    "fullTicker": "GEN:USA",
    "baseTicker": "GEN",
    "rank": 57.9147,
    "description": "Gen Digital Inc. engages in the provision of cyber safety solutions for consumers in the United States, Canada, Latin America, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company offers security and performance products under Norton, Avast, Avira, AVG, and CCleaner brands that provide real-time protection and maintenance for PCs, Macs, and mobile devices against malware, viruses, adware, and other online threats. It also provides identity protection solutions, including LifeLock Identity Theft Protection, Avast and AVG Secure Identity, Norton Identity Theft Protection, and Dark Web Monitoring for monitoring of credit reports, financial accounts, the dark web, and social media accounts to help safeguard customers' personal information. In addition, the company offers Virtual Private Network (VPN) solutions under Norton, Avast and AVG brands to enhance security and online privacy that allows customers to securely transmit and access private information, such as passwords, bank details, and credit card numbers, when using public Wi-Fi on PCs, Macs, and mobile iOS and Android devices; AntiTrack and Secure Browser products which helps to keep personal information and browsing activity anonymous while browsing online; and Privacy Monitor Assistant and BreachGuard products for removing customers' data from public data broker sites; and ReputationDefender, a white glove service that helps customers manage all aspects of their personal branding online, including search results, social media sites, and overall web presence. It markets and sells its products and related services through retailers, telecom service providers, hardware original equipment manufacturers, and employee benefit providers, as well as e-commerce platform. The company was formerly known as NortonLifeLock Inc. and changed its name to Gen Digital Inc. in November 2022. Gen Digital Inc. was founded in 1982 and is headquartered in Tempe, Arizona.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/TSM64SrlR4wF4H_irSNvrw/y1Q2Pt3j9wdd-5j8sbzWAQRV4-1kVGa_MgdH6daJZETItmNWAZXwxgw-PBon1Ple_cLwDAdNOqZBTlsTqN5cGwP79NdjKPIJTuFJmuE-ZW0WdjbuHF_c7QE3eNDGj8ig9lW6f0oSPpenZ2cC5-AU-hEHgTc_KfTiDWTx2uwIME5g4TnIR-gOZM7DRuAaOdnR/YSbZ_WP2qFZkY0i5uouuhBq7V5mzVlkgVT8Vsx-Aysw",
    "price": 28.26,
    "prevClose": 27.59,
    "absReturn": 0.6700000000000017
  },
  {
    "fullTicker": "V:USA",
    "baseTicker": "V",
    "rank": 65.8836,
    "description": "Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/0WkIuSZNiOzLyMZR6z478Q/YS_k0PA68wX-c1Nwoz-xdVMVtWxhQhOvj5Qk8G9nNd8FVRN3ClVXs6uqwck7yZ_Lg-PXrM11R_q9yDMpxxsAtgqYDhtyh4S8-CayGjFeLLkAvlSRKKBrKn-6P5Y6zt4ymCzYWdlH4gUIsCDPs1quNIbEQ8RBGqOmLUTZ7u3c-aU/L5OHwXwRkuEFXoQTskK9OoO4m3TW4txteSGQR3_n5UQ",
    "price": 357.145,
    "prevClose": 353.54,
    "absReturn": 3.6049999999999613
  },
  {
    "fullTicker": "BAH:USA",
    "baseTicker": "BAH",
    "rank": 76.3282,
    "description": "Booz Allen Hamilton Holding Corporation provides management and technology consulting, analytics, engineering, digital solutions, mission operations, and cyber services to governments, corporations, and not-for-profit organizations in the United States and internationally. It focuses on artificial intelligence services comprising of machine learning, predictive modeling, automation and decision analytics, and quantum computing. The company offers artificial intelligence, machine learning, and computer network related operations. In addition, it provides data science, engineering, visualization, and analysis related capabilities. Further, the company engages in user experience, user interface, graphic and web design, design thinking, sketching, and digital product design capabilities. Additionally, it architects and engineers help accelerate, scale, secure, and transform mission and business outcomes using the technologies and partner offering; offers software engineering in agile practices, DevSecOps, automation and Cloud, and Low/No Code Platform engineering; systems and digital engineering; and tech strategy and product management. Booz Allen Hamilton Holding Corporation was founded in 1914 and is headquartered in McLean, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/GnBeAoC6oOaV7gE-PUpfQg/vTQ6bis2RLDK3jqKJW5U9u22ryRsWwR0I4lCWAqpYb-_TURSfON7wvCFHb__KpwkH0O-XB1Dst7BzCNC976j1Apj9fj-7DJ0bP_tkCvtHPu95OGFq_SzgMBrMLGAE1U3qJLapbT0aOgvYJYShc_QnyFC6I4cNvk1YwIej79M12m1I53EXj1SbDTsaxfLY02Vph195iWUZ4Qt7vbiKQrLsw/rDZbH-0zsis1dSk2MED2oz1U3DPrR5_5OR_mKhzLdBE",
    "price": 108.57,
    "prevClose": 107.79,
    "absReturn": 0.7799999999999869
  },
  {
    "fullTicker": "PSMT:USA",
    "baseTicker": "PSMT",
    "rank": 85.562,
    "description": "PriceSmart, Inc. owns and operates U.S.-style membership shopping warehouse clubs in the United States, Central America, the Caribbean, and Colombia. The company provides basic and private label consumable and non-consumable products under the Member's Selection brand, including groceries, cleaning supplies, health and beauty aids, meat, produce, deli, seafood, and poultry. It also offers electronics, large and small appliances, automotive, hardware, sporting goods, seasonal products, clothing, domestics, and home furnishing products. In addition, the company offers food and bakery services, as well as health services, such as optical, audiology, and pharmacy. Further, it operates an e-commerce platform, as well as offers curbside pickup and delivery services. PriceSmart, Inc. was incorporated in 1994 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748368800000/Sb-WPKTjJeLk1ZD_VkkiyQ/BYZM3169wZflA3nv4EggqKoaUrOb0_rUsX0J-bulk6gYsvsY4iZSeJBUqj6VXS5S_EnrxFVM1tBqeP7pbXRyiPQvr2bVxvzw7ZeZuCzUZ-TxcY0re3kXSZBWGrrxRm8ej68Za2pM0bacZLHY68UbY-MhHlvj0xuiUFO5bKDPZIOOQqUKG8RSeSwkjwejprjW/SEXfiO4ayhB77kZvrfWiGkO-RLqPIR68-Qwy99Tjo6Q",
    "price": 105.92,
    "prevClose": 104.36,
    "absReturn": 1.5600000000000023
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 588.785,
    "prevClose": 579.11,
    "absReturn": 9.674999999999955
  }
]