[
  {
    "fullTicker": "SKYE:USA",
    "baseTicker": "SKYE",
    "rank": 5.585,
    "description": "Skye Bioscience, Inc., a biopharmaceutical company, focuses on unlocking new therapeutic pathways for metabolic health through the development of molecules that modulate G-protein coupled receptors. The company is conducting a Phase 2 clinical trial in obesity for nimacimab, a negative allosteric modulating antibody that peripherally inhibits CB1. This study is also assessing the combination of nimacimab and a GLP-1R agonist (Wegovy). The company was formerly known as Emerald Bioscience, Inc. and changed its name to Skye Bioscience, Inc. in January 2021. The company is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/KMT6yuC-XFnXsDLWO1cziw/yAMpXKRD6zkmnr3pKpZjEZmqtp5Utc5hHeDKsocXKL2-VmHX_Ik9m8dPPxL-u7sVjXskdF2c6BMKDS15nwboljMvjddLJyiJx0v9Gn--g92dR0ejo9mHNqkC1aSIOqOA__MA2OxUSdnphc0ryFP7dwjSrKybacIahdaGfhNheTqeZRi8PGiZ6rncf-RsjI6K/063zB2bYAzXanBmfAwZy8057w7FbPiRIPkUfjkR9qgY",
    "price": 4.075,
    "prevClose": 4.36,
    "absReturn": -0.28500000000000014
  },
  {
    "fullTicker": "AXTI:USA",
    "baseTicker": "AXTI",
    "rank": 12.4959,
    "description": "AXT, Inc. designs, develops, manufactures, and distributes compound and single element semiconductor substrates. The company offers indium phosphide for use in data center connectivity using light/lasers, high-speed data transfer in data centers, 5G communications, fiber optic lasers and detectors, consumer devices, passive optical networks, silicon photonics, photonic integrated circuits, thermo-photovoltaics, RF amplifier and switching, infrared light-emitting diode (LEDS) motion control, lidar for robotics and autonomous vehicles, and infrared thermal imaging. It also provides semi-insulating gallium arsenide (GaAs) substrates for use in Wi-Fi and IoT devices, transistors, direct broadcast television, power amplifiers, satellite communications, and solar cells; and semi-conducting GaAs substrates that are used in LEDs, screen displays using micro-LEDs, printer head lasers and LEDs, 3-D sensing using VCSELs, data center communication using VCSELs, sensors for industrial robotics/near-infrared sensors, optical couplers, solar cells, night vision goggles, lidar for robotics and autonomous vehicles, and other lasers, as well as laser machining, cutting, and drilling. In addition, the company offers germanium substrates for use in multi-junction solar cells for satellites, optical sensors and detectors, terrestrial concentrated photo voltaic cells, infrared detectors, and carrier wafer for LED. Further, it provides 6N+ and 7N+ purified gallium, boron trioxide, gallium-magnesium alloy, pyrolytic boron nitride (pBN) crucibles, and pBN insulating parts. It sells its products through direct salesforce in the United States, China, and Europe, as well as through independent sales representatives and distributors in Japan, Taiwan, Korea, and internationally. The company was formerly known as American Xtal Technology, Inc. and changed its name to AXT, Inc. in July 2000. AXT, Inc. was incorporated in 1986 and is headquartered in Fremont, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/iAqYPX4aTNR2L4rnIasdKQ/Q-blhzsPpkdlv7hY7LETCY8mfD9wGfRKWV3jvt-WGatCYXix40qlzO5NEqcbLBv9HlUSHbwRIzIITQLlLLm8L-j03m1psRF83JmTLhjfm0M5P7ya00TM5pdIHHxLZWnFFna8SScHkwWnQgZnL8VzJEEybDN0iEJfEwDJEnM82pE/oavfPiy3HucjYsJ6Hz6xSuzqaaJa8UeGO8zV5UkIGDc",
    "price": 2.47,
    "prevClose": 2.52,
    "absReturn": -0.04999999999999982
  },
  {
    "fullTicker": "SLB:USA",
    "baseTicker": "SLB",
    "rank": 21.2131,
    "description": "Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; stimulation services to restore or enhance well productivity through hydraulic fracturing, matrix stimulation, and water treatment; and intervention services to oil and gas operators. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift; supplies packers, safety valves, sand control technology, and various intelligent systems; midstream production systems; valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/f0rFrCGHIbI5OpHSrU45xQ/2ctZso9_TlOn9kfKx5Wt9APmQpxOiWR3L1HCmq8GecI9nQPzQHFVDbZjKMahLoMAMwo5JxIyHqBwZmrs0AwBRKtkg520ICQ4vfDSMT1Fio_5LD_AYq4Gka-dPcEqWij3pJtc0xqv17zFXc2jNsMFEAHanTXZbMfmJGREqh6erJQ/3_z3v_YIBlXj65AQYWPIqyiXBoPBItGJ_g0BKmXQZH0",
    "price": 35.305,
    "prevClose": 35.14,
    "absReturn": 0.16499999999999915
  },
  {
    "fullTicker": "ATOS:USA",
    "baseTicker": "ATOS",
    "rank": 22.3566,
    "description": "Atossa Therapeutics, Inc. operates as a clinical-stage biopharmaceutical company that develops medicines in the areas of unmet medical need in oncology for women breast cancer and other conditions in the United States. The company's lead drug candidate is oral (Z)-endoxifen, an active metabolite of tamoxifen, which is in Phase II clinical trials to treat and prevent breast cancer. It also develops immunotherapy/chimeric antigen receptor therapy programs. The company was formerly known as Atossa Genetics Inc. and changed its name to Atossa Therapeutics, Inc. in January 2020. Atossa Therapeutics, Inc. was founded in 2008 and is based in Seattle, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/paOyggn9FwHrkqPWJIKAsQ/KVpp0QNYJi5ggOXMo00qqmjitVbyzMlB5IlzywOCj8PARcEF9Hv6sLJZeaRhg7SeKjDXWC5IRJerTpuV05yst18swoRidtNLKnZTJvG3gQgCgf7c4CtteMKPAkvzkAslX6ouAwUiXj0LRekvf0vEWWUfr_Z4-upWo2zD0KOWPcc3MHF_vtSHZUBj83ph-45p/2kFrrIgB4eIOKWFo2IxWA4kkposv5-r_uN1QUdfNLbI",
    "price": 0.8753,
    "prevClose": 0.8864,
    "absReturn": -0.011099999999999999
  },
  {
    "fullTicker": "BWEN:USA",
    "baseTicker": "BWEN",
    "rank": 31.0739,
    "description": "Broadwind, Inc. engages in the manufacturing and sales of structures, equipment, and components for clean technology and other specialized applications in the United States. The company operates through three segments: Heavy Fabrications, Gearing, and Industrial Solutions. The Heavy Fabrications segment provides fabrications to various industrial markets. It offers steel towers and adapters primarily to wind turbine manufacturers. Its Gearing segment provides gearing, gearboxes, and precision machined components to a range of customers in diverse markets, including surface and underground mining, wind energy, steel, material handling, infrastructure, onshore and offshore oil and gas fracking and drilling, marine, defense, and other industrial markets. This segment also offers heat treat services for aftermarket and original equipment manufacturer applications. The Industrial Solutions segment provides supply chain solutions for offering instrumentation and controls, valve assemblies, sensor devices, fuel system components, electrical junction boxes and wiring, energy storage services, and electromechanical devices; light fabrication, inventory management, and kitting and assembly services; packaging solutions; and supply chain solutions, light fabrication, inventory management, and kitting and assembly services for combined cycle natural gas turbine market. It sells its products to the energy, mining, and infrastructure sectors through its direct sales force and independent sales agents. The company was formerly known as Broadwind Energy, Inc. and changed its name to Broadwind, Inc. in May 2020. Broadwind, Inc. is headquartered in Cicero, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/zL4TkaXRtxB7VfhTKMQOJA/q2gl9WwHmwyjK-0gtnQ6f4xF2O6Gw81FPnzWMj2JCaBqJx-kJyJ396LQcVZnun-Mybo-Sq53c6FsPZgyUJ1_IkbSPHHisFLYHWF6ukGFh851iZG4lDcZ40xuUk1cKi813yXQtPW2XaNTFTmGnuuzBHBcpoU7qxQpEP_5iAFY-TQ/SLnOPaEPn6yYm---8YR9E9OPQxONtsC53KH6uiUdywE",
    "price": 2.49,
    "prevClose": 2.47,
    "absReturn": 0.020000000000000018
  },
  {
    "fullTicker": "SKBL:USA",
    "baseTicker": "SKBL",
    "rank": 46.7849,
    "description": "Skyline Builders Group Holding Limited, through its subsidiaries, provides civil engineering services to the public and private sectors in Hong Kong. It engages in the public civil engineering works, such as road and drainage work. The company was incorporated in 2024 and is based in Kowloon Bay, Hong Kong. Skyline Builders Group Holding Limited is a subsidiary of Supreme Development (BVI) Holdings Limited.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/yT5P5CUUbpR8awJmIY14Vg/FoqRLm8CnDbTXLzXJ3sRBAhP3cDmcrtqHhAw0pEwxBzxEJra7CzBTS_zq6kpfeP0xyUqxahzt3kFvXvpVFTDNfY27lkQw0WR8dT9TrIaMSL-WYspcQtTn6xExMw5DWOW3A3rIQfKQsDCBQHz4Aq7MoDOMm7AidX0OjebaxjGA_9HFJKLVQ98t1IJxR8WQC5oBXADPy7zckJN6O1SvxA-sQ/SBD-J-oSZo7hDBehe5gIN0j0I64TQ4GmtZHmrLtgo8k",
    "price": 0.791,
    "prevClose": 0.85,
    "absReturn": -0.05899999999999994
  },
  {
    "fullTicker": "PZZA:USA",
    "baseTicker": "PZZA",
    "rank": 59.347,
    "description": "Papa John's International, Inc. operates and franchises pizza delivery and carryout restaurants under the Papa Johns trademark in the United States, Canada, and internationally. It operates through four segments: Domestic Company-Owned Restaurants, North America Franchising, North America Commissaries, and International. The company also operates dine-in and delivery restaurants under the Papa Johns trademark internationally. It offers pizza and other food and beverage products. In addition, the company supplies pizza sauce, dough, food products, paper products, smallware, and cleaning supplies to restaurants. Papa John's International, Inc. was founded in 1984 and is based in Louisville, Kentucky.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/GWAu3kTebzT-F80Z-HxVrw/xb5LGuJLwBR_5RiN2OkhNzuuVXW8aoVPlkaf2_CDQbYzk0mIrWGthZbKEv8MhUJ9O2mBRAGJeqZH_42mJoLava0xnB9eFVaSZ3cvlK1gwGX313baQcEZyHY9Sh_s58mIglw2eB7MxlbteNZTavafqHahAOGhGecXg4-aRGfsQ0KpGLcwzGymLASdryxrcqW9/G3vZcE7x9Gc0zfpdfIZ5_DKF28hO0byOWSD4veHO7U8",
    "price": 44.185,
    "prevClose": 45.53,
    "absReturn": -1.3449999999999989
  },
  {
    "fullTicker": "ECPG:USA",
    "baseTicker": "ECPG",
    "rank": 64.3686,
    "description": "Encore Capital Group, Inc., a specialty finance company, provides debt recovery solutions and other related services for consumers across financial assets worldwide. The company purchases portfolios of defaulted consumer receivables at discounts to face value, as well as manages them by working with individuals as they repay their obligations and works toward financial recovery. It is also involved in the provision of early stage collection, business process outsourcing, and contingent collection services. In addition, the company engages in debt servicing and other portfolio management services to credit originator for non-performing loans. Further, it offers credit management services. Encore Capital Group, Inc. was incorporated in 1999 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/XnGH6t9ij_vxRtpJkk64nA/hVXf4a6norCpZZfxUG8OkzLdEwXpf5giaqRv_8ZCUVMEZuhXWHr28-nw6BvdZUn0Tc1xlhgMgFjhs6Gegk3L5BYdWN6cPeNFJE8VObkOhzrHoqkUO1deBLlRjOeGTn-WKc7-SLl__3Gh4FA-GOkN-gDdC2z25qPxEkFyYx42KYQF1YObCN-1DWFQGxQuMy6K/cLdw4RSmOmIPF_1Sx-IBQ83gPZqsLxg39QMdZIJMlH4",
    "price": 39.395,
    "prevClose": 39.83,
    "absReturn": -0.43499999999999517
  },
  {
    "fullTicker": "SNOA:USA",
    "baseTicker": "SNOA",
    "rank": 75.4557,
    "description": "Sonoma Pharmaceuticals, Inc., develops and produces stabilized hypochlorous acid (HOCl) products for wound care, animal health care, eye and nasal care, oral care, and dermatological conditions in the United States, Europe, Asia, Latin America, and internationally. The company offers Lumacyn, a skin toner; Regenacyn, a prescription scar gel; Reliefacyn to alleviate red bumps, rashes, shallow skin fisures, sunburn, peeling, and eczema/atopic dermatitis; Gramaderm for the treatment of topical mild to moderate acne; Epicyn, an antimicrobial facial cleanser; Levicyn, an HOCl based prescription and over-the-counter product used to relieve skin irritations, lacerations, abrasions, and burns; Celacyn, a scar management gel; SebuDerm to manage and relieve the burning, itching, erythema, scaling, and pain associated with seborrhea and seborrheic dermatitis; and Pediacyn, an atopic dermatitis hydrogel. It also provides Microcyn, a HOCl-based topical line of products designed to stimulate expedited healing by targeting a range of pathogens; Ocucyn eyelid and eyelash cleanser; Ocudox for eye care; Sinudox for nasal irrigation; Microdacyn60 oral care solution to treat mouth and throat infections; and Podiacyn, a foot care product. In addition, the company offers MicrocynAH, an HOCl-based solution used to relieve common symptoms of hot spots, scratches, skin rashes post-surgical sites, and irritated animal skin; MicrocynVS, an animal care product; Nanocyn, a hospital-grade disinfectant; Acuicyn, an antimicrobial prescription solution for the treatment of blepharitis and the daily hygiene of eyelids and lashes; MucoClyns for use in emergencies and on mucous membranes, cuts, abrasions, burns, and body surfaces; and Endocyn root canal irrigation solutions. The company was formerly known as Oculus Innovative Sciences, Inc. and changed its name to Sonoma Pharmaceuticals, Inc. in December 2016. Sonoma Pharmaceuticals, Inc. was incorporated in 1999 and is based in Boulder, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/CEsO6nOe-DxV7o_KTGD89g/oG1oeOS5_5Yn8MdWHl3OP1hceSZ8WSHi1wN8D0v_zIxyyHsLNF4bfc2CvjId79OCOhFcj6H2LEIV6MrnnfCrb72-mLM3TObVWmS-2Q8PVLNNR1M8KcRj4zp22XvCBlVm3fVFG-ZsULKuI4Ip7QwN_GZm0YjZDTbaLrMmV0yhwVcO5JrtAxwIUBK5c1cwzj3O/DXGon5MBlEgySICJOF2cAOS6nPj7Fq2XfU1UEL8njVM",
    "price": 3.76,
    "prevClose": 3.71,
    "absReturn": 0.04999999999999982
  },
  {
    "fullTicker": "UVV:USA",
    "baseTicker": "UVV",
    "rank": 93.8349,
    "description": "Universal Corporation engages in sourcing, processing, and supplying leaf tobacco and plant-based ingredients worldwide. It operates through two segments, Tobacco Operations, and Ingredients Operations. The Tobacco Operations segment is involved in procuring, processing, packing, storing, and shipping of flue-cured, burley, dark air-cured, and oriental leaf tobacco for manufacturers of consumer tobacco products, as well as provision of related services; providing specialty services, such as custom blending, chemical and physical testing of tobacco, service cutting, reconstituted leaf tobacco manufacturing, and just-in-time product delivery services; and liquid nicotine for tobacco products manufacturers, as well as recycled waste materials from tobacco production. The Ingredients Operations segment engages in the production of specialty plant-based ingredients, including fruits, vegetables, herbs, fruit and vegetable juices, concentrates, pomaces, ciders, purees, nutraceuticals, fruit fibers, seeds, seed powders, dehydrated products, botanical extracts, distillates, natural flavors, colors, and other value-added products for consumer-packaged goods manufacturers and retailers, as well as food, beverage, and flavor companies. The company was founded in 1886 and is headquartered in Richmond, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753380000000/JPF-2BAVT1vkEYOelTOx-g/l2jriYA_aZuv1pGR2eQsMNRU70bEQeUXqMlEvX7evBVHTYO9I7S4crBqnyQFbF9SQEZabUYkKG6Hk_qArWFrTbb1tubfMglTkF0pLZB6cskuWDz7hyrBM4e2YjJvo071_EhnTalnxuZE5yTzQNxyDumq3X_8HUTKdT88xbtEtqU/HidRpQP9Sb9_BKC5kPBrY1-s-h-M7Si-_z_UTJm5uC8",
    "price": 55.145,
    "prevClose": 55.78,
    "absReturn": -0.634999999999998
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 635.48,
    "prevClose": 634.21,
    "absReturn": 1.2699999999999818
  }
]