[
  {
    "fullTicker": "DNTH:USA",
    "baseTicker": "DNTH",
    "rank": 1.0114,
    "description": "Dianthus Therapeutics, Inc., a clinical-stage biotechnology company, develops complement therapeutics for patients with severe autoimmune and inflammatory diseases. The company is developing DNTH103, a monoclonal antibody, which is in clinical-stage trial, for the treatment of generalized myasthenia gravis, multifocal motor neuropathy, and chronic inflammatory demyelinating polyneuropathy. Dianthus Therapeutics, Inc. was founded in 2019 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/6C8bB3COQ_oQKPVeN6fquw/a1XDfypehBL_bxoBZvcOi4F6uDagRvPcgVa4Dys8gl01qeT1te0RulA2V6DXkufMCqDLNug6_yg9v3rJx1JxNBQZ0gTSqZlURxD1y533j8Iv40F3GhXY_THQJjWpZKuDFZKFR6v3S03iB7JWTx6yWpppgmDiHfg9r7jQYlbhB0w8WtcgFtkN1IJ3hJtsHbUV/F5Z2f0g90PLy7vnTA7LTD26lt1cjQRt2b7n77hAO5ek",
    "price": 23.63,
    "prevClose": 23.42,
    "absReturn": 0.2099999999999973
  },
  {
    "fullTicker": "SHEN:USA",
    "baseTicker": "SHEN",
    "rank": 9.4014,
    "description": "Shenandoah Telecommunications Company, together with its subsidiaries, provides a range of broadband communication services and cell tower colocation space in the Mid-Atlantic portion of the United States. It operates in two segments, Broadband and Tower. The company Broadband segment offers broadband, video, and voice services to residential and commercial customers in Virginia, West Virginia, Maryland, Pennsylvania, and Kentucky through hybrid fiber coaxial cable under the Shentel brand; and fiber optic services under the Glo Fiber brand name. This segment also leases dark fiber and provides Ethernet and wavelength fiber optic services to enterprise and wholesale customers under the Glo Fiber Enterprise and Glo Fiber Wholesale brand names; and provides voice data and DSL telephone services. The Tower segment owns macro cellular towers and leases colocation space to the wireless communications providers. Shenandoah Telecommunications Company was founded in 1902 and is based in Edinburg, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/RTKaAs-YEi-QT5Twt0awHQ/4A4lOdwsoEk4xFvFFRffv_TKJZbmLfvbcib0XN1O-mNfVZB4nfHNcrgllN_xGDgvoSXhxPEDDVITiBErTWLk3_vlr5imLyDcx4MX7GBkC7LRCQ6MLHyhsqZpolssaoGqcBdeO71GNH6mvpxXJ1AESHeqgC82uRdIhLaTgpVznVYaUA-RHVFqLHvAbumvZVgW6f4gjhfI19-5Q8Ya7Ku2tw/3qevPrNzMIdlfnsSi8HtbtMGGhDU5ZrZvlRklw7jkrU",
    "price": 12.62,
    "prevClose": 12.53,
    "absReturn": 0.08999999999999986
  },
  {
    "fullTicker": "EDIT:USA",
    "baseTicker": "EDIT",
    "rank": 16.8131,
    "description": "Editas Medicine, Inc., a clinical stage genome editing company, focuses on developing transformative genomic medicines to treat a range of serious diseases. It develops a proprietary gene editing platform based on CRISPR technology. The company develops reni-cel, a clinical development gene-edited medicine to treat sickle cell disease and transfusion-dependent beta-thalassemia. In addition, the company is developing alpha-beta T-cell experimental medicines for the treatment of solid and liquid tumors in collaboration with Bristol Myers Squibb Company (BMS) through its wholly owned subsidiary, Juno Therapeutics, Inc. It also collaboration and licensing agreement with Immatics to combine gamma-delta T cell adoptive cell therapies and gene editing for the treatment of cancer. The company was formerly known as Gengine, Inc. and changed its name to Editas Medicine, Inc. in November 2013. Editas Medicine, Inc. was incorporated in 2013 and is based in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/oC4mhTUQRCh4eJ9UNK6fUQ/sznXBZcm33e8BCV0XFeQawyqUCy6B5ZtakEFmvVXZ9V5n3K449z-lO-l_LCYCJrgdK929TJ6yrsndgISYlm_6W5K16eWu9aoASrYUqh7gc6d2iXaFKXk9ew_kekvxf52o7RkWMNYWM1I4ndpvutRtkzyV7uQ6NCrYX1RRM5qXa6j47kGT6K1dWw-h6HWPJo2/qpe3FKi_tyJSMgxqyuPTAnLnMUV1l9j3sz8C_-XOGOs",
    "price": 2.735,
    "prevClose": 2.67,
    "absReturn": 0.06499999999999995
  },
  {
    "fullTicker": "ROMA:USA",
    "baseTicker": "ROMA",
    "rank": 28.1711,
    "description": "Roma Green Finance Limited, through its subsidiaries, provides environmental, social, and governance (ESG); sustainability; and climate change related advisory services in Hong Kong and Singapore. It also offers sustainability program development, ESG reporting, corporate governance and risk management, climate change strategies and solutions, environmental audit, ESG rating support and shareholder communication, and education and training services. It serves private companies and non-governmental organizations. The company was founded in 2018 and is based in Wan Chai, Hong Kong. Roma Green Finance Limited operates as a subsidiary of Top Elect Group Limited.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/F328W-eVA8bnsWV1c8lAxQ/WcLP3KN7DfA_RLJckR9rbeIlNfqF6PPGnP0Ow8t0_OsFweQrgcmwvXMSItdHADwv0Og2yiKXN6FliomXBmN4yJFMcpCA5Ok2uisVMRBNmbIgwgBoPhsANyEHEtdoY8Uj-wBDNDaWYO1W7MQ1AWgWAFsapClPZ8temtjPwDhK_rzDWnbqJJaeYQIe-91U5A7u/j12wwJVwlayCdco735NpMqB-8ZY7JRNocpUBH14eybM",
    "price": 2.805,
    "prevClose": 2.59,
    "absReturn": 0.2150000000000003
  },
  {
    "fullTicker": "NLSP:USA",
    "baseTicker": "NLSP",
    "rank": 32.7475,
    "description": "NLS Pharmaceutics AG, a clinical-stage biopharmaceutical company, engages in the discovery and development of therapies for patients with rare and complex central nervous system disorders. The company is focusing on the development of treatments for narcolepsy, idiopathic hypersomnia, and other rare sleep disorders, as well as neurodevelopmental disorders, such as attention deficit hyperactivity disorder (ADHD). Its lead product candidates include Quilience to treat excessive daytime sleepiness and cataplexy associated with narcolepsy; and Nolazol for the treatment of ADHD. The company also developing NLS-4, a selective dopamine reuptake inhibitor treatment for the chronic fatigue associated with the symptoms of Long-COVID; NLS-3, a repurposed reverse ester of methylphenidate for treatment of ADHD; NLS-8, a melatonin ML1A receptor agonist for improved scopolamine-induced amnesia; NLS-11, a norepinephrine and dopamine reuptake inhibitor and muscarinic M1, M2, M3 receptor antagonist; and NLS-12, a norepinephrine and dopamine reuptake inhibitor and muscarinic M4 receptor antagonist. It has licensing agreements with NeuroLife-Sciences SAS for use of mazindol for the treatment of ADHD; and Eurofarma Laboratorios S.A. for commercialization and distribution of Nolazol in Latin America. NLS Pharmaceutics AG was incorporated in 2015 and is based in Zurich, Switzerland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/ZmkcIHV1lwXYRU8_FTBZHQ/Be3l5LIejl-qGRHLsMyy_Tt_QLS-W6o86hj6VmSlT8mAwX48WnFZuRwdBVK7EBGE_IT_o6XZQqFTqA3AGIlH0eMH9k0toszhsTTBAvG_ASDB5tOzBWUMmJXf0NtISAyOc09dPt4lflTKqwr_D7dtpDwYfjJDy1zGTCZd343m3Mg9WQwaCXAhZyookiTVJDPD/ToNXBfTRakLh9OPbOLWYhj3kqGpUioah55F3BEHCb5Q",
    "price": 2.785,
    "prevClose": 2.68,
    "absReturn": 0.10499999999999998
  },
  {
    "fullTicker": "DHT:USA",
    "baseTicker": "DHT",
    "rank": 44.9179,
    "description": "DHT Holdings, Inc., through its subsidiaries, owns and operates crude oil tankers primarily in Monaco, Singapore, Norway, and India. The company also offers technical management services. As of March 15, 2025, it had a fleet of 23 very large crude carriers. The company was incorporated in 2005 and is headquartered in Hamilton, Bermuda.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/qaw6fqEAxqQB8mhleEsNPw/7qTcDI4gcXajjh3qekEBq1NFhLJNsCKhq6dLbYGEaPO4OIg63sn-Ns0SvVvnES5MC7_HupSmCb7viJt1mQfAG7n71dHXRGAnLg501vK-CdadlUgCtKr2gF0I0B2NiX2yd1OvemeWX6SLvLuwNyc0xrujM2RiNex95m_W7h4GH0DUICrSZ0ehr34pPBcP6rkB/Se51jhpebC2GEGKQHT4TFvqPz44piyCJENvLDG51bO8",
    "price": 11.285,
    "prevClose": 10.97,
    "absReturn": 0.3149999999999995
  },
  {
    "fullTicker": "VOYA:USA",
    "baseTicker": "VOYA",
    "rank": 60.4212,
    "description": "Voya Financial, Inc. provides workplace benefits, and savings solutions and technologies in the United States and internationally. The company operates through three segments: Wealth Solutions, Health Solutions, and Investment Management. The Wealth Solutions segment offers full-service retirement products; recordkeeping services; stable value and fixed general account investment products; non-qualified plan administration services; and tools, guidance, and services to promote the financial well-being and retirement security of employees. This segment also provides wealth management services, such as individual retirement, managed, and brokerage accounts, as well as financial guidance and advisory services. This segment serves corporate, public and private school systems, higher education institutions, hospitals and healthcare facilities, other non-profit organizations, and state and local governments, as well as institutional clients and individual customers. The Health Solutions segment offers various insurance products comprising stop loss, group life, group disability, whole and term life, critical illness, accident, and hospital indemnity insurance. This segment also provides worksite employee benefits, health account solutions, leave management, benefits administration, health plan enrollment, financial wellness, and decision support products and services to mid-size and large corporate employers and professional associations. The Investment Management segment provides fixed income, equity, multi-asset, and alternative products and solutions to individual investors, financial intermediaries, and institutional clients through its direct sales force, consultant channel, intermediary partners, banks, broker-dealers, and independent financial advisers. The company was formerly known as ING U.S., Inc. and changed its name to Voya Financial, Inc. in April 2014. Voya Financial, Inc. was founded in 1975 and is based in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/Rxr07zgBZstGsxaHZAagnA/2Qb_OKwYJmLuZervwNkSRYM26WB6EZ5HJK8Y-dDATVvP9ysZv_chUC704oqLwvY06_XJzT3LD5JYWlSub0H0lyHj6rSUxoJlyqNMBGI0KR7g1ZJ4GWyIYAx0OD5ZC8wdEjSPhWKcPYO_XneWhwcgb9Lu3ZYMF4PVlMzQKXKkeOwWB-YHivMLBEMBgp6F6APB/ntaqwyitVjxIrZ3nt2bhUhIpx1vJEE3tlW1ASBSt7XA",
    "price": 74.765,
    "prevClose": 74.99,
    "absReturn": -0.22499999999999432
  },
  {
    "fullTicker": "SNX:USA",
    "baseTicker": "SNX",
    "rank": 69.3417,
    "description": "TD SYNNEX Corporation operates as a distributor and solutions aggregator for the information technology (IT) ecosystem. It offers endpoint solutions, including personal computing devices and peripherals, mobile phones and accessories, printers, and supplies; and advanced solutions comprising data center technologies, such as hybrid cloud, security, storage, networking, servers, software, converged and hyper-converged infrastructure, and hyperscale infrastructure. The company also provides design, integration, test and other production value-added solutions, such as thermal testing, power-draw efficiency testing, burn-in, quality, and logistics support; logistics services; depot repair and customer management services; and cloud services, including public cloud solutions in productivity and collaboration, infrastructure as a service, platform as a service, software as a service, security, mobility, AI, and other hybrid solutions. In addition, it offers online services; financing options, including net terms, third party leasing, floor plan financing and letters-of-credit backed financing and arrangements, as well lease products to reseller customers and their end-users and provides device-as-a-service to end-users; and Marketing Services comprising direct mail, external media advertising, reseller product training, targeted telemarketing campaigns, national and regional trade shows, trade groups, database analysis, print on demand services, and web-based marketing. It serves value-added resellers, corporate resellers, government resellers, system integrators, direct marketers, retailers, and managed service providers. The company was formerly known as SYNNEX Corporation and changed its name to TD SYNNEX Corporation in September 2021. TD SYNNEX Corporation was founded in 1980 and is headquartered in Fremont, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/BY7qX45UJB_PIgE2w5LnxA/75W6xuyBuF87h55Vj7EpbTRdyYDowTCDZF18b7_dCYP2LP34B7OjTftM1tTRzAjc4xbbggU8SsCVJuZpJd179uzSZfzYO7aYgXb48oGQE3qo7NZnPfsJqiWxVh9ri9t7OrNhL-WybIsmTKx4dGn7Vs1l9tdFmgR_C676f4W6qNU/242ayLLnwTR6RH-6K9aRj7laU6RH0lozPBjrKWT57B0",
    "price": 143.87,
    "prevClose": 145.29,
    "absReturn": -1.4199999999999875
  },
  {
    "fullTicker": "MA:USA",
    "baseTicker": "MA",
    "rank": 76.4716,
    "description": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; consumer bill payment services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; and a platform to optimize supplier payment enablement campaigns for financial institutions. In addition, the company offers Mastercard Move, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and partners with central banks, fintechs and financial institutions to help governments and nonprofits, as well as enables various cross-border payment flows. Further, it provides security solutions; personalization, issuer and merchant loyalty, and marketing services; advanced analytics, business intelligence, economic and location-based insights, payments consulting, and operational insights services; processing and gateway solutions; and open banking services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus names. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/i99GXj9AxogeVSzwggcDNQ/ACZTl6LTvK2J0bhm7kUiCeT904Tpz0ARFVlRorcrRjjYAU6VZ4YeFcOFHzhnRYVEBZbyq-c9ynghjG7N-_C0zRxoWpB_zLhWJV3O0zOG2n1Qap2A3wlDgyUSJq9tOHPq7FLA_LPzmuvjpsYQ5hTD5nR-XRcMdUT3lKK2c9YnKPtdCsDZoM6SofX6erWelTTS/udOuAw8g5S90N2yarr5xeRh5TCyZh0Pugv8LKpNK0hs",
    "price": 589.47,
    "prevClose": 592.68,
    "absReturn": -3.2099999999999227
  },
  {
    "fullTicker": "COMM:USA",
    "baseTicker": "COMM",
    "rank": 86.6689,
    "description": "CommScope Holding Company, Inc. provides infrastructure solutions for communications, data center, and entertainment networks worldwide. The company operates in three segments: Connectivity and Cable Solutions (CCS); Networking, Intelligent Cellular and Security Solutions (NICS); and Access Network Solutions (ANS). The CCS segment provides fiber optic and copper connectivity, and cable solutions for use in telecommunications, cable television, residential broadband networks, data centers, and business enterprises; and network solutions for indoor and outdoor network applications. The NICS segment offers indoor cellular solutions, such as public key infrastructure solutions, indoor and outdoor Wi-Fi and long-term evolution access points, and access and aggregation switches; an Internet of Things suite; on-premises and cloud-based control and management systems; and software and software-as-a-service applications addressing security, location, reporting, and analytics. The ANS segment offers cable modem termination systems, video infrastructure, distribution and transmission equipment, and cloud solutions that enable facility-based service providers to construct residential and metro distribution network. The company serves telecommunications operators, data center managers, cable television providers, and multi-system operators. It offers its products and services through independent distributors, specialized resellers and distributors, wireless and wireline operators, original equipment manufacturers, and system integrators, as well as directly to customers. The company was formerly known as Cedar I Holding Company, Inc. and changed its name to CommScope Holding Company, Inc. in January 2011. CommScope Holding Company, Inc. was founded in 1976 and is based in Claremont, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755806400000/5JLiFbXyUnXQ0x1Y6E1LuA/E0fGMEtxMMf0pkwsICoHXQ1DZZqZuKUlLGiqBZ9kckdVLZUunB0QGIBGO9nNhXTVesC3COe0umP6djIgi77snUOfx7cPPgTA38aIXbWpNDTJk00XHvmWD0AEQbQwdGINesy9OH1ryUeBUZRzizHwBGPShys-G8wsPrw3hpmpukjRtwfKTRCWRmNecC6L14AW/C7iWCS3rdzIs3lS_QG9ZTaB_0UhY6rlXJIp2qEvewFw",
    "price": 15.325,
    "prevClose": 15.71,
    "absReturn": -0.38500000000000156
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 634.545,
    "prevClose": 638.11,
    "absReturn": -3.5650000000000546
  }
]