[
  {
    "fullTicker": "HSDT:USA",
    "baseTicker": "HSDT",
    "rank": 4.8678,
    "description": "Helius Medical Technologies, Inc., a neurotechnology company, focuses on developing, licensing, and acquiring non-implantable technologies for the treatment of symptoms caused by neurological disease or trauma. The company's product is Portable Neuromodulation Stimulator, a non-surgical medical device intended for use as a short term treatment of gait deficit due to symptoms from multiple sclerosis and balance deficit due to mild-to-moderate traumatic brain injury, as well as to be used in conjunction with supervised therapeutic exercise. Helius Medical Technologies, Inc. was incorporated in 2014 and is headquartered in Newtown, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/Dso-B1MNj4znXU4MOha8VA/-OyQVoK1NgMnzk8ND3pALifh4drRgxJQzOjs3rRdZ_UK2O-FmBw6_2TvrCL8_2018KvyyiYdnxR2dzkdGrFOGU_eE2h7pOW2nqOtuTWOO08_8Q0LiVtCkABnuSNQkH4ngq_PSD4peZYF0bhw0cqvHErtIkpZA938ZtjP4UF6w5U1NK9VMV8M4mhwyB1UdrgDdnIqfUY5FzwFKQTVKzQo1g/qIBqty-nTMP5mNSW3KsSlcGRirGFRHfuatSGE25BRzY",
    "price": 1.785,
    "prevClose": 2.03,
    "absReturn": -0.24499999999999988
  },
  {
    "fullTicker": "KOSS:USA",
    "baseTicker": "KOSS",
    "rank": 14.1652,
    "description": "Koss Corporation, together with its subsidiaries, engages in the design, manufacture, and sale of stereo headphones and related accessories in the United States, Sweden, the Czech Republic, Ukraine, Korea, Georgia, Canada, and internationally. The company offers high-fidelity headphones, wireless bluetooth headphones, wireless bluetooth speakers, computer headsets, telecommunications headsets, and active noise canceling headphones. It sells its products through distributors, international distributors, audio specialty stores, the internet, national retailers, grocery stores, electronics retailers, and prisons under the Koss name, as well as private label. Koss Corporation sells its products to distributors for resale to school systems, as well as directly to other manufacturers. The company markets through domestic retail outlets and numerous retailers. It also exports its products. Koss Corporation was founded in 1953 and is based in Milwaukee, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/SaM2T97nVHavCw-faQWvGw/H0tlTYub1eO8F3Lp_5kxd0sNk2oT72R4L7pdru9lghcqebcZ0ZRECrJwEOEg3ME-H7PWWTUgCURqwr49Xvt_dLbxtfx65sxw2UWyuO2bdNpG9aGjHntPQBVPbuIEjW43qwGS5dp0ac_G02N4oGdwK_qJJYZ0WguSf82Hk_3bQA4/76GxSu9ac_kKDvO2ppDPEf7hVk5ysTQxzX10i-y99B4",
    "price": 4.22,
    "prevClose": 4.26,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "GRI:USA",
    "baseTicker": "GRI",
    "rank": 15.2036,
    "description": "GRI Bio, Inc., a clinical-stage biopharmaceutical company, focuses on discovering, developing, and commercializing therapies that target diseases leading to inflammatory, fibrotic, and autoimmune disorders in the United States. Its lead product candidate is GRI-0621, an oral inhibitor of type 1 Natural Killer T cells, which is in phase II clinical trial for the treatment of severe fibrotic lung diseases, such as idiopathic pulmonary fibrosis. The company's portfolio also includes GRI-0803, a novel oral agonist of type 2 Natural Killer T cells that is in preclinical development for the treatment of autoimmune disorders; a proprietary library of 500+ compounds; and GRI-0124 for the treatment of primary sclerosing cholangitis, and GRI-0729, which are in pre-clinical development. GRI Bio, Inc. was formerly known as Glycoregimmune, Inc. GRI Bio, Inc. was founded in 2009 and is based in LA Jolla, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/5RrhE39IfdIxZHcirQtJTA/GabdOtxWt-T7Vz3QkHlUKTyr7xAN29Gi4Yqkc4EGl5XuxskV85KuIU6yAnBR_gZg4xRA8gAHDQJJysbokTqLgRbiOGH39yvyd7PvyoVO0g90qny9O_USgYuVsp0OLGPTLMxDUrzXkIbhNqUSFGmgZFwmwsmOhvuFzPARf-aJvPI/-CYiuoxXY7b0fnZbN04CbIKb0dKDmgYhk1bTO4azikI",
    "price": 2.38,
    "prevClose": 2.49,
    "absReturn": -0.11000000000000032
  },
  {
    "fullTicker": "VSEC:USA",
    "baseTicker": "VSEC",
    "rank": 29.9529,
    "description": "VSE Corporation operates as a diversified aftermarket products and services company in the United States and internationally. It operates through two segments, Aviation and Fleet. The Aviation segment provides aftermarket parts supply and distribution; maintenance, repair, and overhaul services for components and engine accessories supporting commercial, business, and general aviation operators. This segment serves commercial airlines, regional airlines, air cargo transporters, MRO integrators and providers, aviation manufacturers, corporate and private aircraft owners, and fixed-base operators. The Fleet segment offers parts supply, inventory management, e-commerce fulfillment, logistics, supply chain support, and other services to support the commercial aftermarket medium- and heavy-duty truck market under the Wheeler Fleet Solutions brand name. This segment also provides vehicle parts distribution, sourcing, IT solutions, customized fleet logistics, warehousing, kitting, just-in-time supply chain management, alternative product sourcing, and engineering and technical support services, as well as sustainment solutions and managed inventory services to commercial truck fleets. VSE Corporation was incorporated in 1959 and is headquartered in Miramar, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/L3Bhg2IsjLck4ju-b2RFig/lho2E9CbTsBtUAnFUAG4mGAs6PFQgFdOKqseEk_VZfb2gSA9c-xiekIU8e83XzJ70K3d05jZDNZbvcvQrV7-wHK2oorq0i-v2yTYz3TDY8NsZWTvxhSpdiISUpEwRNrLFBAwHiXPCuufSHK5Ym4ODBEKQ-i-w5CmbYghbH7AoDE/s_0kNCqB5R1lDJsmGDzDMOUOb4fp3_CoDAx94VY77Yo",
    "price": 222.13,
    "prevClose": 227.78,
    "absReturn": -5.650000000000006
  },
  {
    "fullTicker": "CRMT:USA",
    "baseTicker": "CRMT",
    "rank": 35.2101,
    "description": "America's Car-Mart, Inc., through its subsidiaries, operates as an automotive retailer for the used car market in the United States. It primarily sells older model used vehicles and provides financing for its customers. The company was founded in 1981 and is headquartered in Rogers, Arkansas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/IxFhoundu5BcpmHkO6Oq7w/oA1W1NWuKdZlMsPMudgMMCq1H8ATQcxIuGZKd_khVf6LgNA08_LFYDUcY51Q3ebqYQ838CklSneYWQ78KueNNurM2nZInyuXzHjP1J_6DidYGW_la2K_rUmIi2PtjXWeY3KDgWxwANpnJpw1jArMAEVl2PyJUs0faXrOQc65bodW6ZqEtIjyhipNLA6o78Am/V1UUFrrElNEXLwCQwirVuBcPz6GNw5NsZTeta80QQX0",
    "price": 20.515,
    "prevClose": 22.49,
    "absReturn": -1.9749999999999979
  },
  {
    "fullTicker": "WRB:USA",
    "baseTicker": "WRB",
    "rank": 53.0586,
    "description": "W. R. Berkley Corporation, an insurance holding company, operates as a commercial line writer worldwide. The company operates in two segments, Insurance, and Reinsurance & Monoline Excess. The Insurance segment underwrites commercial insurance business, including excess and surplus lines, admitted lines, and specialty personal lines. This segment also provides accident and health insurance and reinsurance products; insurance for commercial risks; casualty and specialty environmental products; insurance coverages for fine arts and jewelry exposures; excess liability and inland marine coverage for small to medium-sized insureds; and commercial general liability, umbrella, professional liability, directors and officers, commercial property, and surety products, as well as products for technology, and life sciences and travel industries. In addition, it offers cyber risk solutions; crime and fidelity insurance products; medical professional coverages; workers' compensation insurance products; management liability and general insurance products; personal lines insurance solutions, including home, condo/co-op, auto, fine arts and collectibles, liability, collector vehicle, and recreational marine; law enforcement, public officials and educator's legal, and employment practices liability, as well as incidental medical, property, and crime insurance products; at-risk and alternative risk insurance program management services; professional liability; energy and marine risks; and insurance products to the Lloyd's marketplace. The Reinsurance & Monoline Excess segment provides treaty and facultative reinsurance solutions; property and casualty reinsurance products; facultative reinsurance products include automatic, semi-automatic, and individual risk assumed reinsurance; and turnkey products, such as cyber, employment practices liability insurance, liquor liability insurance and violent events. The company was founded in 1967 and is headquartered in Greenwich, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/lbGlzX4c5M6X6cqI2l0-YA/7N7Ma9rSzJkOfEOX_7fgBfayuheTUP9oI5SIjcLU1dqdgVbR9Wth5eIr5Pe6E1a6ANcimQf_-dBv6Jw76JW9gAal7oXvTwm0x4w48VSfBffYp6jvuJekDOPNkvfCPojNu-KmPou2kbwqnlafKa9R5mKpROtfnHJDu2Bk-VSKf0i1_9yUSLZflXuIGt7u812t/lYQnrIHHi-o2wik-gu3gOFh8lXKhaevPOpkBWY0_V6Y",
    "price": 71.125,
    "prevClose": 71.08,
    "absReturn": 0.045000000000001705
  },
  {
    "fullTicker": "VSAT:USA",
    "baseTicker": "VSAT",
    "rank": 64.4978,
    "description": "Viasat, Inc. provides broadband and communications products and services in the United States and internationally. It operates in three segments: Satellite Services, Commercial Networks, and Government Systems. The Satellite Services segment offers in-flight connectivity and wireless in-flight entertainment services for commercial aircraft and private jets; aviation software, and narrowband safety and communications services; satellite-based fixed broadband services, including broadband internet access, voice over internet protocol, and other services; enterprise connectivity solutions; fixed broadband internet, and wholesale and retail fixed broadband services; energy services comprising networking and connectivity solutions for remote sites and operations, and industry-leading machine learning analytics; IoT and other narrowband services; and community internet services. The Commercial Networks segment provides mobile satellite communication systems for use in aircrafts, and land-mobile and seagoing vessels; fixed broadband satellite communication systems, such as satellite network infrastructure and ground terminals; antenna systems, including ground and airborne terminals, antennas, and gateways for terrestrial and satellite customer applications, mobile satellite communications, Ka-band earth stations, and other multi-band/multi-function antennas; and space systems design and satellite networking development systems. This segment also designs and develops satellite and ground communications systems and network function virtualization, as well as ground-based network subsystems; and designs, develops, and produces space system solutions for various orbital regimes, including GEO, HEO, medium earth orbit (MEO), low earth orbit (LEO) satellites, and other satellite platforms. The Government Systems segment offers government mobile broadband products and services, including mobile and fixed broadband modems, terminals, and network access control systems; mesh and hub-and-spoke satellite networking systems; and secure networking, cybersecurity, and information assurance products. Viasat, Inc. was incorporated in 1986 and is headquartered in Carlsbad, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/9fC73CeakuOwgoqDSE9FDw/ul80FwCMYrxdJPaKfBbosoZJ1BoKVPOcuuwPQD6h7Ffn7YyxxaAGGb-bLmkUTRZl4pozO_WFsZUJuI2W9qFyBUHrupFFaa8u13lqAZH1H7lrxcCIZIy-HnhMAxUMgeVD6Q4VhjDl3GJe0Q3oStjJkkcDzrnitknlbmElTU9TSyU/cu0VGin8K3mj6M4ixkaX0SU6Pm33ZjrT6cIs_-URx8w",
    "price": 45.02,
    "prevClose": 46.5,
    "absReturn": -1.4799999999999969
  },
  {
    "fullTicker": "ARDT:USA",
    "baseTicker": "ARDT",
    "rank": 66.8343,
    "description": "Ardent Health Partners, Inc. owns and operates a network of hospitals and clinics that provides a range of healthcare services in the United States. The company offers general and specialty services, including internal medicine, general surgery, cardiology, oncology, orthopedics, women's services, neurology, urology, and emergency services within inpatient and ambulatory care settings. It also operates a network of ambulatory facilities and telehealth services, including primary care and specialty care clinics, ambulatory surgery centers, urgent care centers, free-standing emergency departments, and diagnostic imaging centers. It operates acute care hospitals, including rehabilitation hospitals and surgical hospitals. The company was founded in 2001 and is based in Brentwood, Tennessee. Ardent Health Partners, Inc. is a subsidiary of EGI-AM Investments, L.L.C.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/n4IBWtpShmIGsm2QZOIqJg/_BeReY1r4evNOH75hDnfAkJfPgszCWJdRlBpz4HPG7nG5CghAEZNGm96lj3Llqpv8plLJzZ6Gen-sYTTSQspNyJ5N6_hjDPygHNSsJtS2hd22sEYqU00kfIa8rf7XjfiW-zPMIcN3rDWTgSNLvhEqiR4YIV61XQ0c4SSVyAw3H5JsmbgMqVi4VkR0tam2NWv/XH925OCjtZR97AStCp9DMIUaNHZPb568dGEpHqWLHBg",
    "price": 9.645,
    "prevClose": 9.41,
    "absReturn": 0.23499999999999943
  },
  {
    "fullTicker": "WOR:USA",
    "baseTicker": "WOR",
    "rank": 76.9917,
    "description": "Worthington Enterprises, Inc. operates as an industrial manufacturing company. It operates through two segments, Consumer Products and Building Products. The Consumer Products segment provides products in the tools, outdoor living, and celebrations end markets. The segment's products include hand-held torches, micro torches, lighters, accessories, and fuel for constructing, fixing making, and creating; precision and specialty hand, digital, and safety tools; drywall tools and accessories used for finishing and taping, cutting, siding, and roofing; propane-filled cylinders for torches, camping stoves and other applications, helium-filled balloon kits, and gas grills and pizza ovens. This segment sells its products primarily to mass merchandisers, retailers, and distributors under the Balloon Time, Bernzomatic, Coleman, Garden-Weasel, General, Halo, Hawkeye, Level5, Mag-Torch, Pactool International, and Worthington Pro Grade brands. The Building Products segment provides pressurized containment solutions, such as refrigerant gas cylinders used in holding refrigerant gases for commercial, residential, and automotive air conditioning, and refrigeration systems; liquefied petroleum gas cylinders that holds fuel for residential and light commercial heating systems, barbeque grills and recreational vehicle equipment, industrial forklifts, and commercial/residential cooking; well water and expansion tanks used primarily in the residential and commercial markets; specialty products, including various fire suppression tanks, chemical tanks, and foam and adhesive tanks; and ceiling suspension systems. The company was formerly known as Worthington Industries, Inc. Worthington Enterprises, Inc. was founded in 1955 and is headquartered in Columbus, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/iJStoujOq7-HXNc8pLNXmw/FC-748ryYAUpxVoPXvffPJoWsIh_FkAs-A1JT6o2bSscibAlnbvvGR8SX7I0-WeK72w22vwH2_bCmLZw8lrCopkJ5R5PqURSpPRbZ1uJrpArDkTcgacMrOnmsCmEjAPD-DRvNoP0YbXH3tYjqfDmWFRVBJEILtLk-N8h41DwshvNJPRCqsD4EvPZne5r2-yW/TDN9aualB6xMPQU87Fz0kw14CPdd1kNvYg8e_Fk7vO8",
    "price": 56.07,
    "prevClose": 57.16,
    "absReturn": -1.0899999999999963
  },
  {
    "fullTicker": "APEI:USA",
    "baseTicker": "APEI",
    "rank": 91.1569,
    "description": "American Public Education, Inc., together with its subsidiaries, provides online and campus-based postsecondary education and career learning in the United States. It operates through three segments: American Public University System, Rasmussen University, and Hondros College of Nursing. The company offers 182 degree programs and 136 certificate programs in various fields of study, including nursing, national security, military studies, intelligence, homeland security, business, health science, information technology, justice studies, education, and liberal arts; and career learning opportunities in leadership, finance, human resources, and other fields of study critical to the federal government workforce. It also provides nursing-and health sciences-focused postsecondary education, pre-licensure nursing programs, diploma in practical nursing, and an associate degree in nursing. The company was incorporated in 1991 and is headquartered in Charles Town, West Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771884000000/nq7eB74-kjctm0dSEqSXBQ/hcqKpwzwNEtBgULB8cruQsuI7v7BhbmxJ3gY2ZvjCiSJdpjeSA8Se4i3Esm8h-3AhaDUuSQYeUvJAgfJbBXGCexU0-UpT_Kis5lIwWRdh5S8yW8KUoSbwRwMnRG17ENgz-_MCmIWUaOq2j2g7iZZn6TaabIXCUf3HrsRfCXrJTRhQQE3R8IRhaZ4gxLESwub/qYd7qjcNfOm3PfSyjVdFLcF5g2pPwd54GLJDEE7-HjE",
    "price": 43.42,
    "prevClose": 43.85,
    "absReturn": -0.4299999999999997
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 683.335,
    "prevClose": 689.43,
    "absReturn": -6.094999999999914
  }
]