[
  {
    "fullTicker": "EVEX:USA",
    "baseTicker": "EVEX",
    "rank": 4.9579,
    "description": "Eve Holding, Inc., together with its subsidiaries, develops urban air mobility solutions. It is involved in the design and production of electrical vertical take-off and landing vehicles (eVTOLs); provision of eVTOL service and support capabilities, including material services, maintenance, technical support, training, ground handling, and data services; and development of urban air traffic management systems. Eve Holding, Inc. is based in Melbourne, Florida. Eve Holding, Inc. operates as a subsidiary of Embraer Aircraft Holding, Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/4prWkTdll3oXtrq_98w12A/7WpaGvxI2TltbKT-mkfMIpuKJSkgdpTnEr66gkarkpvkdtcOvDcS3QBlkOW4lDqiDFWaN0FWnszfcfDWhgfW4XsdH8T09gNeHy3c0aYnx2K_1vnkkgRP9doNIkKeZ0dtWkbSTN1UFhGIBf3lsVaulSydJGp0DIPRHXh5fRMGKGi60_Hc8d9k9bVse3DHRo04/ZXIzhTP-sE0dYOzqm7mOJb_YDgcmgd16WpvWlL7mpvg",
    "price": 4.355,
    "prevClose": 4.56,
    "absReturn": -0.20499999999999918
  },
  {
    "fullTicker": "TSHA:USA",
    "baseTicker": "TSHA",
    "rank": 9.3649,
    "description": "Taysha Gene Therapies, Inc., a clinical-stage biotechnology company, focuses on developing and commercializing adeno-associated virus-based gene therapies for the treatment of monogenic diseases of the central nervous system. It primarily develops TSHA-120 for the treatment of giant axonal neuropathy; TSHA-102 for the treatment of Rett syndrome; TSHA-121 for the treatment of CLN7 disease; TSHA-118 for the treatment of CLN1 disease; TSHA-105 for the treatment of SLC13A5 deficiency; TSHA-113 for the treatment of tauopathies; TSHA-106 for the treatment of angelman syndrome; TSHA-114 for the treatment of fragile X syndrome; and TSHA-101 for the treatment of GM2 gangliosidosis. The company has research, collaboration, and license agreement with The University of Texas Southwestern Medical Center. Taysha Gene Therapies, Inc. was incorporated in 2019 and is headquartered in Dallas, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/qOUnv3VofVzzDUg_P6enig/yRcLUAwKtyz3Kl9lJGH8GV5alNDMCFyPoX9Fl7vUontU5bIHlnTl3xxJSvTiPjVuOXYtO4StRj-RMcr-tI-ir9_zfCnHqPwhRptTMHyWiSHJ7IrCJyXe9IfPSKkRReErDRoJHLbt7zXyuPqA6cEg-fh9MQ2jy2tWCj0nFdwJAG0cRfO8zUzYo1ipAJB9LC3H/WhjWYg3qGg1WkCEqk73YK_pdaH3zr1Sdtz-odcBOL6o",
    "price": 4.945,
    "prevClose": 5.01,
    "absReturn": -0.0649999999999995
  },
  {
    "fullTicker": "PLBY:USA",
    "baseTicker": "PLBY",
    "rank": 20.8846,
    "description": "PLBY Group, Inc. operates as a pleasure and leisure company in the United States, Australia, China, the United Kingdom, and internationally. It operates through three segments: Licensing, Direct-to-Consumer, and Digital Subscriptions and Content. The company offers sexual wellness products, such as lingerie, bedroom accessories, intimacy products, and other adult products; style and apparel products for men and women; digital entertainment and lifestyle products; and beauty and grooming products for men and women, such as skincare, haircare, bath and body, grooming, cosmetics, and fragrance. It also owns and operates digital commerce retail platforms, such as playboy.com, honeybirdette.com, yandy.com, and loversstores.com; and Honey Birdette and Lovers retail stores. In addition, the company licenses Playboy name, Rabbit Head Design, and other trademarks and related properties; and programming content to cable television operators and direct-to-home satellite television operators. Further, the company business covers the subscription sale of playboyplus.com and playboy.tv, which are online content platforms. It offers its products under its flagship brand Playboy. PLBY Group, Inc. is headquartered in Los Angeles, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/MCwyCXDtawA8nWcUfuN6NQ/3vo_c-vbpbU9tZP1Rk__a-r5bprXoseaNdKo7t0KbIJMLjOZDQa6XBd5Tew3LIzqrzxbkm-2S2erArnx5-S03_SctPp253afCpMUW9ANYskcIq4k3pRTJn2cUZeuMdAalkFIYb2gsAPakWgdE4HgUVPthZHui-H1-_FocZBx-S8/uBM6U2vBLmnXnJ5kvGhkyJ3095o60wueAojr74efpBU",
    "price": 1.28,
    "prevClose": 1.32,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "HOTH:USA",
    "baseTicker": "HOTH",
    "rank": 26.2638,
    "description": "Hoth Therapeutics, Inc., a clinical-stage biopharmaceutical company, focuses on developing therapies for unmet medical needs. It develops HT-001, a topical formulation in Phase II clinical trial for the treatment of patients with rash and skin disorders associated with initial and repeat courses of tyrosine kinase epidermal growth factor receptor inhibitor therapy; HT-KIT to treat mast-cell derived cancers and anaphylaxis; HT-TBI to treat traumatic brain injury and ischemic stroke; HT-ALZ for the treatment and/or prevention of Alzheimer's or other neuroinflammatory diseases; HT-004 for treatment of asthma and allergies using inhalational administration; and HT-003 for the treatment of acne and psoriasis, as well as inflammatory bowel diseases. The company is also developing BioLexa Platform, a proprietary, patented, drug compound platform in Phase I clinical trial for the treatment of eczema; and HT-005 for treating patients with lupus. The company has license agreements with the George Washington University; Isoprene Pharmaceuticals, Inc.; Virginia Commonwealth University; the North Carolina State University; Chelexa BioSciences, Inc. and the University of Cincinnati; Zylö Therapeutics, Inc.; and Voltron Therapeutics, Inc. It also has a research collaboration agreement with Weill Cornell Medicine to develop HT-003. Hoth Therapeutics, Inc. was incorporated in 2017 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/OApqNOR-cMUvzDJpYUx89w/pSscU4_ArgWfmEbx_4j03V85ytvjvh8Rx8u5-BHmMJfEJ-J_pQDq7Czol6sFDacmE7KypqooaqrDohjIdDwPx5_7qsOMQfRJpv_OoiBcWjlCiPpQYx14nz6-qvE5WT8ZKFu9y0--UC0qQzEZWOPEag/b_ahaNvEJphFNSNCmUJcZTr097IjFMbu-sN6oWoRrnE",
    "price": 1.36,
    "prevClose": 1.4,
    "absReturn": -0.039999999999999813
  },
  {
    "fullTicker": "VSCO:USA",
    "baseTicker": "VSCO",
    "rank": 37.9294,
    "description": "Victoria's Secret & Co. operates as a specialty retailer of women's intimate, and other apparel and beauty products worldwide. The company offers bras, panties, lingerie, casual sleepwear, apparel, sport and swim, as well as prestige fragrances and body care; and loungewear, activewear, and accessories and beauty under the Victoria's Secret, PINK, and Adore Me brand names. It provides its products through its retail stores; websites, such as VictoriasSecret.com, PINK.com, AdoreMe.com, and DailyLook.com; and other digital channels. The company also operates stores under the franchise, license, and wholesale arrangements. Victoria's Secret & Co. was incorporated in 2021 and is headquartered in Reynoldsburg, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/gxZiQ6O_UA65vQCPhjd_4g/nYyHBos3kBgmQEHhziZVrzgIf9Czv-MzOsmeAfM0lHtNj5HkRnBfQB4cwwjmmZcL_JDcELDSTe6cJslCy37zcXpi3j0bG4qGjXldOIq58deYKlXBMKJlu-bWqFA7dcEy5Hyh020-AMSgSPysa-jMpXVmUP0my_7o4w72ShopQgWosUkCyI9-6tq4Lr52u5L6/aGiMlaGCA1LZ-qStg5VuM-TFw4Z4EKER5-8l3CO61Q0",
    "price": 33.865,
    "prevClose": 36.23,
    "absReturn": -2.364999999999995
  },
  {
    "fullTicker": "SNES:USA",
    "baseTicker": "SNES",
    "rank": 43.3895,
    "description": "SenesTech, Inc. develops a technology for managing animal pest populations through fertility control. It offers ContraPest, a liquid bait that limits reproduction of male and female rats. The company was incorporated in 2004 and is headquartered in Phoenix, Arizona.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/KB41iBt1TtdMMe8lGMxDKw/H4PNFB_o_r3LjN-AiOfRsC0NE96LAcrmmi7yEFK0jtQPvaQVkvjbN9gHBC1opKILOS8-YMzP8lcQpARBUK3oAPGLN76fpeuMPAIvXAe_xypxYokHUPakSsHnyquAUTEg3eiW1yz7UvsWT5qHDl-BrYkVW0ptfOEsSAkyzn3-bAE/aycRppgm9UID7GATlj9M3vESX5RXU_455S5CLMI8YwI",
    "price": 3.32,
    "prevClose": 3.34,
    "absReturn": -0.020000000000000018
  },
  {
    "fullTicker": "AGMH:USA",
    "baseTicker": "AGMH",
    "rank": 57.8095,
    "description": "AGM Group Holdings Inc., a technology company, researches, develops, and sells of cryptocurrency mining machine and standardized computing equipment in Hong Kong, Singapore, and Mainland China. The company offers MetaTrader 5, a future trading solution; and foreign exchange trading system that provides services to financial institutions. It also engages in the research and development, manufacture, and sale of technology hardware products, as well as offers financial technology software services. AGM Group Holdings Inc. was incorporated in 2015 and is based in Wan Chai, Hong Kong.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/EnUItx9yjTvohzQvGNkjDA/ijZe6m4Ou-IDHwDpgCOJ4W_Jb3Oohq5HaMWtfmp1QsFTNTfWzSiejNmcWNrjKdpCjNaOtT-IKbn9Ii0n5QZLfqA5BIcl0-MC2HZc-vWD6g_xS__eHFiAyVukO_zJpCLPQ9O38tlJ_ERlgB0rAkce_UIHQLGXz4yxiH9fz4Tt0B5p_LPI2JGOBplfkXunFP_1/bXPAOlllZwNNzfDbtKSZpTm4Yvf7H-pYCavyw1Q5MIM",
    "price": 4.4,
    "prevClose": 4.54,
    "absReturn": -0.13999999999999968
  },
  {
    "fullTicker": "DT:USA",
    "baseTicker": "DT",
    "rank": 71.2249,
    "description": "Dynatrace, Inc. provides a security platform for multicloud environments in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates Dynatrace, a security platform, which provides application and microservices monitoring, runtime application security, infrastructure monitoring, log management and analytics, digital experience monitoring, digital business analytics, and cloud automation. Its platform allows its customers to modernize and automate IT operations, delivers software, and enhance user experiences. In addition, the company offers implementation, consulting, and training services. It markets its products through a combination of direct sales team and a network of partners, including resellers, system integrators, and managed service providers. It serves customers in various industries comprising banking, financial services, government, insurance, retail and wholesale, transportation, and software. Dynatrace, Inc. was founded in 2005 and is headquartered in Waltham, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/J-gScjYHncsoR1x55Dcn0Q/wh7cYF__wWGSFAxBLzmwRoDz_m6LTZDzX7CTOtiQEy8bDEiEmRqVYjx-tgUofTJUqq56nCvCHtvS3xp87idWSgh_eiiURaDvD4ycLuThFEbuFsyOKU-rjF54fqxXZpZIZDc9yvmvFMgX6xD4huuqyJxiLrCVkL5BRADAPk6ZwgQ/xPr6ymi0L3ZBhIb9BJMRjzI-kZxu3REzSBVJzcxFFac",
    "price": 48.62,
    "prevClose": 49.01,
    "absReturn": -0.39000000000000057
  },
  {
    "fullTicker": "LRCX:USA",
    "baseTicker": "LRCX",
    "rank": 75.5995,
    "description": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/eSF-sN7vMcXRt1DZYpp0GA/VogWi4h_pYI78FM_2TI4lsO8_tAGYxm4_3Ca7nxTsaVymYvssWLmDA77SW6LF6S2Jteh1urKekwxzNZflUzzc4xWzGJ_slKlCvM2qLzJaDLxjGpySWtbZlBFKVQWeNkS0PhRLcdX7-Zvc7Hf1H2VG6FEyEYWjoXs5AHVJ7E5PDk7L-dXvZnpweUWp6_8m74l/hqsVrXEDtcDfcj6iXCvZTbK9_KIh4qUCzyPTd40m7qo",
    "price": 161.695,
    "prevClose": 160.67,
    "absReturn": 1.0250000000000057
  },
  {
    "fullTicker": "HLLY:USA",
    "baseTicker": "HLLY",
    "rank": 88.0752,
    "description": "Holley Inc. designs, manufactures, and distributes automotive aftermarket products to car and truck enthusiasts in the United States, Canada, and Europe. The company's performance automotive products include carburetors, fuel pumps, fuel injection systems, nitrous oxide injection systems, superchargers, exhaust headers, mufflers, distributors, ignition components, engine tuners, automotive performance plumbing products, as well as exhaust products, including shifters, converters, transmission kits, transmissions, tuners, and automotive software. It also offers brakes and brake systems, vehicle restoration parts, helmets, head and neck restraints, seat belts, fire suits, fuel and exhaust system cleaners, suspensions and chassis, wheels and wheel accessories, and apparel and collectibles. The company sells its products under the Holley EFI, Holley, MSD, Simpson, EDGE, Superchips, Diablosport, Accel, Flowmaster, and other brand names through DTC, E-tailer, warehouse distributor, traditional retailer, automotive platforms, and jobber/ installer channels. Holley Inc. was founded in 1903 and is headquartered in Bowling Green, Kentucky.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761861600000/Q_poyrtdLn4EaMJ-QWxsKQ/4_UzVKzI56CQZaaI0mOlmttxkIEwxD8269ih3SkFfHgoEiHWKHa6zvhT-Zfb5blZPE2NQlON34LbEJkA8EVQGq4qEqXsHlKr7yM96rEdvMpAiqmUxxl6d5gwaz1lTz7vUapyf9oCgYD-A0IqEyT8TlVVS0f9V7pRzhvoCOFVtrk/JG7q84MMEXGnhX2dqpBAh04fuzlKPQlfRWo4OZn3C64",
    "price": 2.885,
    "prevClose": 2.99,
    "absReturn": -0.10500000000000043
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 680.29,
    "prevClose": 687.39,
    "absReturn": -7.100000000000023
  }
]