[
  {
    "fullTicker": "ARBE:USA",
    "baseTicker": "ARBE",
    "rank": "",
    "description": "",
    "logo": "",
    "price": 1.28,
    "prevClose": 1.28,
    "absReturn": 0
  },
  {
    "fullTicker": "COGT:USA",
    "baseTicker": "COGT",
    "rank": "",
    "description": "",
    "logo": "",
    "price": 10.96,
    "prevClose": 10.86,
    "absReturn": 0.10000000000000142
  },
  {
    "fullTicker": "KNTK:USA",
    "baseTicker": "KNTK",
    "rank": "",
    "description": "",
    "logo": "",
    "price": 41.3,
    "prevClose": 41.53,
    "absReturn": -0.23000000000000398
  },
  {
    "fullTicker": "RMTI:USA",
    "baseTicker": "RMTI",
    "rank": "",
    "description": "",
    "logo": "",
    "price": 0.9633,
    "prevClose": 0.98,
    "absReturn": -0.016699999999999937
  },
  {
    "fullTicker": "SLP:USA",
    "baseTicker": "SLP",
    "rank": "",
    "description": "",
    "logo": "",
    "price": 14.17,
    "prevClose": 14.06,
    "absReturn": 0.10999999999999943
  },
  {
    "fullTicker": "HALO:USA",
    "baseTicker": "HALO",
    "rank": "",
    "description": "",
    "logo": "",
    "price": 62.9,
    "prevClose": 62.1,
    "absReturn": 0.7999999999999972
  },
  {
    "fullTicker": "SPOK:USA",
    "baseTicker": "SPOK",
    "rank": "",
    "description": "",
    "logo": "",
    "price": 18.21,
    "prevClose": 18.09,
    "absReturn": 0.120000000000001
  },
  {
    "fullTicker": "ADMA:USA",
    "baseTicker": "ADMA",
    "rank": 14.4308,
    "description": "ADMA Biologics, Inc., a commercial biopharmaceutical company, engages in developing, manufacturing, and marketing specialty plasma-derived biologics for the treatment of immune deficiencies and infectious diseases in the United States and internationally. The company offers BIVIGAM, an intravenous immune globulin (IVIG) product indicated for the treatment of primary humoral immunodeficiency (PI); ASCENIV, an IVIG product for the treatment of PI; and Nabi-HB, a human polyclonal antibody product for the treatment of acute exposure to blood containing Hepatitis B surface antigen and other listed exposures to Hepatitis B. It also develops a pipeline of plasma-derived therapeutics. In addition, the company operates source plasma collection facilities, including collections of source plasma, procurement of raw materials and packaging materials, and the testing of finished drug products. The company sells its products through independent distributors, drug wholesalers, specialty pharmacies, and other alternate site providers. ADMA Biologics, Inc. was incorporated in 2004 and is headquartered in Ramsey, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1754920800000/fL4qDMVihMk0Vpc6ml8o2w/M7U4oSlbb-WfH9XFvEQKscJuuA6znn_dmLN5W58hMpFxB0-98xXR4yFgRfI3lochKrB-a75ccnZ4-EPoqCC1iEz5z5-EhSCyTix0p9txKVMtU-xLB2q5YZqsNPjR76IO_16i-xknWvO0KX2AYGrbmYbduIbV6rx_T4ivUJDhHwPqF67E9_mhWU83jIEMLC4q/B7cZHQREYVSKHXp7awpNU418qufFIAUnMciAiEUjgxM",
    "price": 16.52,
    "prevClose": 16.75,
    "absReturn": -0.23000000000000043
  },
  {
    "fullTicker": "BCC:USA",
    "baseTicker": "BCC",
    "rank": 34.0546,
    "description": "Boise Cascade Company engages in manufacture and sale of engineered wood products (EWP) and plywood, and wholesale distribution of building materials in the United States and Canada. It operates through two segments, Wood Products and Building Materials Distribution. The Wood Products segment manufactures laminated veneer lumber and laminated beams used in headers and beams; I-joists for residential and commercial flooring and roofing systems, and other structural applications; structural, appearance, and industrial grade plywood panels; and ponderosa pine lumber and appearance grade boards. The Building Materials Distribution segment distributes a line of building materials, including oriented strand boards, plywood, and lumber; general line items, such as siding, composite decking, doors and millwork, metal products, insulation, and roofing; and EWP. It markets and sells its products to dealers, home improvement centers, wholesalers, specialty distributors, and industrial converters for use in the construction of new residential housing, repair-and-remodeling of existing housing, construction of light industrial and commercial buildings, and other industrial applications through warehouse and direct sales. Boise Cascade Company was incorporated in 2004 and is headquartered in Boise, Idaho.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1754920800000/eLiBD3ZqDQGESmKmEqWieg/BgBcUdS4vIHGqQh57VgRvPOOGkxKhO-FlmJ3cvtegCIUJOatrRYVKEte5yP_EFj-PygCrSegqIXq95U9xrVur-f72gHf6BJDlKSHBa8crY7oezsYShqFHmTh2Z286l7-l0UOPb8O244PhjlkZLlNL1W6WWHNlp0P_oZs0h3aaHE/jnp4SxN9st-jgOC9Qx60_upLSIxBYVoH73RXUwXy37o",
    "price": 82.09,
    "prevClose": 83.19,
    "absReturn": -1.0999999999999943
  },
  {
    "fullTicker": "ZWS:USA",
    "baseTicker": "ZWS",
    "rank": 67.8262,
    "description": "Zurn Elkay Water Solutions Corporation engages in design, procurement, manufacture, and marketing of water management solutions in the United States, Canada, and internationally. It offers water dispensing and filtration products, such as filtered bottle filling stations, water fountains and water dispensers, and filtered faucets under the Elkay and Halsey Taylor brand names; filtered units including water filters; and water safety and control products, such as backflow preventers, fire system valves, pressure reducing valves, thermostatic mixing valves, PEX pipings, fittings, and installation tools under the Zurn and Wilkins brand names. The company also provides flow systems products comprising point drains, hydrants, fixture carrier systems, and chemical drainage systems; and oil and grease interceptors and separators, acid neutralization systems, and remote monitoring systems under the Zurn, Green Turtle, and Wade brands. In addition, it offers sensor-operated flush valves under the AquaSense, Aquaflush, and AquaVantage brands; heavy-duty commercial faucets under the AquaSpec brand; flush valves and faucets under the Hydro X Power brand name; water conserving fixtures under the EcoVantage and Zurn One brands; stainless steel, quartz, fireclay-ceramic, and cast iron sinks under the Elkay brand name; stainless steel sinks and plumbing fixtures under the Just brand; restroom partition systems and lockers under the Hadrian brand name; and hand dryers. The company offers its products to institutional, commercial, waterworks, and residential end markets through independent sales representatives, plumbing wholesalers, and industry-specific distributors in the waterworks, foodservice, industrial, janitorial, sanitation, and sitework industries. The company was formerly known as Zurn Water Solutions Corporation and changed its name to Zurn Elkay Water Solutions Corporation in July 2022. Zurn Elkay Water Solutions Corporation was founded in 1891 and is based in Milwaukee, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1754920800000/x32vOwMRlVxXmv7peWb3RA/P_PUuIGv1RZcNGxxjRstvzWN1rK9zhdgr1sZZCj3DwB4hAfwh0WcBQZWf5wXYhU318U1PmIgy2EExn2aqQdbXoyGduGnw2JhSWRHoPp3XJON3wghy1Wiv7MDrXu3-nVd9Fg0roOA81bXceDy-L5ImdioJPuJwxdc1npOVWrLp7TmEbEFSer_RG8ZtLY5l6AE/3BjdZW-GT9_Aaph0CVgzdBcOubV_n-poHAcVzix6bvI",
    "price": 44.16,
    "prevClose": 44.55,
    "absReturn": -0.39000000000000057
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 637.18,
    "prevClose": 632.25,
    "absReturn": 4.92999999999995
  }
]