[
  {
    "fullTicker": "AVA:USA",
    "baseTicker": "AVA",
    "rank": 35.9591,
    "description": "Avista Corporation, together with its subsidiaries, operates as an electric and natural gas utility company in the United States. It operates through two segments, Avista Utilities and Alaska Electric Light and Power Company (AEL&P). The Avista Utilities segment provides electric distribution and transmission, and natural gas distribution and transmission services in parts of eastern Washington and northern Idaho; and natural gas distribution services in parts of northeastern and southwestern Oregon, as well as generates electricity in Washington, Idaho, Oregon, and Montana. This segment also engages in the supply of electricity to customers in Montana; and wholesale purchase and sale of electricity and natural gas. The AEL&P segment offers electric services in Juneau, Alaska. The company generates electricity through hydroelectric, thermal, wind, and solar generation facilities. As of December 31, 2024, it supplied retail electric services to approximately 422,000 customers; retail natural gas services to approximately 383,000 customers; and electrical energy to approximately 17,800 customers. The company also operated five hydroelectric generation facilities with a capacity of 102.7 MW; and four diesel generating facilities with a capacity of 107.5 MW. In addition, it engages in venture fund investments, real estate investments, and other investments. The company was formerly known as Washington Water Power and changed its name to Avista Corporation in January 1999. Avista Corporation was incorporated in 1889 and is headquartered in Spokane, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/HoODGjoUGaG459xjgn0F6g/Gn-qY2LZ9a3u3NTQaFBNbV49WpYA1Yk7jV7Zf4NrKYRnQWPV3Gb3DNIL2k5T9bxfJh1LJ-SDpzCaMM0VUmIQUFpAOE1kHe2PDxxbep8P--wt3m8UnM0dx44vjknApk74wsjHpV5AIWGCKB1CbaJ8b0lcF6jXJZ92vLCR299DJAM/mjCqN7g_oGeOWhDdLnCCrliOizzeWFitaiMmkDjr_2w",
    "price": 36.97,
    "prevClose": 36.72,
    "absReturn": 0.25
  },
  {
    "fullTicker": "IFF:USA",
    "baseTicker": "IFF",
    "rank": 38.7212,
    "description": "International Flavors & Fragrances Inc., together with its subsidiaries, manufactures and markets food, beverage, health and biosciences, scent, pharma solutions, and complementary adjacent products in the United States, Europe, and internationally. It operates in four segments Nourish, Health & Biosciences, Scent, and Pharma Solutions. The Nourish segment consists of portfolio of natural-based ingredients that includes plant-based specialty food ingredients, such as soy and pea protein with value-added formulations, emulsifiers, and sweeteners; food protection ingredients, including natural antioxidants, and anti-microbials for natural food preservation and shelf-life extension; savory solutions, such as spices, marinades, and mixtures; combining flavourings with fruits, vegetables, and other natural ingredients products; a range of flavor compounds used in savory products, such as soups, sauces, meat, fish, poultry, and snacks; and beverages juice drinks, carbonated or flavored beverages, and spirits, as well as sweets bakery products, candy, cereal, and chewing gum; and dairy products, such as yogurt, ice cream, and cheese, as well as spices and seasoning ingredients. Its Health & Biosciences is comprised of health, cultures and food enzymes, home and personal care, animal nutrition, and grain processing. The Scent segment creates fragrance compounds, and fragrance ingredients. Its Pharma Solutions segment produces cellulosics and seaweed-based pharmaceutical excipients. The company was incorporated in 1909 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/QvsAdsJA0CBeCwedmbbRTA/37RMLEGYA92aJImh_9WtG-Amyrgp6eghpUkkPS4bVFRHHxLafA84WPn-gbXHYHRpgrYj0v4M1cBmUEaECtMQyEcT4DkBo4q3dBTNOsqBwW1GCtjptSpaIcb8dA5yRFUQjEedg6-ZeSFWFicQdCulw69bSPcXvSelNFe0sBNY8JN5NqWWiLCkfj1Vdneef19LeLuEFVA5MicqMNAnnxoReQ/VaqHdBcWgEFOl1md1LOXAiNg3Zn0jWnpgxZUQCDZYLQ",
    "price": 62.18,
    "prevClose": 61.51,
    "absReturn": 0.6700000000000017
  },
  {
    "fullTicker": "WBTN:USA",
    "baseTicker": "WBTN",
    "rank": 43.9386,
    "description": "WEBTOON Entertainment Inc. operates a storytelling platform in the United States, Korea, Japan, and internationally. Its platform allows a community of creators and users to discover, create, and share new content. The company's platform offers stories primarily in two ways, including web-comics, a graphical comic-like medium; and web-novels, which are text-based stories. It also provides hosting services for web-comics through web and mobile applications. The company was founded in 2005 and is headquartered in Los Angeles, California. WEBTOON Entertainment Inc. is a subsidiary of NAVER Corporation.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/EU7D1U6vPtN7S6tkq9MRBg/YvDxi6kgw7FTU-Wk_HkCWY2BCQYw7u-1Lk-E_k-VVpbXEjTcKItLH2xcoQ2tsUn2Ta_pb30-7YocHVt2yhYJ8Wp481Z8aoZCXW0Wg4EO8r6m-J_52lPPCwNvD_j6pwbqYG37mnQKfKeB9d2MiyJaMATkTOMFKSglQx475j5BEoB2DLs1wuEOxZr7KFKUBLIo/EtJs_7kHMqwzsv4vNp8HuwQmJVJZdZkv16t-WSjr_N4",
    "price": 18.02,
    "prevClose": 17.78,
    "absReturn": 0.23999999999999844
  },
  {
    "fullTicker": "RMTI:USA",
    "baseTicker": "RMTI",
    "rank": 54.1347,
    "description": "Rockwell Medical, Inc., together with its subsidiaries, operates as a healthcare company that engages in the development, manufacture, commercialization, and distribution of various hemodialysis products for dialysis providers worldwide. Also, the company manufactures, sells, delivers, and distributes hemodialysis concentrates, such as CitraPure citric acid concentrate, Dri-Sate dry acid concentrate, RenalPure liquid acid concentrate, dry acid concentrate mixer, and RenalPure and SteriLyte powder bicarbonate concentrate; and ancillary products, including testing supplies, 5% acetic acid cleaning solution, 5% and 2% citric acid descaler, filtration salts, and other items used by hemodialysis providers. The company's hemodialysis concentrate products are used to sustain patient's life by removing toxins and balancing electrolytes in a dialysis patient's bloodstream. The company serves to hemodialysis clinics. Rockwell Medical, Inc. was formerly known as Rockwell Medical Technologies, Inc. and changed its name to Rockwell Medical, Inc. in June 2012. Rockwell Medical, Inc. was incorporated in 1996 and is headquartered in Wixom, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/tVjp0uziQ-gW6rJxaU4O1w/_eaGeAHQkHOBuHmCBd7FNce--4saG8ls7-jRmBrXUSbITr8JS8P9vKHjK5TnL9wP5E3utE_bi6e6_WTw0stg4n2dMBAoe_Bm6AzFowVcCHXk6QvtX1twDKvVZKU-Mg1zOEhHQGh8dCRuVHFNaa3mArd8Px_Ft_qaxhLM-sp_eNFoJW_5nVPC6V8__S6jk_Hl/sNkINo-SCoxClKJEARmM2jyaczjT3nycNgPJUFUYuLY",
    "price": 1.22,
    "prevClose": 1.21,
    "absReturn": 0.010000000000000009
  },
  {
    "fullTicker": "ARCO:USA",
    "baseTicker": "ARCO",
    "rank": 60.8525,
    "description": "Arcos Dorados Holdings Inc. operates as a franchisee of McDonald's restaurants. It has the exclusive right to own, operate, and grant franchises of McDonald's restaurants in 20 countries and territories in Latin America and the Caribbean, including Argentina, Aruba, Brazil, Chile, Colombia, Costa Rica, Curacao, Ecuador, French Guiana, Guadeloupe, Martinique, Mexico, Panama, Peru, Puerto Rico, Trinidad and Tobago, Uruguay, the U.S. Virgin Islands of St. Croix and St. Thomas, and Venezuela. The company was founded in 2007 and is based in Montevideo, Uruguay.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/mE6_84DCuk6zQy8MqpTsEw/zFTiYeRZbGPdr7bXK_JCGtb6PjMwl_07htkho06BE61o4E8abJP4u16dh_E9suz_PYe1B00_Xw2NaZsZFQMsN_Z2mvwJgnTgymywPKT2lW5fwmDLsGhHz5-PWQzIePpCfTSvpoN4-lCiY91C1i8sDEaFG6IqpRvlG2DW9M-YD_MtSVbZKb76oZqKcUrf7V75/VY6VOc9cIiv4HENy3vOmft_lLlGRYJOmUSgDoeriDUg",
    "price": 6.64,
    "prevClose": 6.66,
    "absReturn": -0.020000000000000462
  },
  {
    "fullTicker": "SOAR:USA",
    "baseTicker": "SOAR",
    "rank": 64.9616,
    "description": "Volato Group, Inc. operates as a private aviation company. It offers fractional ownership, aircraft management, jet cards, deposit, and charter programs. As of December 31, 2023, the company operated a fleet of 24 HondaJets and a managed fleet of 6 aircraft. Volato Group, Inc. was founded in 2021 and is based in Chamblee, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/04n8QjlMgrVDaClJEdmMzw/NIaTKYdAN9N2VBvGp7a5q3U2QE1tgQdaEFZ7aJL3k3zmHwVFpdTInBoXnXP8cO13l4bVEWu9e_1g5jDZ4e5g19OLCbtLerkvcLH0Xyvnll1a47j7LF_nsEWFE-kVhEhbtIY9jk3kBWXFXmDPZVIyp7EswIoP7WzD9lzzJ_cxYMlgnnFMZicKQMo4yhFCPF91/5bYNu7hRFzQ66ZZDfJHnJETppIl-qGBGb3Al0CzDG0k",
    "price": 2.04,
    "prevClose": 1.83,
    "absReturn": 0.20999999999999996
  },
  {
    "fullTicker": "REZI:USA",
    "baseTicker": "REZI",
    "rank": 76.1296,
    "description": "Resideo Technologies, Inc. develops, manufactures, sells, and distributes comfort, energy management, and safety and security solutions in the United States, Europe, and internationally. The company operates in two segments, Products and Solutions, and ADI Global Distribution. The Products and Solutions segment offers temperature and humidity control, water and air solutions, smoke and carbon monoxide detection home safety products, residential and small business security products, video cameras, other home-related lifestyle convenience solutions, cloud infrastructure, installation and maintenance tools, and related software products under the Honeywell Home, First Alert, Resideo, Braukmann, and BRK brand names. The ADI Global Distribution segment distributes low-voltage products, including security, fire, and access control; and participates in the broader related markets of smart home, residential audio-visual, professional audio-visual, power management, networking, data communications, wire and cable, enterprise connectivity, and structured wiring products. The company sells its products and services through a network of professional contractors, installers and integrators, distributors, and original equipment manufacturers, as well as retailers and online merchants. Resideo Technologies, Inc. was incorporated in 2018 and is headquartered in Scottsdale, Arizona.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/hoIzmQ2SBtwzyMpUpP8NLA/n9A06jD6lUPjLo3-OAbCLNcHBo0qni6yRnpGubEeNc532Ss_TbMj5y1mgv6IasElFawYJ-w2YWkVpbQfKgJvLADuJjnJbiOYuyNqc_QoJ5nMdKg8953lbrxte7hi1xgGv5cxKgBbGZWxTY30E5QUoUSNvmxN9nsC2g8JKT6su65mlRBuFFcnIIS5nDZio8Vb/2naIRadVOPmpAIlQbRyXhIG5vZ-ebHFOqixnKFFKjBc",
    "price": 43.11,
    "prevClose": 43.12,
    "absReturn": -0.00999999999999801
  },
  {
    "fullTicker": "EBS:USA",
    "baseTicker": "EBS",
    "rank": 78.7724,
    "description": "Emergent BioSolutions Inc., a life sciences company, provides preparedness and response solutions for accidental, deliberate, and naturally occurring public health threats in the United States. The company offers NARCAN Nasal Spray for the emergency treatment of known or suspected opioid overdose; Vaxchora vaccine for the prevention of cholera; Vivotif vaccine for oral administration for the prevention of typhoid fever; Anthrasil for the treatment of inhalational anthrax; BioThrax, an anthrax vaccine; CYFENDUS for post-exposure prophylaxis of disease following suspected or confirmed exposure to Bacillus anthracis; and Raxibacumab injection for the treatment and prophylaxis of inhalational anthrax. It provides ACAM2000, a smallpox vaccine; CNJ-016 to address complications from smallpox vaccination; TEMBEXA for the treatment of smallpox disease caused by variola virus in adult and pediatric patients; Botulism Antitoxin Heptavalent for the treatment of symptomatic botulism; Ebanga for the treatment of Ebola; Trobigard, an atropine sulfate obidoxime chloride auto-injector. In addition, the company is developing EBS-LASV to prevent Lassa fever; EBS-MARV to prevent Marburg virus disease; EBS-SUDV to prevent Sudan virus disease; Pan-Ebola mAbs for the treatment of ebola virus; and WEVEE-VLP for equine encephalitis virus infections. Further, it provides contract development and manufacturing services comprising drug substance and product manufacturing, and packaging, as well as technology transfer, process, and analytical development services. The company was incorporated in 1998 and is headquartered in Gaithersburg, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/uiROVrIjg0qzPCqGLSnLiA/Udg2tEGoNNMRgBCo2GdO2_fSxeSkZCgfQsOyEvPA1cQlsl9XZ7R_6qdJfYxKO_IodkIM4On4t8jA7iqOFxhY8ivOkbFCAdEDzhV5TKa5-L8S_Se2JwOimndwLee-GKMtk3YvzaHjTgqLfltekMWppRy96WBjqrex8RCThkVUUmXNVwhRGdWxxzBhm-CMG4uc/WBBnZn7_zsh4wDaKEU9Rqv_a6WyZ9lsGix0_rL0EOPs",
    "price": 9.15,
    "prevClose": 9.19,
    "absReturn": -0.03999999999999915
  },
  {
    "fullTicker": "SBC:USA",
    "baseTicker": "SBC",
    "rank": 87.7749,
    "description": "SBC Medical Group Holdings Incorporated provides management services to cosmetic treatment centers in Japan, Vietnam, the United States, and internationally. The company offers advertising and marketing services; staff management services, such as recruitment and training; booking reservations for franchisee clinic customers; assistance with franchisee employee housing rentals and facility rentals; construction and design of franchisee clinics; medical equipment; and medical consumables procurement. It provides IT software solutions; breast augmentation, liposuction, and rejuvenation treatments, including treatment of wrinkles, acne, scars, cellulite, excess fat, discoloration, and signs of aging; laser skin toning and spot removal; eyes double fold surgery; rhinoplasty; treatment of osmidrosis and hyperhidrosis; hair transplants; gynecological formation treatments; laser hair removal; face line surgeries; cosmetical dental procedures; tattoo removal; lasik eye surgery; lateral canthoplasty; brow lift procedures; androgenetic alopecia treatment; and cheek sagging prevention methods. The company was founded in 2000 and is headquartered in Irvine, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759759200000/AdHSOyTt7DhBJaI4qypkCg/NaVEbsITdPyZOXdxMkpI_x-kOVRC4bVIkpG662g4VU4Xk27L3J2UO2sl-8U5uWH_h8-7mveY50YfSWX4jO138jhcgk2bOmm9Qs8XtfWGYneGjItBDr9khnx6G-g8IpItotn2znGIgO5XyPp4H3l154X9MT9WYVh9W118yvlE337PWgKJBQ5B-_W2JSNdzLlZy7BJ2euHjnzyZWkbhSNFpg/1ufb7wQnARK3aSdrkw7Y5bKO362gFhfGr3uPJz01708",
    "price": 4.23,
    "prevClose": 4.23,
    "absReturn": 0
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 669.21,
    "prevClose": 669.22,
    "absReturn": -0.009999999999990905
  }
]