[
  {
    "fullTicker": "CSAI:USA",
    "baseTicker": "CSAI",
    "rank": 6.3188,
    "description": "Cloudastructure Inc. provides cloud-based video surveillance, storage, analytics, and monitoring products in the United States. The company offers AI surveillance, remote guarding, and mobile surveillance related services. It also offers smart parking solutions. The company was formerly known as Connexed Technologies Inc. and changed its name to Cloudastructure Inc. in September 2016. Cloudastructure Inc. was incorporated in 2003 and is based in Palo Alto, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/W34-kUcghYQ5HTGni908xQ/Uq8vP4HB376ZED_qGfQt0tWgeHiZrFz280KfLICSubllE1ply0sX6sanbr1Ty-hRgEniinrg3x9wKyPtNundRlkHpIrBuazERBXjzkG5sCOAB-WdHCxrDa0p43kNE7BXP9yK5JJ50SxrBn9UCFL-G5Q5qFSAdIbtNfmOzgAKFuWnXJq8UK6ifKLaAy-Qb_qq/npBLCeyZzsa3yoFE_sw6OWQ-_lUYQSVMC5s2pFSKfio",
    "price": 1.78,
    "prevClose": 2.03,
    "absReturn": -0.24999999999999978
  },
  {
    "fullTicker": "ZURA:USA",
    "baseTicker": "ZURA",
    "rank": 12.2874,
    "description": "Zura Bio Limited, a clinical-stage biotechnology company, focuses on developing novel medicines for immune and inflammatory disorders. It develops Tibulizumab, an IgG-scFv bispecific dual-antagonist antibody engineered by the fusion of ixekizumab and tabalumab that neutralizes IL-17A and BAFF, which is in Phase 2 clinical trial development; ZB-168, a monoclonal antibody that binds and neutralizes the IL-7 receptor chain that impact on diseases driven by IL7 and thymic stromal lymphopoietin immune pathways; and Torudokimab, a monoclonal antibody that neutralizes IL33, which is in Phase 2 clinical trial development. The company is based in Henderson, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/lVHzbYE43iGoL8y3jN3KXw/Q8IjWKbB6pv5UbYZzy9XnhzTqAiaIc7q5k7lsyg241auKpwxYNpZpUA-k4IxAd00UzGk1LMMM13byxpxXgpduRb1_feiyVM0xuTz6btqPSnMPw9E3fYeZHm7yMrSGezGlFLo6OqCLGfoMlqej-mpcCoJC0Wm17d5Fq4zlHbNQoJGHmNQRZpgqftWPzgyR_9u/MappuHuGYjemWlGxk6Xnx906KSx7eypHiCDJY-RFRt4",
    "price": 1.31,
    "prevClose": 1.39,
    "absReturn": -0.07999999999999985
  },
  {
    "fullTicker": "AAP:USA",
    "baseTicker": "AAP",
    "rank": 14.4715,
    "description": "Advance Auto Parts, Inc. engages in the provision of automotive aftermarket parts in the United States and internationally. The company offers batteries and battery accessories; belts and hoses; brakes and brake pads; chassis parts; climate control parts; clutches and drive shafts; engines and engine parts; exhaust systems and parts; hub assemblies; ignition components and wire; radiators and cooling parts; starters and alternators; and steering and alignment parts. It also provides air conditioning chemicals and accessories; air fresheners; antifreeze and washer fluid; electrical wire and fuses; electronics; floor mats, seat covers and interior accessories; hand and specialty tools; lighting; performance parts; sealants, adhesives and compounds; tire repair accessories; vent shades, mirrors and exterior accessories; washes, waxes and cleaning supplies; and wiper blades. In addition, the company offers air filters; fuel and oil additives; fuel filters; grease and lubricants; motor oil; oil filters; part cleaners and treatments; and transmission fluid. Further, it provides battery and wiper installation; engine light scanning and checking; electrical system testing, including batteries, starters, and alternators; oil and battery recycling; and loaner tool program services. The company serves professional installers and do-it-yourself customers. It operates stores under the Advance Auto Parts and Carquest names. The company has stores in the United States, Puerto Rico, the U.S. Virgin Islands, and Canada; and independently owned Carquest branded stores in Mexico and the Caribbean Islands. Advance Auto Parts, Inc. was founded in 1929 and is based in Raleigh, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/uZuFB9G2LT7CyzJ7E9-CNw/bCI214Ixlof9GwvP0dh9ukP_QViD_9E1rkhSMBjs1q93yH8oNnEKbeT8iPHXT72N98Bwf73X9OJM7PXvrGs1jj5xT6iNAl7BskjVpc_xOausiyWWoQUNUKzaU3voWq13zlDi9qmxAOCoc9VZcTfUXWWPDkDUzfPFLGwRHv9OVGiaFM7_fsa8CW436F9maIEU/WC7N9_HBWGZtz9bCQREkG11s0hqx7iKUXbV1-boo2-I",
    "price": 62.56,
    "prevClose": 59.3627766279255,
    "absReturn": 3.197223372074504
  },
  {
    "fullTicker": "NVVE:USA",
    "baseTicker": "NVVE",
    "rank": 24.2914,
    "description": "Nuvve Holding Corp., a green energy technology company, provides commercial vehicle-to-grid (V2G) technology platform in the United States, the United Kingdom, France, Japan, and Denmark. The company offers Grid Integrated Vehicle platform which enables electric vehicle (EV) batteries to store and resell unused energy back to the local electric grid and provide other grid services; and allows EV owners to meet the energy demands of individual vehicles and entire fleets. Its V2G technology also links EV batteries into a virtual power plant that sells excess power to utility companies or utilizes saved power to reduce building energy peak consumption. In addition, the company offers networked charging stations, infrastructure, software, professional services, support, monitoring, and parts and labor warranties required to run electric vehicle fleets. It serves its products to owner/operators of light duty fleets, heavy duty fleets, automotive manufacturers, charge point operators, and strategic partners. The company was founded in 2010 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/PCpV3al5e4zQ4o9Xp8HORw/ELKcGEv8jCf0xQ-V6LfyIqahOcUwOVWDVx16su_sK6nxkX_ovYCHUVPHWardbp-RTEr-ry0x_HWq312OKU02fgd6gc0wtsTq_BFg7ocF6shiEaTzCIfRaSRi8QkZYB0QawUovkUh_KVRx5dJsQQA_fQjC20RiOWvfd-uQdhUN83IwBAVzwBCIiSyU41Gpgnd/Ax_72Xt-wAzYXc67yLi7acg4sLvzzhc23ty2h5-mb8g",
    "price": 0.9334,
    "prevClose": 1.09,
    "absReturn": -0.15660000000000007
  },
  {
    "fullTicker": "SXI:USA",
    "baseTicker": "SXI",
    "rank": 37.6959,
    "description": "Standex International Corporation, together with subsidiaries, engages in the manufacture and sale of various products and services for commercial and industrial markets in the United States and internationally. It operates through five segments: Electronics, Engraving, Scientific, Engineering Technologies, and Specialty Solutions. The Electronics segment offers reed relays, fluid level, proximity, motion, flow, HVAC condensate, and custom electronics sensors; and custom wound transformers and inductors for low and high frequency, current sense technology, advanced planar transformer technology, value added assembly, and mechanical packaging applications under the Standex Electronics, Renco, and Agile Magnetics. The Engraving segment provides mold texturizing, slush molding tools, roll engraving, hygiene product tooling, and low observation vents, as well as project management and design services for stealth aircraft; and process machinery for various industries under the Piazza Rosa, World Client Services, Tenibac-Graphion, GS Engineering, and Innovent brand names. The Scientific segment offers temperature-controlled equipment for the medical, scientific, pharmaceutical, biotech, and industrial markets under the American BioTech Supply, Lab Research Products, Corepoint, Cryosafe, CryoGuard, and Scientific brands. The Engineering Technologies segment offers net and near net formed single-source customized solutions that are used in the manufacture of engineered components for the aviation, aerospace, defense, energy, industrial, medical, marine, oil and gas, and manned and unmanned space markets under the Spincraft brand. The Specialty Solutions segment manufactures and sells refrigerated, heated, and dry merchandizing display cases; and single and double acting telescopic, and piston rod hydraulic cylinders under the Federal and Custom Hoist brands. The company was founded in 1955 and is headquartered in Salem, New Hampshire.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/9c521SM2HvPs38nwqgcIzw/h7lTkeh-8FbhN_-gSPgx7bbT2Dtovs8TAz-aNPliChlsAOnh6pNqYPfFEx7x3-VQYAkBYO5DySwIxN26pznLRptgPCUEYdKaqEeCjw9HFonlIVlCkzm9LQ4ha7gGgIkOr645o8dtIU7fs03fLufv67eFBF1Bioaz47oiy2zNQFha0nnwrZuWcKjGZxk-UJMU/Ny3kQXY9ocwZJ9bt9K5JJKdDw4bHnWbq2M78Cjp-KFI",
    "price": 163.29,
    "prevClose": 166.64,
    "absReturn": -3.3499999999999943
  },
  {
    "fullTicker": "UPXI:USA",
    "baseTicker": "UPXI",
    "rank": 40.7469,
    "description": "Upexi, Inc., a brand owner, engages in the development, manufacturing, and distribution of consumer products in pet, surgery, recovery, skin, beauty, health, and wellness markets. It sells its products through direct-to-consumer network, wholesale partnerships, and major third-party platform. The company was formerly known as Grove, Inc. and changed its name to Upexi, Inc. in August 2022. The company was incorporated in 2018 and is headquartered in Tampa, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/n5_RD77CMymsKSAw8pZVBA/qXdWBimn_lMFykuNx8bG2GA016AuV_2TYu_V5D7M1VxVYfHfFAGXDmRX0nB9RdXpFVdPrKBshkZFksGB6KbZKZ7jObNLvR6ecpo3lJP4GbpuRyiWBOexYoSr7ilU_2ko4KQne-dAUwd6muIcxUlEvUdj2uXvpySTlshyOciHIvA/Su3Gi_XH1zY4ts2zGaM0Z_nEB8nQ2Vj4Sa4VxLFMhbU",
    "price": 5.39,
    "prevClose": 5,
    "absReturn": 0.3899999999999997
  },
  {
    "fullTicker": "UFG:USA",
    "baseTicker": "UFG",
    "rank": 58.086,
    "description": "Uni-Fuels Holdings Limited engages in the marketing, reselling, and brokerage of marine fuels products in Singapore. It offers very low sulfur fuel, high sulfur fuel, and marine gas oils to shipping companies operating in market sectors, such as bulk carriers, tanker vessels, offshore support vessels, container ships, general cargo vessels, tugs and barges, car carriers, cruise liners, yachts, and dredging vessels. The company was founded in 2021 and is headquartered in Singapore. Uni-Fuels Holdings Limited is a subsidiary of Garden City Private Capital Limited.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/eNbXE37uR0qZullyNiCkfA/hJI_Gu55tuQpyjao4gzUW0yrvorpL1CWHVoh8XiiaSWQujfneAjY2TUIOkPI_rErrIXI2qjt2zLVV8Dea57COb1TgWCuF796YKezRXBbdV_Tiu5mEzddZ66sIY8PrQO4y9RxiX96Rap2wZONbbR8Fjl1_pk7rB6ylh1KTKk4pMmEz78EYL0TI2GjnTS58i4K/edPAhhv3gC3UFKdCzE7GdgDW3Eu_cwiKC5Xjt-HItSo",
    "price": 2.24,
    "prevClose": 2.26,
    "absReturn": -0.019999999999999574
  },
  {
    "fullTicker": "AXL:USA",
    "baseTicker": "AXL",
    "rank": 67.7726,
    "description": "American Axle & Manufacturing Holdings, Inc., together with its subsidiaries, designs, engineers, and manufactures driveline and metal forming technologies that supports electric, hybrid, and internal combustion vehicles. It operates through two segments, Driveline and Metal Forming segments. The Driveline segment offers front and rear axles, driveshafts, differential assemblies, clutch modules, balance shaft systems, disconnecting driveline technology, and electric and hybrid driveline products and systems for light trucks, sport utility vehicles, crossover vehicles, passenger cars, and commercial vehicles. The Metal Forming segment provides range of products, such as engine, transmission, driveline, and safety-critical components for traditional internal combustion engine and electric vehicle architectures, including light vehicles, commercial vehicles, and off-highway vehicles, as well as products for industrial markets. It operates in North America, Asia, Europe, and South America. The company was founded in 1994 and is headquartered in Detroit, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/jMO1lK8vkmv6K3eIPm77Yg/7lMspGKVnqQ5S8JKLbfs-ZSFIHkTxagb50OGclKCOAopMxJiCCY_pbzELL9C2jUydUL0t_O8AhH6meRv1N2ZTnGWkgyFPdf9lOPyLCZgOBWEEKGdsA9r9k0gcfTLvNNIzSYDNMkolImz701QB_vSd-6v2s36CtNEhFXyCK5Sjp45lvvP0ucYPJWnqvFIocrzCjsnrJakgpTy_dgc6_dN-A/paHhh9rkj9OdlXqFQCKIZ10WbatNFabYs6zI8R7T-dM",
    "price": 4.41,
    "prevClose": 4.46,
    "absReturn": -0.04999999999999982
  },
  {
    "fullTicker": "SYY:USA",
    "baseTicker": "SYY",
    "rank": 78.9597,
    "description": "Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/cpMqU_4ZkYtz0A3_2x8x9Q/D72PZM9qlIx7buBtMwAkKw5RahyKN_w8yfjPR0oDtpEeGULXqRM_4rSiIV3SYFZjDWXF2mfGVF_UDJDVWWNRGmfw26lohU2dmDg_T7vJqAA0flsDeLCvCgiQ3q6yNCYl0cFgOKFMtZj0CXgtLlyKlPqpWE07mk48--dQkOUiwiU/fqdRl4OG7DbpMeCsEKL1CKvW_pLx5pAQ9L-BEt9LepY",
    "price": 76.84,
    "prevClose": 77.46,
    "absReturn": -0.6199999999999903
  },
  {
    "fullTicker": "RCMT:USA",
    "baseTicker": "RCMT",
    "rank": 99.2831,
    "description": "RCM Technologies, Inc. provides business and technology solutions in the United States, Canada, Puerto Rico, and Europe. It operates through three segments: Engineering, Specialty Health Care, and Life Sciences and Information Technology. The Engineering segment offers a range of engineering services, including project management engineering and design, engineering analysis, engineer-procure-construct, configuration management, hardware/software validation and verification, quality assurance, technical writing and publications, manufacturing process planning and improvement, and 3D/BIM integrated design. The Specialty Health Care segment provides long-term and short-term staffing, executive search, international recruitment, and placement services in the fields of allied and therapy staffing, correctional healthcare staffing, health information management, nursing services, physician and advanced practice, school staffing and recruitment, and telepractice. The Life Sciences and Information Technology segment offers enterprise business solutions, application services, IT infrastructure solutions, life sciences solutions, and other vertical market specific solutions; and data solutions, digitization, recruiting process outsourcing, human capital management solutions, workforce management, and consulting services. The company serves aerospace and defense, energy, financial services, health care, life sciences, manufacturing and distribution, and technology industries, as well as educational institutions and the public sector. RCM Technologies, Inc. was founded in 1971 and is based in Pennsauken, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752336000000/g1aTOoHZbUAkWaRKGEbb5A/2qC6lhvX9ZEnXr0JS4VGyTaIMcESMTdVECyNJ7b0XLiuRFP5zEoz9UwyxQMZ67O-xwcpVtPeWS63J0JVIPKc93MiUXdrf_X4BjOBuzGtdcWA1y7noimjOMrsM0rrO_moXgAhg13taVY3s2DRuHGzJBhd5vxfH9oQnlFwnnJP83TdeG76WAsHAOTCiTt84CAd/d_2uToTzMjAzvxWqwkWy1p_yQEbM26BHduLKgIVN1RM",
    "price": 24.6,
    "prevClose": 25.04,
    "absReturn": -0.4399999999999977
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 623.62,
    "prevClose": 625.82,
    "absReturn": -2.2000000000000455
  }
]