[
  {
    "fullTicker": "AVBP:USA",
    "baseTicker": "AVBP",
    "rank": 3.5778,
    "description": "ArriVent BioPharma, Inc., a clinical-stage biopharmaceutical company, engages in the identification, development, and commercialization of medicines for the unmet medical needs of patients with cancers. The company's lead development candidate is firmonertinib, a tyrosine kinase inhibitor that is being evaluated in multiple clinical trials across a range of epidermal growth factor receptor mutations (EGFRm) in non-small cell lung cancer (NSCLC), including a Phase 3 clinical trial for treatment of patients with advanced or metastatic EGFRm NSCLC with exon 20 insertion mutations, as well as Phase 1b clinical trials to treat NSCLC patients with activating EGFRm, including P-loop and-alpha-c-helix compressing (PACC) mutations, and classical EGFRm NSCLC patients. It is also developing ARR-217, an antibody drug conjugate (ADC) for the treatment of gastrointestinal cancers; and ARR-002 for solid tumors. The company has strategic collaborations with Aarvik Therapeutics Inc., Shanghai Allist Pharmaceuticals Co., Ltd., Beijing InnoCare Pharma Tech Co., Ltd., Jiangsu Alphamab Biopharmaceuticals Co., Ltd., and Lepu Biopharma Co. Ltd. ArriVent BioPharma, Inc. was incorporated in 2021 and is based in Newtown Square, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/l5_-vpFVkYCpuAuAY9VhAg/-l6X1xgnNbtleKOWqx5l7Qv_aTHWiDps4AeuSZlIWHs6PtuY5EMraorlz55Jb7fEsrgmSWypvikeB98U20CUHGns9-hrt9vuouLjCLrLzwlmFDweMXrS6X2-NV765lVWCQKkvqAvJzzDRUVULh8I9Y2waD8siJF-1_4SvIO8KMBStzctn5O-xb3jVkUMb73m/F1Kth1stAfbujUcL8z-pYLc07g2FyoPwnXG-JpmZ3fI",
    "price": 19.625,
    "prevClose": 18.93,
    "absReturn": 0.6950000000000003
  },
  {
    "fullTicker": "RLAY:USA",
    "baseTicker": "RLAY",
    "rank": 10.1155,
    "description": "Relay Therapeutics, Inc. operates as a clinical-stage precision medicines company. It engages in transforming the drug discovery process with an initial focus on enhancing small molecule therapeutic discovery in targeted oncology and genetic disease indications. The company's lead product candidates include RLY-2608, a pan-mutant and isoform-selective phosphoinostide 3 kinase alpha, or PI3Ka, inhibitor which is in clinical development for the treatment of breast cancer, solid tumor, and vascular malformations; and aGal chaperone for Fabry diseases. It also develops RLY-8161, an oncogene driver that belongs to the RAS family of signaling proteins for NRAS-mutated solid tumors; RLY-1013, an oral, potent, selective, bifunctional protein degrader of estrogen receptor alpha; RLY-2139, an oral, small molecule, potent, and selective inhibitor of Cyclin-dependent kinases (CDK2) that spares other CDKs. In addition, the company develops lirafugratinib (RLY-4008), a receptor tyrosine kinase for the treatment of cancer. Further, it has collaboration and license agreements with D. E. Shaw Research, LLC to research certain biological targets through the use of D. E. Shaw Research computational modeling capabilities focused on analysis of protein motion to develop and commercialize compounds and products directed to such targets; Elevar Therapeutics, Inc. for the development and commercialization of RLY-4008; and Pfizer for the development of RLY-2608. The company was formerly known as Allostery, Inc. and changed its name to Relay Therapeutics, Inc. in December 2015. Relay Therapeutics, Inc. was incorporated in 2015 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/oNPwLOzvwEV5j7TXFINsSQ/u6rq6v21n6bzpzuXlOHHWTIhOfbPAXSsLlzAm-uDV2sIiLzrrq8kJwhp5iLGY4hfthYuRoT2b0iVXIjKLKCbUZ4zfsNFIqOFXw7POZGzlkcRALShKtNV_nW2Os5folymne4Cpl1k3vR8AnSu5gYQPI6oT-k9ZTfe6C4EVRb3L05SgrOWGyV8XpjP9ZNbdDeC/fPILzXgYJOCCP-j2cqieo-M9vWPFu_ExWyZKw9aNqa4",
    "price": 8.465,
    "prevClose": 8.17,
    "absReturn": 0.29499999999999993
  },
  {
    "fullTicker": "CNVS:USA",
    "baseTicker": "CNVS",
    "rank": 15.4822,
    "description": "Cineverse Corp. operates as a streaming technology and entertainment company. It owns and operates streaming channels, through its proprietary technology platform. The company also delivers curated content through subscription video on demand (SVOD), dedicated ad-supported (AVOD), and ad-supported streaming linear (FAST) channels, as well as social video streaming services and audio podcasts; operates OTT streaming entertainment channels. It entertains consumers worldwide by providing feature film and television programs, enthusiast streaming channels, and technology services. The company was formerly known as Cinedigm Corp. and changed its name to Cineverse Corp. in May 2023. Cineverse Corp. was incorporated in 2000 and is based in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/8mQAfG2vpfmcjA3T2Eefjg/Rg8cGXb2smQ-xGqjH-aRlynsji0qHdJUWdCNd7pyxJ6Jk0ZP_s3806QFWO28W_1ifQHe2XkqS9ENxSioNSOkD4CU7ljHDBaDNI86a8JorhvCCuDHQzag7Or-3Ab1_aI5hnZCMdSgRM_r5GCQeGcArNzrVes9oIjGfqfxXLuHa8K9oYJP7NhiCOl19H_q2kl4/-KXCGCGg2kEN78FcpTT9NaOEOwoCb73SkTncXCKy4Bw",
    "price": 2.14,
    "prevClose": 2.05,
    "absReturn": 0.0900000000000003
  },
  {
    "fullTicker": "CMS:USA",
    "baseTicker": "CMS",
    "rank": 27.8419,
    "description": "CMS Energy Corporation operates as an energy company primarily in Michigan. The company operates through three segments: Electric Utility; Gas Utility; and NorthStar Clean Energy. The Electric Utility segment is involved in the generation, purchase, distribution, and sale of electricity. This segment generates electricity through coal, wind, gas, renewable energy, oil, and nuclear sources. Its distribution system comprises 270 miles of high-voltage distribution overhead lines; 4 miles of high-voltage distribution underground lines; 4,646 miles of high-voltage distribution overhead lines; 18 miles of high-voltage distribution underground lines; 81,924 miles of electric distribution overhead lines; 9,775 miles of underground distribution lines; and 1,098 substations. The Gas Utility segment engages in the purchase, transmission, storage, distribution, and sale of natural gas, which includes 2,342 miles of transmission lines; 15 gas storage fields; 28,368 miles of distribution mains; and 8 compressor stations. The NorthStar Clean Energy segment is involved in the independent power production and marketing, including the development and operation of renewable generation. The company serves 1.9 million electric and 1.8 million gas customers, including residential, commercial, and diversified industrial customers. The company was incorporated in 1987 and is headquartered in Jackson, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/MGS-Xtf3CGSjXbQogHjYuQ/VudDgLslGXn2KojSlt4wT35cPYuW_eW17kD2DlaD0KJ7i6N3u6HRX7hSwpdFsZSPrWwar19V-nY-SP8qORzHSyPL_F49mXI7lrIh_OSWOChqeRX7pZQ2ZLu4UmyC-gcTCwXdaOeOx48IgQLP51zj84aUTmWo8LzJ2ia5J2RuasY/cMw6Z5ooYyqEbVdsz_qQQxl6QT-Vb8S_mDKjXWb-G20",
    "price": 70.76,
    "prevClose": 70.38,
    "absReturn": 0.38000000000000966
  },
  {
    "fullTicker": "COO:USA",
    "baseTicker": "COO",
    "rank": 43.8933,
    "description": "The Cooper Companies, Inc., together with its subsidiaries, develops, manufactures, and markets contact lens wearers. The company operates in two segments, CooperVision and CooperSurgical. The CooperVision segment provides toric and multifocal lenses comprising lenses correcting vision challenges, such as astigmatism, presbyopia, and myopia; and spherical lense, including lenses that correct near and farsightedness in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The CooperSurgical segment focuses on family and women's health care, which provides fertility products and services, medical devices, and contraception, as well as cryostorage, such as cord blood and cord tissue storage to health care professionals and patients worldwide. It offers surgical and office products, including paragard contraceptive intrauterine devices; and fertility consumables and equipment, donor gamete services, and genomic services, including genetic testing. The company sells its products to distributors, group purchasing organizations, eye care and health care professionals, including independent practices, corporate retailers, hospitals and clinics, and authorized resellers. The Cooper Companies, Inc. was founded in 1958 and is headquartered in San Ramon, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/LRbihswvPjLUjdARbzYCkQ/JWKvSHjJpEzkTj29SGZ4O0kscFnKWrJUSpXxGFFvf2AqjyjJZrL3QFeFmBO2FTidT8kl8HGj2y_QocpAUxJOHDKRZjYF4SZf6d6HC_Wy02l258VBGunm5NWVa-_CrSUx7LzDAGWZrgVX77NBJrDT34NVxMO_-blsmzxYP9jJYvs_-kLLfAjNEOOJxQPy2aiU/VTg4lfLKk7F-53rGFIH67rqvThhCrg8LjqL84byt5Fk",
    "price": 84.73,
    "prevClose": 84.32,
    "absReturn": 0.4100000000000108
  },
  {
    "fullTicker": "ANGO:USA",
    "baseTicker": "ANGO",
    "rank": 54.5942,
    "description": "AngioDynamics, Inc., a medical technology company, engages in the design, manufacture, and sale of medical, surgical, and diagnostic devices for the use in treating peripheral vascular disease, and oncology and surgical settings in the United States and internationally. The company offers Auryon Atherectomy system that is designed to deliver an optimized wavelength, pulse width, and amplitude to remove lesions while preserving vessel wall endothelium. Its thrombus management portfolio includes AlphaVac mechanical thrombectomy system, an emergent mechanical aspiration device that eliminates the need for perfusionist support; thrombolytic catheters that are used to deliver thrombolytic agents, which are drugs to dissolve blood clots in hemodialysis access grafts, arteries, veins, and surgical bypass grafts; and AngioVac venous drainage cannula and extracorporeal circuit, indicated for extracorporeal circulatory support for periods of up to six hours including off-the-shelf pump, filter, and reinfusion cannula, to facilitate venous drainage as part of an extracorporeal bypass procedure. The company also offers NanoKnife IRE Ablation System, an alternative to traditional thermal ablation for the surgical ablation of soft tissue; and peripheral products, which includes angiographic catheters, and diagnostic and interventional guidewires, percutaneous drainage catheters, and coaxial micro-introducer kits used during peripheral diagnostic and interventional procedures. In addition, it provides drainage catheters for multi-purpose/general, nephrostomy, and biliary drainage; micro-Access kits provides interventional physicians a smaller introducer system for minimally invasive procedures; VenaCure EVLT system that are used in endovascular laser procedures to treat superficial venous disease; and Solero MTA System includes solero microwave generator and the specially designed solero MW applicators. The company was founded in 1988 and is headquartered in Latham, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/3YpSCOj4gHnk_hg4CcA6fQ/51cnrum4LskrvPnXd6RHIVNNl-co8fuwyOOK7qVNLBU8ZO-qaHSiFM5xPSTQCQKmVg6QJnt54XbSHcG_18xOUZOeSAtyrptvEPFWkw3ebjoK1UiAsW2_pgzOMBKynmZ8s-cwxVTJfQwmToliSaHLHJ4stJ1fBlfSOExcN_aZrSN_avSNSA14pDJfEd4fUvyy/d-Plj7A00luMqdCNiyboOQ6X0SLM4uWwcH0JVted_sM",
    "price": 10.89,
    "prevClose": 11.44,
    "absReturn": -0.5499999999999989
  },
  {
    "fullTicker": "AGYS:USA",
    "baseTicker": "AGYS",
    "rank": 64.108,
    "description": "Agilysys, Inc. operates as a developer and marketer of software-enabled solutions and services to the hospitality industry in North America, Europe, the Asia-Pacific, and India. It offers software solutions fully integrated with third party hardware and operating systems; cloud applications, support, and maintenance; subscription and maintenance; and professional services. The company's hospitality software solutions include hospitality experience cloud offers solution ecosystems that combine core operational systems for property management, point-of-sale (POS), and inventory and procurement; and Hospitality Solution Studios. Its food and beverage ecosystem solutions comprise InfoGenesis POS; IG Kiosk; IG Flex; IG KDS; IG OnDemand; IG Fly; IG Quick Pay; IG Smart Menu; IG Digital Menu Board; IG PanOptic AI-powered self-checkout kiosk; Pay, a payment processing solution; eCash for cashless tender; gift card solution; and Analyze, a cloud-based data analytic platform. The company's inventory and procurement ecosystem solutions include Eatec solution and Stratton Warren System; LMS, a on-premise or hosted, web and mobile-enabled PMS solution; Versa, a hospitality solution; and Stay, a cloud-native SaaS property management system. Its hospitality and leisure and experience enhancer solutions comprise Book, Express Kiosk and Express Mobile for check-in and check-out; Spa software; Golf; Sales & Catering; Service; Authorize; DataMagine; Reserve solution; Digital Marketing solution; Retail POS solution; Central Reservations; Loyalty & Promotions; Membership; Residence Management; and Guest App. It serves hotels, resorts and cruise lines, casinos, corporate food service management, restaurants, universities, stadiums, and healthcare. The company was formerly known as Pioneer-Standard Electronics, Inc. and changed its name to Agilysys, Inc. in 2003. Agilysys, Inc. was founded in 1932 and is headquartered in Alpharetta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/A-XFvZLHyf0NZ_uE0MF_4Q/-RnvgDWXzBu5P10fWAVQDupFuNXqZLGHWxpNT1HfqGsW-BgxfsUfcWYSXKySGjtFtfJYYUsP2b0M-BDexZxSYcQ5dywQd0TdEO8EpVMSjd1bLZMbK6-GEKm8LbitPLdKuztuJIoBActUnN1iSHaqU41LR-Bjk8owg281hsCeT6I/3cFum830EnC2GqZARM2s-cmUWUPUIiHehYQYj4VrvuI",
    "price": 117.535,
    "prevClose": 117.18,
    "absReturn": 0.35499999999998977
  },
  {
    "fullTicker": "NEXN:USA",
    "baseTicker": "NEXN",
    "rank": 69.3934,
    "description": "Nexxen International Ltd. provides end-to-end and video-first platform that engages advertising campaigns for brands, agencies, media groups, and content creators worldwide. The company offers demand side platform, which provides a self-service solution for advertisers and their agencies to manage omni-channel campaigns, access to inventory, data for audience targeting, planning capabilities across formats, testing solutions and reporting; Data Platform, provides insights and recommendations pertaining to geographic, behavioral, and demographic data, as well as enables advertisers and publishers to use data from various sources to optimize results of their advertising campaigns; and Supply Side Platform, a self-service supply side platforms solution for publishers to sell their digital ad placements via a real-time bidding auction across screens, including mobile, CTVs, streaming devices, and desktops. It also provides analytics/artificial intelligence services; Nexxen Discovery, an audience insight and activation product to gain a view of their audiences to plan, optimize, and activate their advertising campaigns; and Nexxen Studio, an in-house digital creative studio offers various creative solutions to suit the needs of brands and agencies. The company serves ad buyers, including brands and agencies, and digital publishers. The company was formerly known as Tremor International Ltd and changed its name to Nexxen International Ltd. in January 2024. Nexxen International Ltd. was incorporated in 2007 and is headquartered in Tel Aviv-Yafo, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/dz3rBFzLYJSWyUjK7CVu_g/HT_EreiVN7gb-cAMsTOYLqCbqDfaurayp3uB1ANimFt5-bs6O-bBrCW6SO_63evYMnoX4FRwvJf6udQyYI4601teIi_NQWPsTIYrQXSy8mqZiSwu7mPeyQdPd3WtVkY2sCcEqznafhDvM1GhCbExqbCSqFBTsjzpuArN1ODPq4MaUH4Mbe558sKu0OVPz9Qk/mV5oUj5I7ponf6QkTvhRCx0kRVoSaun3lond_7SfHN4",
    "price": 6.02,
    "prevClose": 6.04,
    "absReturn": -0.020000000000000462
  },
  {
    "fullTicker": "QUAD:USA",
    "baseTicker": "QUAD",
    "rank": 78.9071,
    "description": "Quad/Graphics, Inc. provides marketing solutions in North America, Mexico, Central America, the Caribbean, Europe, the Middle East, Africa, South America, and Asia. The company operates through United States Print and Related Services, and International segments. It offers printing services, such as retail inserts, publications, catalogs, special interest publications, journals, direct mail, directories, in-store marketing and promotion, packaging, newspapers, custom print products, and other commercial and specialty printed products; paper procurement services; and manufactures ink. The company also provides marketing and other services, including data intelligence and analytics, technology solutions, media planning, placement and optimization, creative strategy, and content creation, as well as execution in non-print digital and broadcast channels; and imaging and medical services. It serves blue-chip companies that operate in various industries and serve businesses and consumers across various industry verticals, including retail, consumer packaged goods and direct-to-consumer, financial services, and health. Quad/Graphics, Inc. was founded in 1971 and is headquartered in Sussex, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/MjGGtkZBAN3F0Ft-pAY92w/2Lh0FvukrO3uCF5ItabWfwyyokg7C9XIUWTnmjzrES2bN8J85P2XfnIMmARE0gpz2SL4KNXT2UjSgZ0PF9AssYONkSCdef5XhdZZeUkndriPZWzwlPdRCnP0dlGCJrZJq2mTtKIqginPAI6FDNk4-BJW3gkv0RQQNoTDE4GJBhOED_WPcAlc7q0O48kUElEE/Fq5ifkxuPZ7fDCm9YiPssZyb27uyEpVPgPsQcl3sOrc",
    "price": 6.015,
    "prevClose": 5.96,
    "absReturn": 0.054999999999999716
  },
  {
    "fullTicker": "BRC:USA",
    "baseTicker": "BRC",
    "rank": 94.5194,
    "description": "Brady Corporation manufactures and supplies identification solutions (IDS) and workplace safety (WPS) products to identify and protect premises, products, and people in the United States and internationally. The company offers safety signs, traffic signs and control products, floor-marking tape, pipe markers, labeling systems, spill control products, lockout/tagout devices, personal protection equipment, first aid products, and software and services for safety compliance auditing, procedures writing, and training; materials, printing systems, radio frequency identification and barcode scanners for product identification, brand protection labeling, work in process labeling, finished product identification, asset tracking labels, asset tags, and industrial track and trace applications; and handheld printers, wire markers, sleeves, and tags. It also wristbands, labels, printing systems, and other products used in hospital, laboratory, and other healthcare settings for tracking and improving the safety of patients; tags, badges, lanyards, rigid card printing systems, and access control software. The company serves industrial manufacturing, electronic manufacturing, healthcare, chemical, oil, gas, alternative energy, automotive, aerospace, governments, mass transit, mechanical contractors, construction, utilities, education, leisure and entertainment and telecommunications, and others through distributors, direct sales force, and digital channels. Brady Corporation was incorporated in 1914 and is headquartered in Milwaukee, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1767808800000/PmwvPI0bz4wliksYq91HOg/cu0Sk9ekytabUvo1dL4K6KHuiOvqaCFiEbz9VslNZZzF1DponV6gQaQ2yaX4CP-yv6LQDhvGcmTaB_BclxHdztu-XuqH-sIBs8CZQP0ibd7xasm2JtkXfZHNtHXd4tTfRIBufjT5dmBTeCyxs_Z6FtCCSZlUeNWlLry9c1ZRYDc/K2RyLfMEAwo3niG8LlAxUXe_rrsOr4UvtAJCqPn9wDc",
    "price": 81.92,
    "prevClose": 80.73,
    "absReturn": 1.1899999999999977
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 693.265,
    "prevClose": 691.81,
    "absReturn": 1.455000000000041
  }
]