[
  {
    "fullTicker": "CRBP:USA",
    "baseTicker": "CRBP",
    "rank": 4.9125,
    "description": "Corbus Pharmaceuticals Holdings, Inc., a biopharmaceutical company, develops products to defeat serious illness. It develops CRB-701, an antibody drug conjugate (ADC) that targets the expression of Nectin-4 on cancer cells to release a cytotoxic payload of monomethyl auristatin E (MMAE), which is in Phase I clinical trial; CRB-601, an anti-integrin monoclonal antibody that blocks the activation of TGFß expressed on cancer cells for the treatment of solid tumors; CRB-913, a highly peripherally restricted cannabinoid type-1 (CB1) receptor inverse agonist for the treatment of obesity. It has a licensing agreement with Jenrin Discovery, LLC to develop and commercialize the licensed products, including the Jenrin library of approximately 600 compounds, and multiple issued and pending patent filings. The company was incorporated in 2009 and is based in Norwood, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/W9RPYZd-W8IEitNqE1sCCw/ClrBCABnf_HBzQmErYknJjRpsalLw1ZaozXEZ1MG2xCQQwIHW44ayh-0ky2iCu-A2YJzkB6PjL6eX2YUZ7X9no_qhqeG4uvQohkiSnCiqFLo6Nnqg_7LgoVHlZKMZWstRYBKc_-hccHRxEkYchMdsy__9hbcHTOq5eSLsnPpNSWcUiQbldlyBycK77tG2sjBfzBoK6807mhupo3JH5TaqQ/hs23HXEsNxkXi_XAjWDLV85o_qgq69X_IjGjwoJ-wKo",
    "price": 8.24,
    "prevClose": 8.31,
    "absReturn": -0.07000000000000028
  },
  {
    "fullTicker": "CYN:USA",
    "baseTicker": "CYN",
    "rank": 7.0561,
    "description": "Cyngn Inc., an autonomous vehicle (AV) technology company, develops autonomous driving software in the United States. The company develops Enterprise Autonomy Suite, which consists of DriveMod, a modular industrial vehicle autonomous driving software; and Cyngn Insight, a customer-facing tool suite for monitoring and managing AV fleets and generating/aggregating/analyzing data. It also develops Cyngn Evolve, an internal tool suite and infrastructure that facilitates artificial intelligence and machine learning training to continuously enhance algorithms and models, as well as provides a simulation framework to ensure that data collected in the field can be applied to validating new releases. Cyngn Inc. was incorporated in 2013 and is headquartered in Menlo Park, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/d02QzCNXawUKeHs6FqkUZg/j5BFcaNII79c36j3V9YI-mkRfqKR1ZttsNCR6b_hda7EuovHWH1ErNaxieagQ-L3w1sX5VfYtscMCGuBMkQWkRGCuziIkVOdM7o28VWOHmBsWEEk9wp2dpnKQBMHTNuVi6f2SSMfvf8M5FjcoGed9fWQ3YKuOaQnZes1ExJXhZcWbzxB_FwTMPAFYTASxAH1/biCzguywIj6NIcnbgMeGp5hvF1sUW9XFf-Qd43M4kXo",
    "price": 4,
    "prevClose": 4.095,
    "absReturn": -0.09499999999999975
  },
  {
    "fullTicker": "UPB:USA",
    "baseTicker": "UPB",
    "rank": 16.5773,
    "description": "Upstream Bio, Inc., a clinical-stage biotechnology company, develops treatments for inflammatory diseases focusing on severe respiratory disorders. Its product candidate includes verekitug, which is in Phase 2 clinical development for the treatment of severe asthma and chronic rhinosinusitis with nasal polyps, as well as in Phase I clinical trial for treating chronic obstructive pulmonary disease. The company was incorporated in 2021 and is headquartered in Waltham, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/-kNWCnRWcv7zz1xIoSzaQQ/BJsjK3lE7eEfjsQ7UBEpghB2Bh2kCCb1bN5QO_MR8agWimZnphomuiTG7I5nYSkLUWtlGGNhOaws59bbtXNN_NBLR-arvTv4Bf3-cMBnwVC5aWF0TGOoZg2LDHj2eAr8rf3UNNkK8TRBp9PZ_CaLA3gUJKjHpA7rswTxahYFNS8Zci_A8xKv5TwzfQ6AZyW3/iTZnFyx-ozMWAH6YN6hJRfJDGlEaRv5wAM_jvYTaIms",
    "price": 10.88,
    "prevClose": 10.64,
    "absReturn": 0.2400000000000002
  },
  {
    "fullTicker": "SKLZ:USA",
    "baseTicker": "SKLZ",
    "rank": 22.8653,
    "description": "Skillz Inc. operates a mobile game platform in the United States, Israel, China, Malta, and internationally. The company operates in two segments, Skillz an Aarki. It offers eSports gaming platform, which enables game developers to monetize content through multi-player competition. The company provides advertising solutions for mobile app developers. It distributes games through direct app download from its website, as well as through third-party platforms. Skillz Inc. was founded in 2012 and is based in Las Vegas, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/CCOgZWjey2do0yPHQ9mpdQ/A71mcdi643Vr_5CR1Dp3kX4HUEQnV6chEnPrmAsTlzJTmnXu_H903iahLHHPhtbjo1qSAnfAuM7GtKkIbxgKNOo-XDJUMEuQP3nkt39FvTbf-jaxXdjlqnDRdyzJp76KF0hR1yz4dsOBX-BAU82kjfHcZPQer4rVxCVRyHGLzHU/IrIKQm5KsLTC5oDHeI_8pbEo3_mAlNsgsyKxcqfCqk4",
    "price": 6.32,
    "prevClose": 6.29,
    "absReturn": 0.03000000000000025
  },
  {
    "fullTicker": "MLKN:USA",
    "baseTicker": "MLKN",
    "rank": 33.4048,
    "description": "MillerKnoll, Inc. researches, designs, manufactures, and distributes interior furnishings worldwide. It operates through three segments: Americas Contract, International Contract & Specialty, and Global Retail. The company also provides seating products, furniture systems, other freestanding furniture elements, textiles, leather, felt, home furnishings and related services, casegoods, storage products, as well as residential, education, and healthcare furniture solutions. It offers its products under the MillerKnoll, Herman Miller, Herman Miller Circled Symbolic M, Knoll, Maharam, Geiger, Design Within Reach, DWR, HAY, NaughtOne, Nemschoff, Aeron, Mirra, Embody, Setu, Sayl, Cosm, Caper, Eames, Knoll, KnollExtra, Knoll Luxe, KnollStudio, KnollTextiles, Edelman Leather, Spinneybeck Leather, Generation by Knoll, Regeneration by Knoll, MultiGeneration by Knoll, Remix, Holly Hunt, Vladimir Kagan, Muuto, Barcelona, and Womb names. The company offers its products through independent contract furniture dealers, direct contract sales, e-commerce websites, and wholesale and retail stores. Its products are used in institutional, health/science, and residential and other environments, and industrial and educational settings, as well as transportation terminals. The company was formerly known as Herman Miller, Inc. and changed its name to MillerKnoll, Inc. in November 2021. MillerKnoll, Inc. was incorporated in 1905 and is headquartered in Zeeland, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/PC5ZnawXyoyTaWzNjR8wAQ/obxXKTXEJ2hOzWJabPL0AG1LKyQliQ1ZMfd6hvKvx2OYMOXTTTeJqzAxPPmTPc_VdplHHLavW_uydPbgY0XoNCv6uT66CqElZGqr_JaUHeUfwNfFxzBGxtYHiCZ8bQhgH1nycJmwUUyTdSkLjaVUY-i18fOEhzmlzC2NYHbosz7EMJTSybNeBOEbWURi7-VF/ESIz3rNTLWCgplmerG1KUKBALIX1x7JnEHvxuO4Ycc0",
    "price": 16.91,
    "prevClose": 16.91,
    "absReturn": 0
  },
  {
    "fullTicker": "LMNR:USA",
    "baseTicker": "LMNR",
    "rank": 46.0164,
    "description": "Limoneira Company operates as an agribusiness and real estate development company in the United States and internationally. The company operates through four segments: Fresh Lemons, Lemon Packing, Avocados, and Other Agribusiness. It grows, processes, packs, markets, and sells lemons. The company also grows avocado, oranges, and specialty citrus and other crops, including Moro blood oranges, Cara Cara oranges, Valencia oranges, Minneola tangelos, Star Ruby grapefruit, pummelos, and wine grapes. It has lemons planted primarily in Ventura, San Luis Obispo, and San Bernardino Counties in California; and Jujuy, Argentina, as well in Yuma County, Arizona, and La Serena, Chile; avocados planted in Ventura County; oranges planted in Tulare County, California; and wine grapes and other crops. In addition, the company rents residential housing units and commercial office buildings, as well as leases land to third-party agricultural tenants. Further, it is involved in the organic recycling operations; provision of farm management services; and development of land parcels, multi-family housing, and single-family homes. The company markets and sells its lemons directly to food service, wholesale, and retail customers; avocados, oranges, specialty citrus, and other crops to third-party packing houses; and wine grapes to wine producers. Limoneira Company was founded in 1893 and is headquartered in Santa Paula, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/oGnE5IhMR-EKKqggFv4XGg/4g1pgVjIOVvvVFboW_6fuXqo4aCq0jDvLF_i-CvBWiBnRNyJ1g1Zd2Vlm9uOuPL9Priv1m85oItE1Ma-bNRN8uilUb-3YsRyzVEMG9LRFbqGXC2GchrtjYPV4ev1KmaWZQKFcAVwlF92pxQ6UJksgTRvrs4U7pZAvJbp5jbi7uU/7y-m-xIvnT3p2sgvFhK4lT9vrutDSbWnqXUy-SX-QTo",
    "price": 15.01,
    "prevClose": 14.88,
    "absReturn": 0.129999999999999
  },
  {
    "fullTicker": "SSP:USA",
    "baseTicker": "SSP",
    "rank": 59.1104,
    "description": "The E.W. Scripps Company, together with its subsidiaries, operates as a media enterprise through a portfolio of local television stations, national news, and entertainment networks in the United States. It operates through Local Media, Scripps Networks, and Other segments. The Local Media segment operates broadcast television stations, which produce news, information, sports, and entertainment content, as well as its related digital operations; runs network, syndicated, and original programming, and local sporting events; and provides core and political advertising services. The Scripps Networks segment offers national television networks through free over-the-air broadcast, cable/satellite, connected TV, and digital distribution. This segment also provides Scripp News, a national news network, which provides politics, entertainment, science, and technology news; Court TV, which showcases live trials; entertainment brands, such as ION, Bounce, Grit, ION Mystery, ION Plus, and Laff. The company provides digital presence through online, mobile, connected television, and social platforms; and Scripps National Spelling Bee, which shows educational programs. It serves audiences and businesses through cable and satellite service providers. The E.W. Scripps Company was founded in 1878 and is headquartered in Cincinnati, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/FNJUD63jLcm3ooqZQLimYw/idvM6ArfOxI-snqLnr1w2cU0GhGjqBqLP1n7R3pN8_tYfotzsuyBXRAoWknCcPPjOLhYWJ6tU4hY4nFvsh7vqVWnv0JO_4gxyf7htOipYMVqsHpCtp6ByFdCgqwqaL9TpeRT_u_tmiHXat_2FDpxuAwaEOiyXLaUgQqwJn0--UgrjQxjVA-ViBUshJsEWzDF/4Y6x_jhoU9mAePoyF9RozFWmUGGTuXcBnWVEGjA5Bj8",
    "price": 3.12,
    "prevClose": 2.93,
    "absReturn": 0.18999999999999995
  },
  {
    "fullTicker": "PBI:USA",
    "baseTicker": "PBI",
    "rank": 62.0936,
    "description": "Pitney Bowes Inc., operates as a technology-driven company that provides SaaS shipping solutions, mailing innovation, and financial services to small businesses, large enterprises, and government entities around the world. It operates through SendTech Solutions and Presort Services segments. The SendTech Solutions segment provides physical and digital shipping and mailing technology solutions, and other applications for sending, tracking and receiving of letters, parcels and flats, supplies, and maintenance services, as well as financing alternatives to finance equipment and product purchases. The Presort Services segment offers mail sortation services, which allow clients to qualify volumes of first-class mail, marketing mail, marketing mail flats, and bound printed matter for postal workshare discounts. It markets its products, solutions, and services through direct and inside sales force, global and regional partner channels, direct mailings, and digital channels. The company was formerly known as Pitney Bowes Postage Meter Company. Pitney Bowes Inc. was incorporated in 1920 and is headquartered in Stamford, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/GguI2tCKQRnR9hR9ebiK9Q/Eoq00Q0nNdhQuoTrheBKCUPKlUQj2jp5-5UK94uPQH2G7mKPeIdHGlyofIV58cfMzQNUmwqu8XJCfQKRcx9-NY-r2502g__vcT7ZB8R5EbaR3u5JBBEfSab1lrbdnzS4JP8xhkfoI99ynwpPZNKYmtBqpeEL56Pfjl6ok_PNKQykWq0UxL1AhyAnGR-opskD/CSSgkcvkk_Y_ts1Qhlq_ieXji3h0xL37SDouPqqoauA",
    "price": 10.24,
    "prevClose": 10.39,
    "absReturn": -0.15000000000000036
  },
  {
    "fullTicker": "MTW:USA",
    "baseTicker": "MTW",
    "rank": 75.0089,
    "description": "The Manitowoc Company, Inc., together with its subsidiaries, provides engineered lifting solutions in the Americas, Europe, Africa, the Middle East, the Asia Pacific, and internationally. The company designs, manufactures, and distributes crawler-mounted lattice-boom cranes under the Manitowoc brand; a line of top-slewing and self-erecting tower cranes under the Potain brand; mobile hydraulic cranes comprising rough-terrain cranes, all-terrain cranes, truck-mounted cranes, telescopic crawler cranes, industrial cranes, and hydraulic boom trucks under the Grove, Shuttlelift, and National Crane brands. It also provides aftermarket services, such as sale of parts and accessories, field service work, routine maintenance services, technical support, erection and decommissioning services, crane and component remanufacturing, training, and telematics services. The company's crane products are used in various applications, including energy production/distribution and utilities; petrochemical and industrial; infrastructure, such as road, bridge, and airport construction; and commercial and residential construction. It serves a range of customers, including dealers, rental companies, contractors, and government entities in the petrochemical, industrial, commercial construction, power and utilities, infrastructure, and residential construction end markets. The Manitowoc Company, Inc. was founded in 1902 and is headquartered in Milwaukee, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/h0-nep1ckPde3O5we80qJA/mrpgGJ6Rk68RLlwV0Wz9razDbxcmA8O1H2Ufq_9f0HveYdFjU-FoJFUjd3D0SVGxtsoW8XJabdeGRPbwkuQD5GqYMWT-uaBs0C8lu1VPi7PVp_7dEKV1qlkgwYqBdnxfsjMJWAmFv402mS8QAcfBIBFkTtY2BFNAZERcxZkpGhGxw6sHFrK9g49nqIqpNM6t/qPdaOb19MH3mFh6g2kdZxdRHrHBd0KFTGEjArg7X6ck",
    "price": 11.32,
    "prevClose": 11.3,
    "absReturn": 0.019999999999999574
  },
  {
    "fullTicker": "HLIT:USA",
    "baseTicker": "HLIT",
    "rank": 92.3187,
    "description": "Harmonic Inc., together with its subsidiaries, provides broadband access solutions worldwide. The company operates through Broadband and Video segments. The Broadband segment offers software-based broadband access solution, including cOS software-based broadband access solutions to broadband operators; and cOS central cloud services, a subscription service for cOS customers. The Video segment sells video processing, production, and playout solutions and services to cable operators, and satellite and telco Pay-TV service providers, as well as to broadcast and media, including streaming media companies. Its video processing appliance solutions include network management and application software, and hardware products, such as encoders, video servers, high-density stream processing systems, and edge processors. This segment also provides VOS360 SaaS platform that provides both streaming and channel origination and distribution services; and software-as-a-service (SaaS) solutions, which enables the packaging and delivery of streaming services, including live streaming, VOD, catch-up TV, start-over TV, network-DVR and cloud-DVR services through HTTP streaming to various device along with dynamic and personal ad insertion. The company also provides technical support and professional services, such as maintenance and support, consulting, implementation, integration services, program management, technical design and planning, building and site preparation, integration and equipment installation, end-to-end system testing, and training, as well as SaaS-related support and deployment. It sells its products through its direct sales force, as well as through independent resellers and systems integrators. The company was incorporated in 1988 and is headquartered in San Jose, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750507200000/a5SaiEhK7TNU8iQ6P4Y7nw/a6zwr5iAGyt5AxB-QbjM52xBovITxg6ILk_h8bIOfmR59wXm-sdtr839I4nh2ei4XQvAKC6Kztj7uNuIyMe25GIvHUByLfg8D8BusyqZvZOtxbFlljNy3Q4fUQhf38KkOB3dMr2cCD3BDohqahSEwWoWB3Fx9BpRbillchfTT8o/of9WWsycLu-795w4mcQyDGqsB0SQJHgc7qz-PRv11ns",
    "price": 8.88,
    "prevClose": 8.79,
    "absReturn": 0.09000000000000163
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 594.28,
    "prevClose": 595.67474973375,
    "absReturn": -1.394749733750018
  }
]