[
  {
    "fullTicker": "CNM:USA",
    "baseTicker": "CNM",
    "rank": 61.5782,
    "description": "Core & Main, Inc. distributes water, wastewater, storm drainage, and fire protection products and related services in the United States. Its products portfolio include pipes, valves, hydrants, fittings, and other products and services used for service, repair and replacement of underground water infrastructure; storm drainage products, such as corrugated HDPE and metal piping systems, retention basins, inline drains, manholes, grates, geosynthetics, erosion control, and other related products; fire protection products, including fire protection pipes, valves, fittings, sprinkler heads and other accessories, as well as fabrication and kitting services; smart meter products; and smart metering solutions which include meter accessories, meter installation, network infrastructure and software installation, training, and long-term services, as well as engineered treatment plant products. The company's specialty products and services are used in the maintenance, repair, replacement, and construction of water, wastewater, storm drainage, and fire protection infrastructure. It serves municipalities, private water companies, and professional contractors in the municipal, non-residential, and residential end markets. Core & Main, Inc. was founded in 1874 and is headquartered in Saint Louis, Missouri.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/tIjcK-erTNtRAYeHYf8GiA/UlEGP7jT5NNaDRwW3ywf9El8ggJ4ZrB5uv4h6jj82jQvWlB4z9j-8KJ-5aMdmKuh03oBqb3v0CjVWG6KjKsJFtgBDDvugkOgRL-rvitpJ7tJZW2lDrEfC3Qan5S2da5ACqzcPtWNOtFB__l8-f21-oJBtrwgLnEqO_Krv9u4TeAfQEnCtqIDwpdPVs5ZC4iJ/olkN88uuiLCjXDFM9EB-tvsg1Tv2GcTEvFR16Qn60eg",
    "price": 58.58,
    "prevClose": 59.09,
    "absReturn": -0.5100000000000051
  },
  {
    "fullTicker": "WTW:USA",
    "baseTicker": "WTW",
    "rank": 65.9835,
    "description": "Willis Towers Watson Public Limited Company operates as an advisory, broking, and solutions company worldwide. It operates through two segments: Health, Wealth & Career and Risk & Broking. The company offers strategy and design consulting, plan management service and support, broking and administration services for health, wellbeing, and other group benefit programs, including medical, dental, disability, life, voluntary benefits, and other coverages; actuarial support, plan design, and administrative services for pension and retirement savings plans; retirement consulting services and solutions; and integrated solutions that consists of investment discretionary management, pension administration, core actuarial, and communication and change management assistance services. It also provides advice, data, software, and products to address clients' total rewards and talent issues; and risk advice, insurance brokerage, and consulting services in the areas of property and casualty, affinity, risk and analytics, aerospace, construction, global markets direct and facultative, financial, executive and professional risks, financial solutions, crisis management, surety, marine, and natural resources. In addition, the company offers software and technology, risk and capital management, products and product pricing, financial and regulatory reporting, financial and capital modeling, M&A, outsourcing, and business management services. The company was formerly known as Willis Group Holdings Public Limited Company and changed its name to Willis Towers Watson Public Limited Company in January 2016. Willis Towers Watson Public Limited Company was founded in 1828 and is based in London, the United Kingdom.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/8THCM0rUlx2r5BH64hweRA/Ps-FWwcMC5AvIAqj09ujUNwxmXAXji2dGyTk_QrWqIPYmZ_mQTAo5-PhIiFUeTiaZHj9ac-VlMeprz-y4mDoPRZ-2w5eLoNiytLZPt0goJd-97QSoVL4VbKci3vfDxyGvujW7w0meDpHzV9LPrm0DPklAEhhi7Ax4LV3Lk1rCuyqszLMImDICT_FN9BjIoSDHCNkK9L_MsosxG9_8lELVQ/cQMulSCgQSqDNRERBkd8U3HLJJI1cjjY4DUsFFyd8GU",
    "price": 322.81,
    "prevClose": 322.47,
    "absReturn": 0.339999999999975
  },
  {
    "fullTicker": "SKY:USA",
    "baseTicker": "SKY",
    "rank": 69.3239,
    "description": "Champion Homes, Inc. engages in the production and sale of factory-built housing in North America. The company offers manufactured and modular homes, park models recreational vehicles and cabins, accessory dwelling units, and commercial structures and modular buildings for the multi-family and hospitality sectors. It builds homes under the Skyline Homes, Champion Homes, Genesis Homes, Regional Homes, Athens Park, Dutch Housing, Atlantic Homes, Excel Homes, Homes of Merit, All American Homes, New Era, Redman Homes, ScotBilt Homes, Shore Park, Silvercrest, and Titan Homes in the United States, and Moduline and SRI Homes brand names in western Canada. The company also provides construction services to install and set-up factory-built homes; operates a factory-direct manufactured home retail business under the Regional Homes, Titan Factory Direct, and Champion Homes Center brand names; and offers transportation services to manufactured housing and other industries. The company was formerly known as Skyline Champion Corporation and changed its name to Champion Homes, Inc. in August 2024. The company was founded in 2010 and is headquartered in Troy, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/FIcuLjJHFSvp2jEL1p7isw/Dqc9E7qW1u1whYNA6OxO8UUjRI33QJSspyYDa_qHaU5YJiqlV4B_3LffRF024xacWJqFEkcpna6zstHTO02h7MaBV8BLKMHRgsGOGHHZBhgPsA2Dz4VPJICfDHujqCYHbDwK0YeYuArnK7_nsPvHMySvIoOpmOy3g8qs9FLJSeom4CaRo5_OWjCG7md71bsN/IxcKRtCLCG9Vh8IS-GTGpM40dKYxTkoBNI4QYJAm_RU",
    "price": 91.65,
    "prevClose": 93.53,
    "absReturn": -1.8799999999999955
  },
  {
    "fullTicker": "BCPC:USA",
    "baseTicker": "BCPC",
    "rank": 74.1165,
    "description": "Balchem Corporation develops, manufactures, and markets specialty performance ingredients and products for the nutritional, food, pharmaceutical, animal health, medical device sterilization, plant nutrition, and industrial markets worldwide. It operates through three segments: Human Nutrition and Health, Animal Nutrition and Health, and Specialty Products. The Human Nutrition & Health segment supplies ingredients in the food and beverage industry. Its products include spray dried and emulsified powders, extrusion and agglomeration, blended lipid systems, liquid flavor delivery systems, juice and dairy bases, chocolate systems, and cereal systems, as well as ice cream bases and variegates. This segment offers specialty vitamin K2; microencapsulation solutions for various applications; and human grade choline nutrients and mineral amino acid chelated products for nutrition and health applications. The Animal Nutrition & Health segment provides microencapsulated products to enhance health and milk production and delivering nutrient supplements in ruminant animals; chelation technology, which offers enhanced nutrient absorption for various species of production and companion animals; methylsulfonylmethane; and choline chloride, a nutrient for monogastric animal health. The Specialty Products segment distributes ethylene oxide and ammonia primarily for use in the health care industry; and single use canisters for sterilizing re-usable devices. This segment also markets and sells propylene oxide, a fumigant to aid in the control of insects and microbiological spoilage, as well as to reduce bacterial and mold contamination in shell and processed nut meats, processed spices, cacao beans, cocoa powder, raisins, figs, and prunes; and chelated minerals for high value crops. It sells its products through sales force, independent distributors, and sales agents. The company was incorporated in 1967 and is headquartered in Montvale, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/07CVPwziBacW-4AMymPIWg/e1iBWkRTu2oNSm_XU0bC-4lMGJal-yVGwYzotxief70PVB9NcGyU13jjiFzz0BbpUttXZ_6dJyVnYrrV6qK80Zs6qr5IHFGEYipn_RjoGqQfAA8fYWVn1LFHih27m4jNrLX8O9wLSSPXIbMeAGxthFCkAwgg4xRItwjTtLaPKQk/_AUBMyhLKtFtlmdBnumKB67gmOSOkEDiXVtprdCOd1o",
    "price": 167.54,
    "prevClose": 168.1,
    "absReturn": -0.5600000000000023
  },
  {
    "fullTicker": "STVN:USA",
    "baseTicker": "STVN",
    "rank": 76.892,
    "description": "Stevanato Group S.p.A. engages in the design, production, and distribution of products and processes to provide solutions for biopharma and healthcare industries in Europe, the Middle East, Africa, North America, South America, and the Asia Pacific. The company operates in two segments, Biopharmaceutical and Diagnostic Solutions; and Engineering. Its principal products include containment solutions, drug delivery systems, medical devices, diagnostic, analytical services, visual inspection machines, assembling and packaging machines, and glass forming machines. The company was founded in 1949 and is headquartered in Piombino Dese, Italy. Stevanato Group S.p.A. is a subsidiary of Stevanato Holding S.R.L.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/E3n9LSU1sNuDuZqRyPq-_A/942osOPz4D74NV8QnFogMx2m6eZ8GuzHcbGgZtKCLQb--D_H15aL6TJOfybnIM_XAhVvZC9I6Jviosk3a6FCgvtE_McEWFto8m5MVWJ1Pga1xusxNIeXb1yDwkBAY6mL5Tg4PlOS0xfqJ7J_tFV_5ylmG60mfPCcBRtPGZKLOiMhi4uk8O2vJmSG8GidrEp-/oYvAiIT_9glrXNyhT6_58mjOUhe6sAl7WMXBz5R_U9M",
    "price": 17.27,
    "prevClose": 19.16,
    "absReturn": -1.8900000000000006
  },
  {
    "fullTicker": "HOUR:USA",
    "baseTicker": "HOUR",
    "rank": 80.9585,
    "description": "Hour Loop, Inc., an online retailer, engages in e-commerce retailing in the United States. The company sells products in various categories, including home/garden décor, toys, kitchenware, apparels, and electronics products. It sells its products through hourloop.com, as well as third-party marketplaces. Hour Loop, Inc. was founded in 2013 and is headquartered in Redmond, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/7ApgjR9ObDuBSSeBt2rwsw/LaBByZM6cfmK_woZl9yU5Rnv1oVpgsAu6xtu1bcY667NGfECeGg6ToluyF_Z42TGz8tZs2IFL5x7tYFmZ5K-KxTDs9lz4cAVW2BrS9yeJEBmBjt477IY5ny2hQr7wiQtqCiT5oad3GGXUYUlE6eM8uIZZ4RsjehWFUFvvOf--WM/VOEYPRW9k0nqWAqHGA0mVSPLQORX2Sm3UZX133fRebk",
    "price": 1.8,
    "prevClose": 1.81,
    "absReturn": -0.010000000000000009
  },
  {
    "fullTicker": "DOX:USA",
    "baseTicker": "DOX",
    "rank": 86.0255,
    "description": "Amdocs Limited, through its subsidiaries, provides software and services to communications, entertainment, and media service providers worldwide. It designs, develops, operates, implements, supports, and markets open and modular cloud portfolio. The company provides CES24, a set of embedded GenAI-driven assistants powered by the amAIz platform designed to empower service providers to transform their business; Amdocs Subscription Marketplace, a software-as-a-service-based platform that includes an expansive network of pre-integrated digital services, such as media, gaming, eLearning, sports, and retail to security and business services; Amdocs connectX, a cloud-native telco-in-a-box software-as-a-service platform designed for digital telecom brands; and Amdocs eSIM Cloud enables service providers. It also offers consulting, experience design, data, cloud, network services, delivery, quality engineering, operations, systems integration, and content services to various platforms and technologies; maintenance, enhancement design and development, and operational support services; network deployment and optimization services; and managed services, including AI and related tools, predictive analytics, and robotic process automation. In addition, the company provides quality engineering, mobile network, data intelligence, cloud, and professional services. Amdocs Limited was founded in 1982 and is headquartered in Saint Louis, Missouri.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/RGquJkAH_9fnXE-D2ZgynA/f_6InBJHEobkeCl7e5u_NYQuJ-unFq1TTHw87pStd0SIyPfKefq7MumS0J1Sc9WlyU3BtFtywmP9HVVauQMNZu77EGDNz0eJC4-ijuv0rbc0_I5radb9VSVgAScwhOieriNZ09HOvvPJBxnInScV-7gc8-faUVRv1v8CsdvokDf8mgvahZn1FgM34GAIV3Px/hrEl0faGTaJY9TSPS1nJLz7CCpaT0SokubLxrEqp_Ho",
    "price": 82.66,
    "prevClose": 83.15,
    "absReturn": -0.4900000000000091
  },
  {
    "fullTicker": "LECO:USA",
    "baseTicker": "LECO",
    "rank": 89.5917,
    "description": "Lincoln Electric Holdings, Inc., through its subsidiaries, designs, develops, manufactures, and sells welding, cutting, and brazing products in the United States and internationally. It operates in three segments: Americas Welding, International Welding, and The Harris Products Group. The company offers brazing and soldering filler metals, arc welding equipment, plasma and oxyfuel cutting systems, wire feeding systems, fume control equipment, welding accessories, specialty gas regulators, and education solutions; and a portfolio of automated solutions for joining, cutting, material handling, module assembly, and end of line testing, as well as involved in brazing and soldering alloys, and in the retail business. It also provides mobile power solutions, including vehicle-mounted compressors, generators, welders, hydraulics, charger/boosters, and electrified power equipment; automated welding system and solutions; automated material handling solutions; and specialty welding consumables, wear plates, and maintenance and repair services for alloy and wear-resistant products, as well as develops and integrates autonomous guided vehicles and mobile robots, custom assembly and test systems, and proprietary manufacturing execution system software. The company serves general fabrication, oil and gas, power generation, process, automotive and transportation, and construction and infrastructure industries, as well as heavy fabrication, ship building, and maintenance and repair markets. It sells its products directly to users of welding products, including OEMs, manufacturers, and integrators, as well as through industrial distributors, retailers, and agents. Lincoln Electric Holdings, Inc. was founded in 1895 and is headquartered in Cleveland, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/v_g8yIn_kLtLzQlrgyhYDg/mP7G2cz_qo45n_34WqzvtZYDlX7dFPECpHUsYBQ9tCUNJr0rXOKW0ONAndadbCBjTCRisxV3I608vHlx4aHtsDkLYTbGiur3WH-vf2Y771AkiIUX120xxjWR8N17lQxhuJfOHmYX4ozuNHSIuniL9Jl0ty2BU34DK6s6X09tBK8WltVS9C3W7XOxG7A2RjAH/Ha8TI3XOkC-XO1bTKYqNslrM9VAXZ6FGBLEuR3p8an0",
    "price": 258.64,
    "prevClose": 261.16,
    "absReturn": -2.5200000000000387
  },
  {
    "fullTicker": "LQDT:USA",
    "baseTicker": "LQDT",
    "rank": 94.3682,
    "description": "Liquidity Services, Inc. provides e-commerce marketplaces, self-directed auction listing tools, and value-added services in the United States and internationally. The company operates through four segments: GovDeals, Retail Supply Chain Group (RSCG), Capital Assets Group (CAG), and Machinio. Its solutions enable government entities and commercial businesses to sell surplus property and real estate assets through GovDeals, Bid4Assets, and Sierra marketplaces. The company also offers a suite of services, including surplus management, asset valuation, asset sales, marketing, returns management, asset recovery, and ecommerce services; and operates Liquidation.com, a marketplace to sell excess, returned, and overstocked consumer goods. In addition, it operates a global search engine platform for listing used equipment for sale in the construction, machine tool, transportation, printing, laboratory/medical, and agriculture sectors. Further, the company provides Machinio System service that offers various software tools, such as website hosting, email marketing, and inventory management to equipment sellers. The company offers products for various industries, such as consumer electronics, general merchandise, apparel, scientific equipment, aerospace parts and equipment, technology hardware, real estate, energy equipment, industrial capital assets, heavy equipment, fleet and transportation equipment, and specialty equipment. The company was incorporated in 1999 and is headquartered in Bethesda, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/tFp13QmdXn5-t4223s9Ebg/sD0LK5FnHf1tETLjAIILN1O5-xXp6Jc13wzwftQgb3znsxnSMyb-_dJScpHQTDnXQj6MGk9HRbHGwusm_43n2gbJTHzMAx4GbHIyqHwQEZxMbV1lBnxjPbEVp7uea3ig8m_ou3b_7fcure6DU5LxCG4cFgaZHEDNZ_UTQ77xXZTZFKeQG93rPQQeRITZhORP/k_Y2iqzqFyJK7qiBrUGA0fUAnOWd79OAuyz6Je2w32g",
    "price": 31.8,
    "prevClose": 32,
    "absReturn": -0.1999999999999993
  },
  {
    "fullTicker": "HMN:USA",
    "baseTicker": "HMN",
    "rank": 94.6587,
    "description": "Horace Mann Educators Corporation, together with its subsidiaries, operates as an insurance holding company in the United States. It operates through Property & Casualty, Life & Retirement, and Supplemental & Group Benefits segments. The Property & Casualty segment offers insurance products, including private passenger auto insurance, residential home insurance, and personal umbrella insurance; standard auto coverage including liability, collision, and comprehensive; and property coverage for homeowners and renters. The Life & Retirement segment markets tax-qualified fixed, fixed indexed, and variable annuities; the Horace Mann Retirement Advantage open architecture platform and other defined contribution plans; traditional term, whole life insurance products, and indexed universal life (IUL) products. This segment also offers Life by Design, a portfolio of individual whole life and individual term insurance products that address the financial planning needs of educators; Life Select, a combination product that mixes a base of either traditional whole life, 20-pay life, or life paid-up at age 65 with a variety of term riders; single premium whole life products; and cash value term. The Supplemental & Group Benefits segment offers employer-sponsored products, including accident, critical illness, limited-benefit fixed indemnity insurance, term life, and short-term and long-term disability, as well as worksite direct products, such as supplemental heart, cancer, disability, and accident coverages. The company offers individual protection and savings solutions, including auto insurance, property insurance, liability insurance, 403(b) retirement plans, mutual funds, life insurance, student loan solutions, credit monitoring, and financial wellness workshops. It distributes its products and services through agents, brokers, and benefit specialists, as well as direct and digital channels. The company was founded in 1945 and is headquartered in Springfield, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/49/49/1769436000000/-QG3hDXN1XiYQ3VXoa9LRQ/SuF9gSRWeAyBKWLWHQkTYBGANGyMP1V3HPMMBHD92UwUbm8wmEFpFXvhOfhnTw-kIXk4JX1rowX-nXpWSrivXgQI_Hm-gUkMixJMtFysPEO6IpFO1d2naHCudVbqJWHF44_5nBU6aFJyY8-UGDqinqCobU1eKymTgbRaq40Rr7AZSvAkP_wgTIrz3NF90KbF/-VLTVfMkTdsLYwodSNdT7iKA_D1cX1-2dySoA-znVx8",
    "price": 42.73,
    "prevClose": 43.35,
    "absReturn": -0.6200000000000045
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 689.23,
    "prevClose": 688.98,
    "absReturn": 0.25
  }
]