[
  {
    "fullTicker": "HUM:USA",
    "baseTicker": "HUM",
    "rank": 28.4178,
    "description": "Humana Inc. provides medical and specialty insurance products in the United States. It operates in two segments, Insurance and CenterWell. It offers medical care and supplemental benefit plans to individuals. The company also has a contract with Centers for Medicare and Medicaid Services to administer the Limited Income Newly Eligible Transition prescription drug plan program; and contracts with various states to provide Medicaid, dual eligible, and long-term support services benefits. In addition, it provides commercial fully-insured medical and specialty health insurance benefits comprising dental, vision, and other supplemental health benefits, as well as administrative services only products to individuals and employer groups; and military services, such as TRICARE T2017 East Region contract. Further, the company engages in the operation of pharmacy benefit manager business; operates pharmacies and senior focused primary care centers; and offers home solutions services, such as home health, hospice, and other services to its health plan members, as well as to third parties. It sells its products through employers and employees, independent brokers and agents, sales representatives, and digital insurance agencies. The company was formerly known as Extendicare Inc. and changed its name to Humana Inc. in April 1974. Humana Inc. was founded in 1961 and is headquartered in Louisville, Kentucky.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/4L0ch2Bnq1BsUGpNJeR65Q/yngRTny_Pgd-XZCnsVKXlKFbAB1-0imJMFbyF1wMbaVbGqQPzF0iIENjEy8KcIXcItBsjQR3Hrw4XdPLwsIZ2-EkFWzBfrcuAH7H-wlt37rMfAO9JSZ_4FB77vlEwz3aqqI6jusT2xSdbvxAuFIvQMriX3kM03YFbEGxGhF7k_A/tlMF9n8xRwORxEEDqYYPVaiH-YP7Z59K4YhxOylVvw4",
    "price": 259.4,
    "prevClose": 260.67,
    "absReturn": -1.2700000000000387
  },
  {
    "fullTicker": "CLGN:USA",
    "baseTicker": "CLGN",
    "rank": 32.8988,
    "description": "CollPlant Biotechnologies Ltd., a regenerative and aesthetic medicine company, focuses on three-dimensional (3D) bioprinting of tissues and organs, and medical aesthetics in the United States, Canada, Israel, Europe, and internationally. Its products are based on recombinant type I human collagen that is produced with its proprietary plant based genetic engineering technology. The company's products include BioInks for 3D printing of tissues and organs; dermal filler and soft tissue fillers for treating wrinkles; 3D Bioprinted breast implants for regeneration of breast tissue; VergenixSTR, a soft tissue repair matrix intended for the treatment of tendinopathy; and VergenixFG, an advanced wound care product for the treatment of deep surgical incisions and wounds, including diabetic ulcers, venous and pressure ulcers, burns, bedsores, and other chronic wounds; as well as develops injectable breast implants and 3D bioprinted regenerative soft tissue matrix for use in breast reconstruction procedures. It has collaboration agreements with Advanced Regenerative Manufacturing Institute; RegenMed Development Organization; International Society for Biofabrication; AbbVie; and STEMCELL Technologies. The company was formerly known as CollPlant Holdings Ltd. and changed its name to CollPlant Biotechnologies Ltd. in June 2019. The company was incorporated in 1981 and is headquartered in Rehovot, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/N2ypK6g62QJOK1kS1-pETA/Z0uSKqTQfRAhABq6-gHOHeU_TAswbLmOEpVyl8dXtjTOtmysyq5IgE1Sk-Wwa0-bK8CkBagXstqlyrYZdsk_pmrWmjdAelwGAcAJVeggTAn6DTK5L9niT5sL07jveRb80QFIzm91xYWEh91mRyIS7nrBE8m_B2X2eL0VVPkgx05Kz9bY5Id_W4RNGgpLsTLV/KfzcX9Vyl649jPuug8ECcVeFmXWb9BHktvn8f6XcsPw",
    "price": 1.52,
    "prevClose": 1.38,
    "absReturn": 0.14000000000000012
  },
  {
    "fullTicker": "HAS:USA",
    "baseTicker": "HAS",
    "rank": 61.9521,
    "description": "Hasbro, Inc., together with its subsidiaries, operates as a toy and game company in the United States, Europe, Canada, Mexico, Latin America, Australia, China, and Hong Kong. The company offers trading cards and collectibles, action figures, arts and crafts and creative play products, dolls, play sets, preschool toys, plush products, vehicles and toy-related specialty products, sports action products and accessories, and other consumer products; and licensed products, such as apparel, publishing products, home goods and electronics, and toy products. It also engages in the sourcing, marketing, and sale of toy and game products; and promotes its brands through the out-licensing of trademarks, characters, and other brand and intellectual property rights to third parties through the sale of branded consumer products, such as toys and apparel. In addition, the company is involved in the promotion of its brands through the development of trading cards, role-playing, and digital game experiences based on Hasbro and Wizards of the Coast games; and license certain brands to other third-party digital game developers who transform Hasbro brand-based characters and other intellectual properties, into digital gaming experiences. Further, it develops and produces of Hasbro-branded entertainment content, including film, television, children's programming, digital content, and live entertainment. The company sells its products to retailers, distributors, wholesalers, discount stores, specialty hobby stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as ecommerce retailers under the MAGIC: THE GATHERING, Hasbro Gaming, PLAY-DOH, TRANSFORMERS, DUNGEONS & DRAGONS, PEPPA PIG, and NERF as well as LUCASFILMS' STAR WARS, BEYBLADE, Final Fantasy, The Lord of the Rings, Fallout, SPIDER-MAN, and THE AVENGERS brands. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/Wtv6YCwgHgIcOVCotpmSmA/1NMUY14xQvj2D1NPqxdf7gnhuO1zRljk9qPPEAh2ZBxyEG_dc93rTbDX_SrIywR5bZYxtX_gbkLD6hWVfB2o7e5gI0GqOS7hRgrufzLfp1o0omJrmcTrIr7jZwqGXY7HEXZA9NrsDP0GaeVBUfNLpTdiqG0JERP_L6cdwVbzinw/TUnjF2SvCjV3g5bEVeY25JNzv-t8_4WexdaF7U7LiEs",
    "price": 81.98,
    "prevClose": 82.03,
    "absReturn": -0.04999999999999716
  },
  {
    "fullTicker": "ABNB:USA",
    "baseTicker": "ABNB",
    "rank": 65.3414,
    "description": "Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. Its marketplace connects hosts and guests online or through mobile devices to book spaces and experiences. It also offers gift cards. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/JJXVJjD4b0ck__HnpzkUlw/4tLM1iejBbZ3gBiiIAtNSGZ3cJlJzFJbKNGJEqO2783jVKOz3sE7ciQOXRSRmwsd0P-CZFQPc-32s5SiTZ_fPoDtQ2jarBwfmwtioNtiNG6ZRu9zmfG5sdSAlbcDvTaZCmOTsX9wm8YICS1bRuwuZrevdxui-nRkP_ji_46NPy4/ldSb6a6FJYMrYlGlBpvpNmfwJeZluPOG9h7f7pOBywQ",
    "price": 135.28,
    "prevClose": 133.99,
    "absReturn": 1.289999999999992
  },
  {
    "fullTicker": "UBER:USA",
    "baseTicker": "UBER",
    "rank": 66.319,
    "description": "Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows consumers to search for and discover restaurants to grocery, alcohol, convenience, and other retails, as well as order a meal or other items, and either pick-up at the restaurant or have it delivered; and provides Uber direct, a white-label delivery-as-a-service for retailers and restaurants, as well as advertising services. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace, including carriers upfronts, pricing, and shipment booking; and offers on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/zgs-v2Gs-fop0hTjArfhlQ/HhS821bmobNeYmdn4wHjzut1-gJ2nww_bc8vBYLsI-txmb07jyIMwE9CsF9MjlTTB9q6hkHQ_xB89XlXeoCUyxVapE5_IJTGaPNKMLXWOf3u2NDx05HWMyjapU3DwmLnQ-k3DR58FeHkMtU1ypny2FbYKb_WeNqXeTtrlNk-h2-tgVdOH1Erk0kyfPx7GYBF/cKHHv-7XvYnho3rMWARMzrG77YGW6PW2BNRUi4eABWk",
    "price": 79.31,
    "prevClose": 79.69,
    "absReturn": -0.37999999999999545
  },
  {
    "fullTicker": "GFF:USA",
    "baseTicker": "GFF",
    "rank": 79.371,
    "description": "Griffon Corporation, through its subsidiaries, provides consumer and professional, and home and building products in the United States, Europe, Canada, Australia, and internationally. The company operates through two segments: Home and Building Products, and Consumer and Professional Products. The Home and Building Products segment manufactures and markets residential and commercial sectional garage doors, rolling steel service doors, fire doors, shutters, steel security grilles, and room dividers for the use in commercial construction and repair, and home remodeling applications. The segment also sells related products, such as garage door openers. The Consumer and Professional Products segment manufactures and markets long-handled engineered tools, including spades, shovels, spades, scoops, rakes, hoes, cultivators, weeders, post hole diggers, scrapers, edgers, and forks; wheelbarrows and lawn carts; snow tools comprising shovels, pushers, roof rakes, sled sleigh shovels, scoops, and ice scrapers; and pruning products, such as pruners, loppers, shears, and other tools. The segment also offers striking tools, including axes, picks, mattocks, mauls, wood splitters, sledgehammers, pry bars, and repair handles; hand tools comprising hammers, screwdrivers, pliers, adjustable wrenches, handsaws, tape measures, levels, clamps, trowels, cultivators, weeders, and other hand tools; indoor and outdoor planters and lawn accessories; and garden hoses and hose reels. In addition, the segment provides home organization products, including wire and wood shelving, containers, storage cabinets, and other closet and home organization accessories; residential, industrial, and commercial fans; and cleaning products, such as brooms, brushes, squeegees, and other cleaning products. The company was formerly known as Instrument Systems Corporation and changed its name to Griffon Corporation in June 1992. Griffon Corporation was founded in 1774 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/blmQDP-gsLVGStkZLhnDIA/vJ2xMZOACD8xdVfajFOhlmT2xdU37LAxAOOFvNX6B4a5AaDFYsiAWighAbfcqB_ESpCCokgMB1Mju8LeKqMVXnY136lriWkpgHYZtiYLugKcdZblR86ojBbVi5ka4rHNStqgiuigr1rNdFJulWAfseFS0A-N0YO_MQTPAfzUGeI/cNqOh4Flwb9xd9Pn670IlQ4PtlBhecQvB-uBlFxkqTA",
    "price": 76.72,
    "prevClose": 77.41,
    "absReturn": -0.6899999999999977
  },
  {
    "fullTicker": "CMRE:USA",
    "baseTicker": "CMRE",
    "rank": 86.0518,
    "description": "Costamare Inc. owns and operates containerships and dry bulk vessels worldwide. Its containerships are chartered to liner companies providing transportation of cargoes. The company also charters dry bulk vessels to various customers providing worldwide transportation for dry bulk cargoes. As of February 12, 2025, it had a fleet of fleet of 68 containerships and 38 dry bulk vessels. The company was founded in 1974 and is based in Monaco.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/KpNlqH7JCSp0jqoDDXpiLQ/TwvdR82wgiP-cMAwz9FXqufuSHPbrW83F0-XlA5QMAaSqmo0__BDPQqv6FytNl9XXq12E6w39_iTywyy6xRNshYxqQjFqtv0PJ2EN7s4a8aCY2MHe455FGeLP-hxP6xwEJDR1UWReqkwL0dC89TtMLffd4SlKB8eUvyIdPtxrOk/aGErYV2JkwZ8KGtyQpA3_F0TXdurQgs4DdmI6zyTYc4",
    "price": 15.23,
    "prevClose": 15.19,
    "absReturn": 0.040000000000000924
  },
  {
    "fullTicker": "FELE:USA",
    "baseTicker": "FELE",
    "rank": 86.7036,
    "description": "Franklin Electric Co., Inc., together with its subsidiaries, designs, manufactures, and distributes water and fuel pumping systems worldwide. The company operates through Water Systems, Distribution, and Energy Systems segments. The Water Systems segment offers motors, pumps, drives, electronic controls, monitoring devices, and related parts and equipment for use in groundwater, water transfer, and wastewater in a range of residential, agricultural, municipal, and industrial applications; and manufactures electronic drives and controls for the motors which control functionality and provide protection from various hazards, such as electrical surges, over-heating and dry wells or dry tanks. The Energy Systems segment produces and markets pumps, motors, pipe, sumps, fittings, vapor recovery components, electronic controls, monitoring devices and related parts and equipment for use in energy system applications; and tanks and the dispensers, including submersible pumps, motors, station hardware, piping, sumps, vapor recovery, corrosion control systems, and electronic controls and monitoring. This segment serves other energy markets, such as power reliability systems and includes intelligent electronic devices that are designed for online monitoring for the power utility, hydroelectric, rail, and telecommunication and data center infrastructure. The Distribution segment sells to and provides presale support and specifications to the installing contractors. The company sells its products to wholesale and retail distributors, specialty distributors, industrial and petroleum equipment distributors, as well as oil and utility companies, and original equipment manufacturers. Franklin Electric Co., Inc. was founded in 1944 and is headquartered in Fort Wayne, Indiana.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/Trb6CsReO8OZcGzgdOvVRQ/dlwMpRYDsT0iH_y4vamzS2EWf9uTK3RsCg2QWV4bFMtFpsSGfAUryXzBsjGHZ_B1BrbGlPfEGSIddG71Qu89M5a9iZVBTwQ3aBB0Ju7Svid_HrrJjaZLEvG8XfbjeFPMeXIiXTFPRJTMw8sBak23nCjaX3V_wDGDZC632kaXR31SE0L2Aqkxz4F-sbRZXWyJ/kxGGvWN-3wq1MzkuFzv3lwlldeMWkSVjMIrxRs8-2bY",
    "price": 97.32,
    "prevClose": 97.72,
    "absReturn": -0.4000000000000057
  },
  {
    "fullTicker": "ITIC:USA",
    "baseTicker": "ITIC",
    "rank": 92.8793,
    "description": "Investors Title Company engages in the issuance of residential and commercial title insurance for residential, institutional, commercial, and industrial properties. It underwrites land title insurance for owners and mortgagees as a primary insurer; and assumes the reinsurance of title insurance risks from other title insurance companies. The company also provides services in connection with tax-deferred exchanges of like-kind property; acts as a qualified intermediary in tax-deferred exchanges of property; coordinates the exchange aspects of the real estate transaction, such as drafting standard exchange documents, holding the exchange funds between the sale of the old property and the purchase of the new property, and accepting the formal identification of the replacement property. In addition, it serves as an exchange accommodation titleholder for accomplishing reverse exchanges when the taxpayers decide to acquire replacement property before selling the relinquished property. Further, the company offers investment management and trust services to individuals, companies, banks, and trusts; and consulting and management services to clients to start and operate a title insurance agency. It issues title insurance policies directly and through a network of agents in 22 states and the District of Columbia in the United States. Investors Title Company was founded in 1972 and is headquartered in Chapel Hill, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/9DRrXVuw0ydf8CcAPucD7w/MjZvlM4rSKG52vVYnMRUtNUfF0rDJgRMROcShM0T2mvBfiP2Y8qU9FbbLvu5od40G171hscQtZk27FcZa_L-Qc05xc3eV8M4eSjYC5d2kmzDDeTPavIRlCvx_pXViSFIaSwuvGNmDyaomfTcOoAAOYcgJBPpYmIgv1U_5pb6Gv2ljTrOeOWni63COS5LVON-/OVvrxw4VVO8X3ozi_JzVolz9trXp38PuAon4_zdgr_w",
    "price": 254.24,
    "prevClose": 257.94,
    "absReturn": -3.6999999999999886
  },
  {
    "fullTicker": "FLXS:USA",
    "baseTicker": "FLXS",
    "rank": 97.067,
    "description": "Flexsteel Industries, Inc., together with its subsidiaries, operates as a manufacturer, importer, and markets of furniture for residential markets in the United States. It provides furniture, such as sofas, loveseats, chairs, reclining rocking chairs, swivel rockers, sofa beds, convertible bedding units, occasional tables, desks, dining tables and chairs, kitchen storage, bedroom furniture, and outdoor furniture. The company distributes its products through e-commerce channels and dealer sales force. Flexsteel Industries, Inc. was founded in 1893 and is based in Dubuque, Iowa.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766412000000/5mbpthTp5z8hWRX9JGY5-Q/16YvkU5Fq3WUI_nyTHxHkjup26JXXxA1tkg3cZX7dBPJAaR-lzTWggOlwyNZ_gFyYZ3eHuelUV6-Vx8LNKoh0-9KFb_BH-f1UyDEGxbYCxygZEXZeX048yITLSNd7qUeTQQqDQBh0cUC9XlirQQ0Z8iE_2gXlUYvcrBvqbFgD32Hg6DrPna1ATTzkEHi0hQi/U3Sc_VhOKjatFnmL9--h7_t2XTJxX-4RkrJO3NQ83kU",
    "price": 40.35,
    "prevClose": 40.53,
    "absReturn": -0.17999999999999972
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 680.59,
    "prevClose": 674.494485045818,
    "absReturn": 6.095514954182022
  }
]