[
  {
    "fullTicker": "SN:USA",
    "baseTicker": "SN",
    "rank": 5.8063,
    "description": "SharkNinja, Inc., a product design and technology company, engages in the provision of various solutions for consumers worldwide. It offers cleaning appliances, including corded and cordless vacuums, including handheld and robotic vacuums, as well as other floorcare products comprising steam mops, wet/dry cleaning floor products, and carpet extraction; cooking and beverage appliances, such as air fryers, multi-cookers, outdoor and countertop grills and ovens, coffee systems, carbonation, cookware, cutlery, kettles, toasters and bakeware; food preparation appliances comprising blenders, food processors, ice cream makers, and juicers; and beauty appliances, such as hair dryers and stylers, as well as home environment products comprising air purifiers and humidifiers. The company sells its products through traditional brick-and-mortar retail channels and e-commerce channels, distributors, and direct-to-consumer channels under the Shark and Ninja brands. SharkNinja, Inc. was incorporated in 2017 and is headquartered in Needham, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/FzN8-TD0ke-66i65g0W2dg/aOViAq5-e-Sq-x-KPluWuPC-WmKhy6CDYJFhWurqop2izmwm9jmg_PyZdlB9V6blDLPnUeXdLDxzi4fnnBD9igSh6TwnWpsFLa2Vwbrw48maFOcKpkW82tPVpCZ6Ss08Owb4-BqWNL8ZpBcfjvdLO1Gui-hj5a0eChHHPHQ_WSrT6sZZmctkKMAXmsq54XUi/VDOhCcbXlPUVt6cqKDBfLmsdf8Ayzi10fEmZF96xasw",
    "price": 96.085,
    "prevClose": 94.11,
    "absReturn": 1.9749999999999943
  },
  {
    "fullTicker": "EOLS:USA",
    "baseTicker": "EOLS",
    "rank": 11.5959,
    "description": "Evolus, Inc., a performance beauty company, delivers products in the cash-pay aesthetic market in the United States, Canada, Europe, and Australia. It offers Jeuveau, a proprietary 900 kilodalton purified botulinum toxin type A formulation for the temporary improvement in the appearance of moderate to severe glabellar lines in adults; and Evolysse, a collection of injectable hyaluronic acid gels. The company was incorporated in 2012 and is headquartered in Newport Beach, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/n4_mJIQp51GhxMHWdShMRw/zRmaC5axQtRxVjCvLUzwg3KPqhFTdZQpR63p1amBIkhymSj_xzrZDyCI7mSS7YmTE9BZeRV3NAhZPmaQDOQrD5IeXqXVYG9_kfhLcQXuq7fY93CRfokIED1BZiIjaXdm__8nRfw8SsjYT9AQWLSnjkzmqKvO_KceCSfPU0oMnmA/erakN02xp2_I8cNQMEnYSyBdDlUDvK_dHJM2m8Piylk",
    "price": 9.12,
    "prevClose": 9.31,
    "absReturn": -0.19000000000000128
  },
  {
    "fullTicker": "DKS:USA",
    "baseTicker": "DKS",
    "rank": 16.9492,
    "description": "DICK'S Sporting Goods, Inc., together with its subsidiaries, operates as an omni-channel sporting goods retailer primarily in the United States. The company provides hardlines, including sporting goods equipment, fitness equipment, golf equipment, and fishing gear products; and apparel. It also offers footwear and accessories, such as athletic shoes for running, walking, tennis, fitness and cross training, basketball, and hiking; and specialty footwear comprising casual footwear and a complete line of cleats for team sports. In addition, the company owns and operates Sporting Goods, Golf Galaxy, Public Lands, Moosejaw, and Going Going Gone! specialty concept stores; and DICK'S House of Sport and Golf Galaxy Performance Center, as well as GameChanger, a youth sports mobile app for live streaming, scheduling, communications, and scorekeeping. It offers its products online, as well as through its mobile apps. The company was formerly known as Dick'S Clothing and Sporting Goods, Inc. and changed its name to DICK'S Sporting Goods, Inc. in April 1999. DICK'S Sporting Goods, Inc. was incorporated in 1948 and is based in Coraopolis, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/J314S6E9Afkbor_nB5kvWQ/TeuWHzavN6_vPYAhiiw5H1iuB-8D07njcDjVaxfokAQENFB5tYVz7ENxP59kEpSLdZVD9xlIDxQJXxn0ES2bw2H0GidouwS3sRO_VdL5I54ElMd5zAt9WG839OW-VGALyds54WEFCDnKHOyI93hjaKJZNF3KYQ_HHDr9p4thmbWe638KA3dMiegjuDgIjVDW/eW_--LdsphAWdOKco-RnvHIu4BbCpBy4chCjxUr1UAo",
    "price": 202.98,
    "prevClose": 195.88,
    "absReturn": 7.099999999999994
  },
  {
    "fullTicker": "ELUT:USA",
    "baseTicker": "ELUT",
    "rank": 27.32,
    "description": "Elutia Inc., a commercial-stage company, develops and commercializes drug-eluting biologics products for neurostimulation, wound care, and breast reconstruction in the United States. The company operates in three segments: Device Protection; Women's Health; and Cardiovascular. It offers CanGaroo Envelope, which is used to accommodate cardiac implantable electronic devices, such as pacemakers and internal defibrillators. The company also develops CanGarooRM, a combination of the CanGaroo envelope with antibiotics, to reduce the risk of infection after surgical implantation of an electronic device. In addition, it provides ProxiCor for cardiac tissue repair and pericardial closure; Tyke, an extracellular material that is used in the repair of cardiac structures for neonate and infant patients; and VasCure, a patch material to repair or reconstruct the peripheral vasculature. Further, the company offers SimpliDerm, which uses human acellular dermal matrices for tissue repair and reconstruction in various applications, such as sports medicine, hernia repair, trauma reconstruction, and breast reconstruction surgeries following mastectomy. It serves hospitals and healthcare facilities through its direct sales force, independent sales agents, and distributors. The company was formerly known as Aziyo Biologics, Inc. and changed its name to Elutia Inc. in September 2023. Elutia Inc. was incorporated in 2015 and is headquartered in Silver Spring, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/AhenpvEpaF7qQXuAtALAyQ/8une2HDMBHmj4stR0z0Z5E_Krp_DOg4IQpaUHTGbh5Tn9lFwCiFDOVdVY_l7KYVp8-wMlQK014Z-79guqKneLj5YDJdnsBIOlCnM5uN0TV_P1O1yywgRWeGxfJIxPKgQ4BXcjj8qidHKdkHlw8h_tL_3ivwqtPiiv6B0fKxQozk/CmtBPQk_YxLCw9wtAvbS-L871-YbGa_XYdhacivk5tc",
    "price": 1.8,
    "prevClose": 1.32,
    "absReturn": 0.48
  },
  {
    "fullTicker": "ZWS:USA",
    "baseTicker": "ZWS",
    "rank": 39.1005,
    "description": "Zurn Elkay Water Solutions Corporation engages in design, procurement, manufacture, and marketing of water management solutions in the United States, Canada, and internationally. It offers water dispensing and filtration products, such as filtered bottle filling stations, water fountains and water dispensers, and filtered faucets under the Elkay and Halsey Taylor brand names; filtered units including water filters; and water safety and control products, such as backflow preventers, fire system valves, pressure reducing valves, thermostatic mixing valves, PEX pipings, fittings, and installation tools under the Zurn and Wilkins brand names. The company also provides flow systems products comprising point drains, hydrants, fixture carrier systems, and chemical drainage systems; and oil and grease interceptors and separators, acid neutralization systems, and remote monitoring systems under the Zurn, Green Turtle, and Wade brands. In addition, it offers sensor-operated flush valves under the AquaSense, Aquaflush, and AquaVantage brands; heavy-duty commercial faucets under the AquaSpec brand; flush valves and faucets under the Hydro X Power brand name; water conserving fixtures under the EcoVantage and Zurn One brands; stainless steel, quartz, fireclay-ceramic, and cast iron sinks under the Elkay brand name; stainless steel sinks and plumbing fixtures under the Just brand; restroom partition systems and lockers under the Hadrian brand name; and hand dryers. The company offers its products to institutional, commercial, waterworks, and residential end markets through independent sales representatives, plumbing wholesalers, and industry-specific distributors in the waterworks, foodservice, industrial, janitorial, sanitation, and sitework industries. The company was formerly known as Zurn Water Solutions Corporation and changed its name to Zurn Elkay Water Solutions Corporation in July 2022. Zurn Elkay Water Solutions Corporation was founded in 1891 and is based in Milwaukee, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/5ctif3-eEo1F54Xm0uuyEg/SKcxKnUDOr2QVoKwwV8_6Et48yCtJ5ff7c-hv7m3m8WzQhhBBsIOZHDv70PlZiqYUZoa7bKnRkFl6g8u82Z2Od0ilztAQZx-AH4vqEKmxaSRrp-w3NqYKJRdbOw4kbRoP1jTr52xI8Bc0zikfPUsn7DlDOxNB2TXz9XM1OMIiqZG0-ycgZqkAxduPn-tLL0_/8ZmqjxhFV0m-YlrWSkCNZ6vHlAUe2ilIt_4UioDNxQU",
    "price": 36.45,
    "prevClose": 36.63,
    "absReturn": -0.17999999999999972
  },
  {
    "fullTicker": "BGS:USA",
    "baseTicker": "BGS",
    "rank": 44.5545,
    "description": "B&G Foods, Inc. manufactures, sells, and distributes a portfolio of shelf-stable and frozen foods, and household products in the United States, Canada, and Puerto Rico. The company's products include frozen and canned vegetables, vegetables, canola and other cooking oils, vegetable shortening, cooking sprays, oatmeal and other hot cereals, fruit spreads, canned meats and beans, bagel chips, spices, seasonings, hot sauces, wine vinegar, maple syrups, molasses, salad dressings, pizza crusts, Mexican-style sauces, dry soups, taco shells and kits, salsas, pickles, peppers, tomato-based products, crackers, baking powder and soda, corn starch, nut clusters, and other specialty products. It markets its products under various brands, including Ac'cent, B&G, B&G Sandwich Toppers, B&M, Baker's Joy, Bear Creek Country Kitchens, Brer Rabbit, Canoleo, Cary's, Clabber Girl, Cream of Rice, Cream of Wheat, Crisco, Dash, Davis, Devonsheer, Don Pepino, Durkee, Grandma's, Green Giant, Joan of Arc, Las Palmas, Le Sueur, MacDonald's, Mama Mary's, Maple Grove Farms of Vermont, McCann's, Molly McButter, New York Flatbreads, New York Style, Old London, Ortega, Polaner, Red Devil, Regina, Sa-són, Sclafani, Spice Islands, Spring Tree, Sugar Twin, Tone's, Trappey's, TrueNorth, Underwood, Vermont Maid, Victoria, and Wright's. The company also sells, markets, and distributes household products under the Static Guard brand. It sells and distributes its products directly, as well as through a network of independent brokers and distributors to supermarket chains, foodservice outlets, mass merchants, warehouse clubs, non-food outlets, and specialty distributors. The company was formerly known as B&G Foods Holdings Corp. and changed its name to B&G Foods, Inc. in October 2004. B&G Foods, Inc. was founded in 1822 and is headquartered in Parsippany, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/d4EAZaVd9T-YRpm88p_cyQ/ARNYtaja7XLGHTN2JINjYx4ygFBN7uA0L-6m7LVGqhP_uWT_J9o_tTOhqYafrQt2vyycCWqC4akSipCVqSmsvSPjYtxAEhRE4wgQUtHnz4RRrOhccUrBy7u6oqsWbC0xxrdhutcBoyDzOZ7rSdZID92flftJTsEPmFzTTYDwWQI/29S2N76gdYH4S1Lfh3ScwWjfIVHslvi5HEXHE9XK5Eo",
    "price": 4.365,
    "prevClose": 4.35,
    "absReturn": 0.015000000000000568
  },
  {
    "fullTicker": "INSG:USA",
    "baseTicker": "INSG",
    "rank": 52.5592,
    "description": "Inseego Corp. engages in the design and development of cloud-managed wireless wide area network (WAN) and intelligent edge solutions for businesses, consumers, and governments in the United Stated, Europe, and internationally. The company offers 5G and 4G mobile broadband solutions, such as mobile hotspots under the MiFi brand; and 4G VoLTE products and 4G USB modems. It also provides fixed wireless access solutions, including indoor, outdoor, and industrial routers and gateways. In addition, the company provides manages 4G and 5G gateways and routers deployed at distributed locations with a single pane of glass for ease of deployment and monitoring of all the connections. Further, the company offers Inseego Subscribe, a wireless subscriber management solution for carrier's servicing of their government and complex enterprise customer. Inseego Corp. was founded in 1996 and is based in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/PuQEIsKX3uzwb0fpRFaSMg/OpBXZOgejal5t9umyxyqm5t8dRccBHd_D9ap6diKur4lRD5PI9IOuJL0FGCck7T428j9uTzMPw22YwjcSKSvZFK_jUkIlJ2Qm5fDcaHc574m0a0165REBLCTzKyrSPwReECbj5tEjulRNb3901n7OoggRS5UZm5b28iPriZ-SRc/fdAJemMrbm5zstJ27p5zc32C4m-QmMsEWdKw18bay1U",
    "price": 8.47,
    "prevClose": 8.24,
    "absReturn": 0.23000000000000043
  },
  {
    "fullTicker": "CRGY:USA",
    "baseTicker": "CRGY",
    "rank": 66.4541,
    "description": "Crescent Energy Company, an energy company, engages in the exploration and production of crude oil, natural gas, and natural gas liquids in the United States. The company's properties are located in Eagle Ford and the Rockies. It also owns and operates oil and gas gathering systems in southeast Texas; a centralized production facility in Colorado; carbon dioxide, natural gas, and crude oil pipelines, as well as gas processing plants in Wyoming; and a water pipeline in Oklahoma. Crescent Energy Company was founded in 2011 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/3qljfvm2dRpb8ZLLGORVyw/pgok284O63ZKEi0lpwgpxaK-30kEnA2ZtwJRwW_XBXkg0BkfY_-CTzQ7cPXJiO7xQGaGtvfTkvWeHavMkmp_p-XgmJ1INRpXBtuB6DRRsyIzv2Hxk_603J4JOy9ccrRnvkYAy4wUhhBMPvQWCuY_2bsbN5LsN9QJRh6BmROFwXa2Ce5D3uX2E2Blz6xxYlWq/qqi93vgz1FLg3xUIbazJSn0tiVQTLd1T0de2x-9L3r4",
    "price": 8.955,
    "prevClose": 8.95,
    "absReturn": 0.005000000000000782
  },
  {
    "fullTicker": "EBS:USA",
    "baseTicker": "EBS",
    "rank": 74.0393,
    "description": "Emergent BioSolutions Inc., a life sciences company, provides preparedness and response solutions for accidental, deliberate, and naturally occurring public health threats in the United States. The company offers NARCAN Nasal Spray for the emergency treatment of known or suspected opioid overdose; Vaxchora vaccine for the prevention of cholera; Vivotif vaccine for oral administration for the prevention of typhoid fever; Anthrasil for the treatment of inhalational anthrax; BioThrax, an anthrax vaccine; CYFENDUS for post-exposure prophylaxis of disease following suspected or confirmed exposure to Bacillus anthracis; and Raxibacumab injection for the treatment and prophylaxis of inhalational anthrax. It provides ACAM2000, a smallpox vaccine; CNJ-016 to address complications from smallpox vaccination; TEMBEXA for the treatment of smallpox disease caused by variola virus in adult and pediatric patients; Botulism Antitoxin Heptavalent for the treatment of symptomatic botulism; Ebanga for the treatment of Ebola; Trobigard, an atropine sulfate obidoxime chloride auto-injector. In addition, the company is developing EBS-LASV to prevent Lassa fever; EBS-MARV to prevent Marburg virus disease; EBS-SUDV to prevent Sudan virus disease; Pan-Ebola mAbs for the treatment of ebola virus; and WEVEE-VLP for equine encephalitis virus infections. Further, it provides contract development and manufacturing services comprising drug substance and product manufacturing, and packaging, as well as technology transfer, process, and analytical development services. The company was incorporated in 1998 and is headquartered in Gaithersburg, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/D0Of9yjGPysEDeFRD_-ueg/piuLkdDVcKo9TP2Oa2SZ_G0_KAIZeKI-x7JbUaNa1Woc9hgIk3g3CJ9DMYfbPcptN1a4ZkVPcEyzw5wAuYjUmcVHisEdbhHddUA6ANW_RSi7ERDBdTXhddSE6bNt28zzhZeoTFNxkuZCrka-qj-Jwp1kY34xRoM4Rihx9rUhpjT6dfHm37_G-mNgCXBy3-aV/vphoTUisrYgsGnE_sknPKLn4918WijEDVS9N1TdCySM",
    "price": 6.37,
    "prevClose": 6.83,
    "absReturn": -0.45999999999999996
  },
  {
    "fullTicker": "VMI:USA",
    "baseTicker": "VMI",
    "rank": 85.3667,
    "description": "Valmont Industries, Inc. operates as a manufacturer of products and services for infrastructure and agriculture markets in the United States, Australia, Brazil, and internationally. It operates in two segments, Infrastructure and Agriculture. The company manufactures and distributes steel, pre-stressed concrete, composite structures for electrical transmission, substation, and distribution applications; and designs, engineers, and manufactures metal, steel, wood, aluminum, and composite poles and structures for lighting and transportation applications. It also offers galvanizing, anodizing, painting, and powder coating services for paint products; towers, small cell structures, camouflage concealment solutions, passive intermodulation mitigation equipment, and components for wireless communication markets; and solar single-axis tracker product, an integrated system of steel structures, electric motors, and electronic controllers, as well as provides coatings services to preserve metal products. In addition, the company manufactures center pivot components and linear irrigation equipment for the agricultural markets, such as parts and tubular products for industrial customers; advanced technology solutions for agricultural sector; mechanical irrigation equipment and service parts under the Valley brand name. Valmont Industries, Inc. was founded in 1946 and is headquartered in Omaha, Nebraska.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751061600000/UOaWLr9DxIHmDdZkl-HtXw/UtbetOshY7E6Z5wxWS5-7Z7IJDb7k31V8Kt-pZLANCVuStzU3wigJVIkzFToAvRF3rPcqcOgvgpCO9pv-V5d09k4dt93HFE52pS0aYdjmLipiUWA5YzBhfj_qXLgpTy4TBWSxak8XVzTU2UDkmJT8GTs_oI-P2kZvQcuGBavtp0aV_HNSuFqeDCDDIYAFQxi/D1EcDQnSq5kDAmb5keOxkGaGqG82rqYblS7Lx08GlEM",
    "price": 333.03,
    "prevClose": 333.38,
    "absReturn": -0.35000000000002274
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 613.225,
    "prevClose": 611.87,
    "absReturn": 1.3550000000000182
  }
]