[
  {
    "fullTicker": "ONCO:USA",
    "baseTicker": "ONCO",
    "rank": 6.0729,
    "description": "Onconetix, Inc., a biotechnology company, focuses on the research, development, and commercialization of solutions for men's health and oncology. It offers Entadfi, an FDA-approved, once daily pill that combines finasteride and tadalafil for the treatment of benign prostatic hyperplasia; and Proclarix, an in vitro protein-based blood diagnostic test for prostate cancer. The company was formerly known as Blue Water Biotech, Inc. and changed its name to Onconetix, Inc. in December 2023. Onconetix, Inc. was incorporated in 2018 and is headquartered in Cincinnati, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/IgEG9aLwcylWEYC4R4uuig/z6nUxhsB8QR8cYRfW7knCTpmUSOcznQVg94F0CmUeoFxNXFOcGIIlTp5L2x4qpfjsPhDgb1OhSJOiyqlhjHEdOCcJDOhgRM4h0lMhnbOE7p2v8BjDEtO-exkaYiN_cijqlJjQmcysXbfBxrVmoasD_i9FYT3zIXenIQmMFfEB2A/hJqi7_-_Ad7CHrHcdtjjVcg_86Z9UuBIJHiVpzP2HhE",
    "price": 2.33,
    "prevClose": 2.31,
    "absReturn": 0.020000000000000018
  },
  {
    "fullTicker": "TSE:USA",
    "baseTicker": "TSE",
    "rank": 12.3087,
    "description": "Trinseo PLC provides specialty material solutions in the United States, Europe, the Asia-Pacific, and internationally. The company operates through four segments: Engineered Materials, Latex Binders, Polymer Solutions, and Americas Styrenics. The Engineered Materials segment offers rigid thermoplastic compounds and blends, soft thermoplastic, continuous cast, cell cast, activated methyl methacrylates (MMA), PMMA resins, and extruded PMMA sheets and resins for consumer electronics, medical, footwear, automotive, and building and construction applications under the EMERGE, CALIBRE, PLEXIGLAS, ALTUGLAS, ACRYSPA, AVONITE, STUDIO, MEGOL, APILON, APIGO, and APINAT brands. The Latex Binders segment offers various latex binders products, including styrene-butadiene latex, styrene-acrylate latex, vinylidene chloride latex, all-acrylic latex, and butadiene-methacrylate latex. The Polymer Solutions Segment provides a range of polymers, including copolymers, polycarbonate, styrene-acrylonitrile, and acrylonitrile-butadiene-styrene under the MAGNUM brand. The Americas Styrenics segment produces styrene monomer, polystyrene, GPPS, high heat, high impact resin, and STYRON A-TECH polystyrene products for appliances, food packaging, food service disposables, consumer electronics, and building and construction materials applications. Trinseo PLC was incorporated in 2015 and is headquartered in Wayne, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/c6FelOimnGvVk-J1BFs78g/4T8Dn_TAX-oKaPM97cysZP7DxXERTF_YK13Oeo5DxB37PZ10QLB-fcq3qyCIA-LXNOTDMxPOZwlmWdvbYZSAKTFbHryy4qtmmTM-nQXS_p37GEBhBFJWw7eMmE9Yfw3HgOzlPufn6ZGpLpxcs2BJdgQdx-l2DVjy3cmVkqwG_tU/TvjHk7PZK5LgEvQaSg7VlbFE0pLcD3kButsK-4sD6qk",
    "price": 0.9046,
    "prevClose": 0.9601,
    "absReturn": -0.055499999999999994
  },
  {
    "fullTicker": "TBI:USA",
    "baseTicker": "TBI",
    "rank": 21.3611,
    "description": "TrueBlue, Inc., together with its subsidiaries, provides specialized workforce solutions in the United States, Canada, the United Kingdom, Australia, and Puerto Rico. It operates through three segments: PeopleReady, PeopleManagement, and PeopleScout. The PeopleReady segment provides general, industrial, and skilled trade contingent staffing services for construction, transportation, manufacturing, retail, hospitality, and energy industries. The PeopleManagement segment offers contingent, on-site industrial staffing, and commercial driver services, which includes on-site management and recruitment for the contingent industrial workforce of manufacturing, warehousing, and distribution facilities; and recruitment and management of contingent and dedicated commercial drivers to the transportation and distribution industries under the Staff Management, SIMOS Insourcing Solutions, and Centerline Drivers brands. The PeopleScout segment provides recruitment process outsourcing, talent advisory services, and managed service provider solutions including sourcing, screening, hiring, and onboarding services; operates Affinix, a technology platform for sourcing, screening, and delivering a permanent workforce to its clients; talent advisory solutions, such as employer branding, recruitment marketing, talent insights, candidate assessment, and talent acquisition strategy consulting services; and contingent labor programs, including vendor selection, performance management, compliance monitoring, and risk management. The company was formerly known as Labor Ready, Inc. and changed its name to TrueBlue, Inc. in December 2007. The company was incorporated in 1985 and is headquartered in Tacoma, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/Q65u7IF6jrPrNYtGdZx3GQ/W2rA9pUez-8ohjzkCykmsnVOfiNi-5hA0oTN6OitezvAwkuK0z95bcT5chp4JkF1N01Uo_oAi_l-Q8VCzB2a3MftM-KcSDRliu-VwB8XQ-ySz506yYKZ7oj4OeJokaoCr6U735aP8xbTbw9bK8EguzUuNt8bVnlzNGWNIJPjFvY/e8EaDvCcUaH_StHfW5-tjavgK7a7PJHalT-ugOJcazI",
    "price": 4.85,
    "prevClose": 4.87,
    "absReturn": -0.020000000000000462
  },
  {
    "fullTicker": "ERAS:USA",
    "baseTicker": "ERAS",
    "rank": 23.8033,
    "description": "Erasca, Inc., a clinical-stage precision oncology company, focuses on discovering, developing, and commercializing therapies for patients with RAS/MAPK pathway-driven cancers. The company's lead product is naporafenib which is in SEACRAFT-2 pivotal Phase 3 trial for patients with NRAS-mutated (NRASm) melanoma; and in SEACRAFT-1 Phase 1b trial for patients with NRAS Q61X melanoma. It also develops ERAS-0015, a pan-RAS molecular glue for the treatment of patients with RAS-altered solid tumors; ERAS-4001, a pan-KRAS inhibitor for the treatment of patients with KRAS-altered solid tumors; and ERAS-12, an investigational EGFR D2/D3 biparatopic antibody (bpAb) for the treatment of EGRF and RAS/MAPK solid tumors. In addition, the company's products under development include ERAS-801, a central nervous system (CNS)-penetrant EGFR inhibitor for patients with EGFR-altered recurrent glioblastoma (GBM) which is in phase 1 clinical trials; and ERAS-007, an oral inhibitor of ERK1/2 and ERAS-601, an oral SHP2 inhibitor for patients with advanced or metastatic solid tumors. It has a license agreement with Novartis to develop, manufacture, use, and commercialize naporafenib; Katmai Pharmaceuticals, Inc. to develop, manufacture, use, and commercialize ERAS-801 and certain other related compounds; and NiKang Therapeutics, Inc. to develop and commercialize ERAS-601 and certain other related compounds. Erasca, Inc. was incorporated in 2018 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/CX7AJmnOr1KVzyEI2u0tEQ/titDQWR9NhFOguSftX1LgjR-hmZPY9eP3r54EPGdYUngjffnCLS5ZHgBkLuEOpSGWSBX3TJbLwLMPwvUPR75vEtt3fpveh4flh6bJNRBOU7iR9hVqGYDGqtRYY4V-IRidu-2kQoPnfYYRoXuy1o2apLBgf0nanHDWOU_4p6rs5k/XHrbRdOLv2H9HCDGUlwy4V4cJN7IbqvD7lRIYo6ISOU",
    "price": 2.825,
    "prevClose": 2.87,
    "absReturn": -0.04499999999999993
  },
  {
    "fullTicker": "SWAG:USA",
    "baseTicker": "SWAG",
    "rank": 36.9261,
    "description": "Stran & Company, Inc. provides outsourced marketing solutions. The company offers clients custom sourcing services; and e-commerce solutions for promoting branded merchandise and other promotional products, managing promotional loyalty and incentives, print collateral and event assets, order and inventory management, designing and hosting online retail popup shops, fixed public retail online stores, and online business-to-business service offerings. It also provides creative and merchandising services; warehousing/fulfillment and distribution; print-on-demand services; kitting services; point of sale displays; and loyalty and incentive programs. The company was founded in 1994 and is headquartered in Quincy, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/wVbhgCOGtlFav-HDxl8E6A/kUQCOURws8jUUitQIiKpEQy29QMEwrN2_U3-ZIO_jRY1sXmNEKdxt9kaPluRRT-ZkhZg8eYQkH4KGWza1QxkT9UCj1XWGN_Dzaemx1hHw8BizyGisp4hUFG-CaUukfi8PPVAXdTwRZ6TpmoR0zRV1qR8ibLjRmK788xjk_q33673GbLvuIZRbyyL4ii_eo7b/6VJ9W_wQn03G7KytDqcTy_0awvNu8QgDmv_OcuxQAHk",
    "price": 2.37,
    "prevClose": 2.33,
    "absReturn": 0.040000000000000036
  },
  {
    "fullTicker": "CYCN:USA",
    "baseTicker": "CYCN",
    "rank": 46.8251,
    "description": "Cyclerion Therapeutics, Inc., a biopharmaceutical company, develops treatments for serious diseases serious diseases with novel sGC stimulators in both the central nervous system (CNS) and the periphery. It is developing Olinciguat, an orally administered vascular soluble guanylate cyclase (sGC) stimulator, which is in Phase 2 clinical trial to treat cardiovascular diseases; and Praliciguat, a systemic sGC stimulator for the treatment of rare kidney disease. It has a license agreement with Akebia to develop, manufacture, medical affair, and commercializes Praliciguat and other related products. The company was incorporated in 2018 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/F1sqUWwrvlAjOlKd1lKkwg/ADDP8flJKDZv0WPPYLNzQ2u7gMeVkw3MeMZDqN7LRO3SzutJfh6th-JDK0InreQiBND9lyMoy5d4KU2H-z12rJRakGgqUnLFNGHWyAONTB1f5offIzl1P-RTSUfllrk_TvxujJOkoIPStVaINum9jnYGapbd1pKmIsNAsukXR63wJIWKqByXsPFRsTDep22w/VFU08sVKMdFzcLh16poCaDqkD8yi_7crpObYqtpbzpU",
    "price": 1.375,
    "prevClose": 1.39,
    "absReturn": -0.014999999999999902
  },
  {
    "fullTicker": "STEM:USA",
    "baseTicker": "STEM",
    "rank": 56.5939,
    "description": "Stem, Inc. provides artificial intelligence driven software and services that enable its customers to plan, deploy, and operate clean energy assets in the United States and internationally. The company offers OEM energy storage systems; and software and edge hardware devices services. It serves energy traders, asset owners, independent power producers, community choice aggregators, off takers, renewable project developers, engineering, procurement and construction firms, operations and maintenance providers, electric cooperatives, utilities, load-serving entities, and grid operators. Stem, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/SEJ61n3X9TxGg618XBC7qw/IfBe5PeT_owaxUZ_PTDPk-TRnY4Ds8IexCbCor2zwDeHUnpRfLNGY2dInkrjMB88rh6N9jw8zHAsmSt1Uyye6qFjr3EXmTatVbhMzYNrskGKP_MDLBvyJVo2D2xiGcgjBXXMb_hGJWCKrifC3S7EWsdM_OE0VMTRRoKr_BHd8fs/1GMIFEw_inHXsNKq0kX9WxKLRZeWaTcpZWXPdgMYANg",
    "price": 15.35,
    "prevClose": 15.57,
    "absReturn": -0.22000000000000064
  },
  {
    "fullTicker": "SKIL:USA",
    "baseTicker": "SKIL",
    "rank": 67.0791,
    "description": "Skillsoft Corp. provides content and platform and instructor-led training services in the United States and internationally. The company's Content & Platform segment engages in the sale, marketing, and delivery of its content learning solutions in areas, such as leadership and business, technology and developer, and compliance comprising individualized coaching, as well as technical skill areas. This segment also offers Percipio, an AI-driven online learning platform that delivers a learning experience through SaaS solutions. Its Instructor-Led Training segment provides training solutions, including information technology and business skills for corporations and their employees by guiding its customers throughout their lifelong technology learning journey by offering relevant and up-to-date skills training through instructor-led and self-paced, vendor certified, and other proprietary offerings. The company markets and sells their offerings to businesses of many sizes, government agencies, educational institutions, and resellers. Skillsoft Corp. is headquartered in Greenwood Village, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/D1D7Q_FyXw56QnJOi-rIUQ/-ywiL1MEwbTloD5VFUgpUl2YxLWHIGsz_INATRTAnhsRsqWbMXJlSc2vmXlNOuRA8FMMP8mG90spbVs4hy9ELgTIlW-FCryFoGWZfsEp3yEkNymznwj7dU_ebpC1j_gCAKcI5GDBbGDpycP7-1_qJK-RiDJbbBX4q3MHE58KEfMQqpfR--85Q8WXTqESpLvk/vylXJphssR0k0BK8E4z71uyA9tty91KBXSVU-d6CyQY",
    "price": 10.06,
    "prevClose": 10.57,
    "absReturn": -0.5099999999999998
  },
  {
    "fullTicker": "ALHC:USA",
    "baseTicker": "ALHC",
    "rank": 76.7991,
    "description": "Alignment Healthcare, Inc. operates a consumer-centric healthcare platform for seniors in the United States. It delivers customized healthcare experience to meet the needs of seniors through its Medicare Advantage plans. The company was founded in 2013 and is based in Orange, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/rFHUtei8n8m5F5odv2FFLw/ztzbsB7e9L_axpdF7fMOLimKmBOw3kPTiMfLInxbFH2AlWk5ehtE9wtK9Nc7wY3dLrX9I9tuSyEKAHG01qJrBrz1uMrcio3tt_W-VRVlbz_EqVJAnq2x7j7D4cfg7bZOgqpirtoQcxBcsZ4oypZbTAvx1MzynctJ63utPKloI3GyHLBklxX_u0bI7vEO13aD/eNrFhAP0rKkHeQp16rDV1gngBNrkoGMzaYpeXmZmOHI",
    "price": 16.23,
    "prevClose": 16.04,
    "absReturn": 0.19000000000000128
  },
  {
    "fullTicker": "THG:USA",
    "baseTicker": "THG",
    "rank": 95.0668,
    "description": "The Hanover Insurance Group, Inc., through its subsidiaries, provides various property and casualty insurance products and services in the United States. The company operates through four segments: Core Commercial, Specialty, Personal Lines, and Other. It offers commercial multiple peril, workers' compensation, commercial automobile, and other commercial lines coverage; and professional and executive lines, marine, and surety and other, as well as specialty property and casualty comprising Hanover program business, excess and surplus business, Hanover specialty industrial, and specialty general liability business coverage. The company also provides personal automobile; and homeowners and other personal lines, including residences and personal property, liability claims, personal umbrella, inland marine, fire, personal watercraft, personal cyber, and other miscellaneous coverages. It markets its products and services through independent agents and brokers. The company was formerly known as Allmerica Financial Corp. and changed its name to The Hanover Insurance Group, Inc. in December 2005. The Hanover Insurance Group, Inc. was founded in 1852 and is headquartered in Worcester, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1763488800000/pw4T_WSp_TDjnUQ789jD6A/98i7nRGrxBBmi8PIcmC_ei0Lwa0ciFPNbdFXzRHgnChbugeE4xafvrKg9b7AFUVnfT-7GyW-KBf8zW3p1Phc20W_PQ_yZddvax-wDVKg_x_srDTVJN1VLraGR3k_jHwliUDX4XYNzJWSCRVL7zLwD9Rl6o8iApSFcVXcyB480HtfwAOWDug5FEGpuC785iRMST0hfwIjsoHvyCtQTeJwQg/eB7Rhjy7B-Uq7Qy8be55cFLzG_IzOQYuLOZcw7vjDa8",
    "price": 179.89,
    "prevClose": 178.55,
    "absReturn": 1.339999999999975
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 659.9,
    "prevClose": 665.67,
    "absReturn": -5.769999999999982
  }
]