[
  {
    "fullTicker": "PTGX:USA",
    "baseTicker": "PTGX",
    "rank": 4.0251,
    "description": "Protagonist Therapeutics, Inc., a biopharmaceutical company, develops peptide therapeutics for hematology and blood disorders, and inflammatory and immunomodulatory diseases. It is developing Rusfertide, an injectable mimetic of hepcidin that is in phase 3 clinical trials for the treatment of polycythemia vera; Icotrokinra, an orally delivered investigational drug which is in phase 3 clinical trials indicated to block biological pathways targeted by marketed injectable antibody drugs; and PN-943, an orally delivered, gut-restricted alpha 4 beta 7 specific integrin antagonist completed a phase 2 clinical trials in patients with moderate to severe ulcerative colitis. The company also develops IL-17 oral peptide antagonist PN-88,1 an oral metabolic/obesity peptide program, and an oral hepcidin mimetic/ferroportin blocker that is in pre-clinical stage. Protagonist Therapeutics, Inc. was incorporated in 2006 and is headquartered in Newark, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/VScCkhbdHtGu86NXG9HGfw/-VXBYST43kroE2yLHpKdwx-hzG-jd3Nw4l7WwKCtpd1Y7WIAn-UV16KUFBRC0r9kA8Tmj7pWDj5YuA3wEs36zUtc6gt-3nxsdJznDPfYgtsBXuooaAF8Fn4aBmXZ6YiR_tgILvVXeammjU7TvwueMU8BjTnDp6cz6_YrEBCcWTQIFF4vvMYb_TBc0thInxim/I18V0phXlTKLTpQZtAQcKzOw-eJ7Z4JqeGqAjZoiarc",
    "price": 57.525,
    "prevClose": 58.36,
    "absReturn": -0.8350000000000009
  },
  {
    "fullTicker": "RGNX:USA",
    "baseTicker": "RGNX",
    "rank": 9.0399,
    "description": "REGENXBIO Inc., a clinical-stage biotechnology company, provides gene therapies that deliver functional genes to cells with genetic defects in the United States. Its gene therapy product candidates are based on NAV Technology Platform, a proprietary adeno-associated virus gene delivery platform. The company's products in pipeline includes ABBV-RGX-314 for the treatment of wet age-related macular degeneration, diabetic retinopathy, and other chronic retinal diseases; and RGX-202, which is in Phase III clinical trial for the treatment of Duchenne muscular dystrophy, as well as RGX-121 for the treatment of mucopolysaccharidosis type II. It also develops RGX-111 for the treatment of mucopolysaccharidosis type I, RGX-181 for the treatment of late-infantile neuronal ceroid lipofuscinosis type 2, and RGX-381 for the treatment of the ocular manifestations of CLN2 disease. In addition, the company licenses its NAV Technology Platform to other biotechnology and pharmaceutical companies. Further, it has a collaboration and license agreement with AbbVie Global Enterprises Ltd. to develop ABBV-RGX-314 outside the United States. REGENXBIO Inc. was incorporated in 2008 and is headquartered in Rockville, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/OiV0Fpe1T9g4opo91Mb3og/HWQUbMWzptiEwZ0WrTN6VrmIuf-60aCi8zOrm_ipS8raOwUgPjDd3DYk9Az0d9DTn89fbm3dCW844eiscPh2gSmDfxTrTyKxv9zNZwuhdwXGdW4OW_pWKzTIY11LkJomYxkDhkE9m3jEGjKwusmNNYNUI3tjr4EqSqzgWMP4t_U/Q_-8qs-52NZuSQmF0CL3nqu6KcKcrf3amXJ5GwxKg7g",
    "price": 9.615,
    "prevClose": 9.89,
    "absReturn": -0.27500000000000036
  },
  {
    "fullTicker": "UAVS:USA",
    "baseTicker": "UAVS",
    "rank": 14.9126,
    "description": "AgEagle Aerial Systems, Inc., through its subsidiaries, designs and delivers autonomous unmanned aerial systems worldwide. The company operates in three segments: Drones; Sensors; and Software-as-a-Service (SaaS). It offers unmanned aerial vehicles under the eBee Ag, eBee Geo, eBee TAC, eBee X, and eBee VISION brands; and sensor solutions, such as Altum-PT, RedEdge-P, Aeria X, Duet M, Duet T, S.O.D.A., and S.O.D.A. 3D sensors. The company also provides software solutions comprising Ground Control, an operating system that automates and scales drone for individual pilots and large enterprises; eMotion, a drone flight and data management solution for aerial mapping use; and HempOverview, an advanced aerial-image-based data collection and analytics solution. It serves agriculture, military/defense, public safety, surveying/mapping, and utilities/engineering industries. The company was founded in 2010 and is headquartered in Wichita, Kansas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/Z8-0tHZy7RrSDwgGVsNvzw/sC8C63DB39eBWR8U30FmJ8uN8_UMNrruGskjbV-LUJr-8iqVMqD63kvsRhzsFYLQ_YTGQ0CO0rrBcX_rUE0mOTJZp-dl06fSNrZPpZV6-8fNN1xN4n9Ga-Ui6ggUwB1KtTWSEQUuWf4jIO7v_HqBaWEuvuZYHd6PrOpFdSINb9Ggoj1UVNZYVj7iMIhD_mqk/YOZVajOImuUgV6wKZkvKZBbKEQNP0AY7ds8wrPLzfUs",
    "price": 2.005,
    "prevClose": 1.91,
    "absReturn": 0.09499999999999997
  },
  {
    "fullTicker": "MYSZ:USA",
    "baseTicker": "MYSZ",
    "rank": 25.899,
    "description": "My Size, Inc., an omnichannel e-commerce platform, provides AI-driven software as a service measurement solutions for fashion ecommerce companies in Israel, Spain, and internationally. It operates through Fashion and Equipment E-Commerce Platform, and SaaS Solutions segments. The company offers Size Form, which generates accurate measurements to find proper fitting clothes and accessories; First Look Smart Mirror, a solution for brick and mortar stores that allows customers to filter the whole physical store by their size and fit; Smart Catalogue, a solution that suggests the launch of new sizes, detects new product niches, and allows brands to adapt their assortment to their customer base; and True Feedback solution. It provides MySizeID; Naiz Fit, which offers SaaS technology solutions that solve size and fit issues, and AI solutions for smarter design; and Orgad, an online retailer. The company was formerly known as Knowledgetree Ventures, Inc. and changed its name to My Size, Inc. in January 2014. My Size, Inc. was incorporated in 1999 and is headquartered in Airport City, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/uHqeBaStQvXSye7mu4xW4g/xSPT6DhtWaUYDBAAQ4UVZpl3nldxGLV_3D2o8_CGr54V1RXeh4kHEDr6Fxkp5s0gWW-cbyydNSfuJomtf_GjmZn89YtoSyrlp21gGm7gGycOUeragemnsKpdTZu4UtG3ZxJI7LXMyJMumHmBY4ni-8ItNKtHPj2YkYwMLOOJ5mQ/36XwIAmZx25_K3sXAASkznOw9X8eonM-CyFbx6PdMRs",
    "price": 1.405,
    "prevClose": 1.4382,
    "absReturn": -0.033199999999999896
  },
  {
    "fullTicker": "CTMX:USA",
    "baseTicker": "CTMX",
    "rank": 34.9225,
    "description": "CytomX Therapeutics, Inc. operates as an oncology-focused biopharmaceutical company that focuses on developing novel conditionally activated biologics localized to the tumor microenvironment. The company utilizes conditional activation platform technology for oncology biologics research and development comprising the validation of targets for antibody-drug conjugates (ADCs), opening therapeutic window for novel T-cell engagers (TCEs) targeting solid tumors, and increasing the therapeutic index for immune modulators, such as cytokines; and PROBODY platform in preclinical research in areas outside of oncology. It also develops CX-904, a T-cell-engaging bispecific antibody targeting the epidermal growth factor receptor (EGFR) on tumor cells and the CD3 receptor on T cells; CX-2051, a conditionally activated ADC for optimizing the therapeutic index for EpCAM-expressing epithelial cancers, including colorectal cancer; and CX-801, an interferon alpha-2b PROBODY cytokine. In addition, the company's development pipeline comprises CX-2029, a conditional activated ADC targeting CD71; and BMS-986288, a PROBODY version of non-fucosylated ipilimumab. It has strategic collaborations with Amgen, Astellas, Bristol Myers Squibb, Regeneron, and Moderna; and clinical trial collaboration and supply agreement with Merck for the evaluation of CX-801 in combination with anti-PD-1 therapy, KEYTRUDA (pembrolizumab). The company was founded in 2008 and is based in South San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/ZIInk4-zIRf1V9JZJLRn4g/r__DYM1coYD1WNJB6VUAZ-hDqwJKs1ruliOi9JHAgy45IaJuMtdPYPd-fdJ1ZwPPB3TxiKbIHjQ074KDs_Ww5DvxGIefpKWG-zUCSmzefkWAPOBGC_tQV9CsX2UKiID6UrQZATkp-AhFztHD3x5wcdwh54zlpmvXhKKj2PMvHRSSvBkJQk6GShvXPpAxJQH8/QQuf2XBLrGLXTK9VdGrKxAW1uTK03eGDhsDvFu16xjU",
    "price": 2.095,
    "prevClose": 2.09,
    "absReturn": 0.0050000000000003375
  },
  {
    "fullTicker": "FTLF:USA",
    "baseTicker": "FTLF",
    "rank": 48.2184,
    "description": "FitLife Brands, Inc. provides nutritional supplements for health-conscious consumers in the United States and internationally. The company provides weight loss, sports nutrition, and general health products; sports nutrition products; weight loss and sports nutrition products; sports nutrition and general wellness formulations with an emphasis on natural, vegan, and organic ingredients; and male health and weight loss products, as well as other diet, health, and sports nutrition supplements and related products; and value-oriented sports nutrition and weight loss products. It offers MRC products which includes general health supplements; and natural skincare and beauty products. In addition, it markets its products under the brand names of NDS Nutrition, PMD Sports, SirenLabs, CoreActive, Nutrology, Metis Nutrition, iSatori, BioGenetic Laboratories, Energize, Dr. Tobias, All-Natural Advice, and Maritime Naturals through franchised stores, as well as through retail locations, which include specialty, mass, and online. The company was formerly known as Bond Laboratories, Inc. and changed its name to FitLife Brands, Inc. in September 2013. FitLife Brands, Inc. was incorporated in 2005 and is headquartered in Omaha, Nebraska.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/ZyuR93DLriHO4XPTZTPMnQ/9iReoLbePjGAKa9PfHrQ9prDyuJDKFNWLBHn_g_Tkno0LLEXoc06-DSn83KFa6-3TY0r0Gcx8_2hjA5eKKO_Kb7DBsHVVhGuryhhP-6iwFhi1FBi9OVgIAonXk21-h0Ohlw9CC79zOVKzldxhIY5YR029misESJv6Ubl1ajcpN5BeRmtSQZDb2-ha8__244T/l3CxUhTVVFQLZqZq2JTV5Zh_2nRUzQGJiatlRadPT-E",
    "price": 18.47,
    "prevClose": 19.06,
    "absReturn": -0.5899999999999999
  },
  {
    "fullTicker": "LII:USA",
    "baseTicker": "LII",
    "rank": 55.3118,
    "description": "Lennox International Inc., together with its subsidiaries, designs, manufactures, and markets products for the heating, ventilation, air conditioning, and refrigeration markets in the United States, Canada, and internationally. The Home Comfort Solutions segment provides furnaces, air conditioners, heat pumps, packaged heating and cooling systems, indoor air quality equipment, comfort control products, and replacement parts and supplies; residential heating, ventilation, cooling equipment, and air conditioning; and evaporator coils and unit heaters under Lennox, Dave Lennox Signature Collection, Armstrong Air, Ducane, AirEase, Concord, MagicPak, Advanced Distributor Products, Allied, Elite Series, Merit Series, Comfort Sync, Healthy Climate, iComfort, ComfortSense, and Lennox Stores name. The Building Climate Solutions segment offers unitary heating and air conditioning equipment, applied systems, controls, installation and service of commercial heating and cooling equipment, variable refrigerant flow commercial, curb, curb adapters, drop box diffusers, HVAC recycling, and salvage service. This segment also provides condensing units, unit coolers, fluid coolers, air cooled condensers, air handlers, and refrigeration rack systems for preserving food and other perishables; and compressor racks and industrial process chillers under the Lennox, Model L, CORE, Enlight, Xion, Energence, Prodigy, Strategos, Raider, Lennox VRF, Lennox National Account Services, Allied Commercial, Elite, AES Industries, Mechanical, and Reclaim, Heatcraft Worldwide and Chandler Refrigeration, Bohn, MAGNA, Larkin, Climate Control, Chandler Refrigeration, IntelliGen, and Interlink brand name. In addition, the company provides small package units, rooftop units, chillers, air handlers, and fan coils. It sells its products and services through direct sales, distributors, and company-owned parts and supplies stores. The company was founded in 1895 and is headquartered in Richardson, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/-hC8KluH9yEI_ylBCpy5LQ/gxTDBmUUzCh9yakqOkgWDzxQuNlHs1TqBhDYr8mixv2Nz4n26y3wR7ZROU2I6X8FPuctpe7YxhTBhX7dSe-ICiIL3INqIs8em4KOl64hgtJH8xRsIedBgzMUXMtew-hlUhvQPddU-PpqTd_vQaAbKvUzywvAEcaUu8R9M9VFkImEbLEKaOzb61rjSHrvSaqm/Onx90oFLfFDL0cqWERvWqqKMKsLHy0JHdqObH1JWMVw",
    "price": 552.01,
    "prevClose": 558.08,
    "absReturn": -6.07000000000005
  },
  {
    "fullTicker": "ANGO:USA",
    "baseTicker": "ANGO",
    "rank": 69.449,
    "description": "AngioDynamics, Inc., a medical technology company, engages in the design, manufacture, and sale of medical, surgical, and diagnostic devices for the use in treating peripheral vascular disease, and oncology and surgical settings in the United States and internationally. The company offers Auryon Atherectomy system that is designed to deliver an optimized wavelength, pulse width, and amplitude to remove lesions while preserving vessel wall endothelium. Its thrombus management portfolio includes AlphaVac mechanical thrombectomy system, an emergent mechanical aspiration device that eliminates the need for perfusionist support; thrombolytic catheters that are used to deliver thrombolytic agents, which are drugs to dissolve blood clots in hemodialysis access grafts, arteries, veins, and surgical bypass grafts; and AngioVac venous drainage cannula and extracorporeal circuit, indicated for extracorporeal circulatory support for periods of up to six hours including off-the-shelf pump, filter, and reinfusion cannula, to facilitate venous drainage as part of an extracorporeal bypass procedure. The company also offers NanoKnife IRE Ablation System, an alternative to traditional thermal ablation for the surgical ablation of soft tissue; and peripheral products, which includes angiographic catheters, and diagnostic and interventional guidewires, percutaneous drainage catheters, and coaxial micro-introducer kits used during peripheral diagnostic and interventional procedures. In addition, it provides drainage catheters for multi-purpose/general, nephrostomy, and biliary drainage; micro-Access kits provides interventional physicians a smaller introducer system for minimally invasive procedures; VenaCure EVLT system that are used in endovascular laser procedures to treat superficial venous disease; and Solero MTA System includes solero microwave generator and the specially designed solero MW applicators. The company was founded in 1988 and is headquartered in Latham, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/nKAtFE08DOTJ_F-sE-3egw/P0TCXbxZTbqe2G5pxJeU8U1l4fUoUV9Dl0qv3iruAHKM0oIrZ736uqua0bDui1xvSBZz3eaJIH90Pc_mtHyme7aEPztGEbzJz0daz64BLG9fbqI6el1XWgB9Tg6cETgg_zLVRgES_AztfnVkscqHMgIQxIjAjpeADAq6sCokdXsiHa0NIG3TOo0wM6v1hb3U/0OSCMiJPei5tNcrvhVUQqjSRvKzGpvLITgBD1QrGPoI",
    "price": 10.915,
    "prevClose": 11.01,
    "absReturn": -0.09500000000000064
  },
  {
    "fullTicker": "OPCH:USA",
    "baseTicker": "OPCH",
    "rank": 82.9924,
    "description": "Option Care Health, Inc. offers home and alternate site infusion services in the United States. The company provides anti-infective therapy and services; home infusion services to treat heart failures; home parenteral nutrition and enteral nutrition support services for numerous acute and chronic conditions, such as stroke, cancer, and gastrointestinal diseases; immunoglobulin infusion therapies for the treatment of immune deficiencies; and treatments for chronic inflammatory disorders, including crohn's disease, plaque psoriasis, psoriatic arthritis, rheumatoid arthritis, ulcerative colitis, and other chronic inflammatory disorders. It also offers treatments to manage the progression of neurological disorders, such as Duchenne muscular dystrophy, multiple sclerosis, Alzheimer's disease, and other neurological disorder; infusion therapies for bleeding disorders, such as hemophilia and von Willebrand diseases; therapies for women with high-risk pregnancies; and other infusion therapies to treat various conditions, including pain management, chemotherapy, and respiratory medications, as well as nursing services. The company markets its services through patient referrals, including physicians, hospital discharge planners, hospital personnel, health maintenance organizations, and preferred provider organizations. Option Care Health, Inc. is headquartered in Bannockburn, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/T8j9UDJzNsE-RG3mKcsigw/ZwFwTcGN0n-xvCVs-XONGP_Lrfhm23WRRAehsIW8-vDxeGzFd42BeC_fg5z_q10cmqQ8rTPaCbUSXfWVYqJjU65ngZBHG3Av6cyyZ1lMZ80BgeWgOX3bp-51nUHi-SgpkL0sYtvQopqcU4WhBGImRn0d8EXKc4pDjOK_Jp387EjiEw3deDeTpa5mBiHobeMj/dL_zSlv139j-6tYkVFz_RSVBvPZGvaeo7b3CghBucos",
    "price": 28.675,
    "prevClose": 29.25,
    "absReturn": -0.5749999999999993
  },
  {
    "fullTicker": "RIGL:USA",
    "baseTicker": "RIGL",
    "rank": 98.6638,
    "description": "Rigel Pharmaceuticals, Inc., a biotechnology company, engages in discovering, developing, and providing therapies that enhance the lives of patients with hematologic disorders and cancer. The company's commercialized products include Tavalisse, an oral spleen tyrosine kinase inhibitor for the treatment of adult patients with chronic immune thrombocytopenia; Rezlidhia, a non-intensive monotherapy to treat adult patients with relapsed or refractory (R/R) acute myeloid leukemia (AML) with a susceptible isocitrate dehydrogenase-1 (IDH1) mutation as detected by an FDA-approved test; and GAVRETO, a once daily, small molecule, oral, kinase inhibitor for the treatment of adult patients with metastatic rearranged during transfection (RET) fusion-positive non-small cell lung cancer (NSCLC), as well as to treat adult and pediatric patients twelve years of age and older with advanced or metastatic RET fusion-positive thyroid cancer. It also develops R289, an oral interleukin receptor-associated kinases 1 and 4 (IRAK1/4) inhibitor for the treatment of hematology-oncology, autoimmune, and inflammatory diseases, as well as to treat lower-risk myelodysplastic syndrome. In addition, the company has product candidates in clinical development with partners BerGenBio ASA, Eli Lilly and Company, and Daiichi Sankyo. It has strategic development collaboration with The University of Texas MD Anderson Cancer Center for the development of Olutasidenib in AML and other hematologic cancers with IDH1mutations, as well as with collaborative network for neuro-oncology clinical trials to evaluate Olutasidenib in combination with temozolomide in patients with high-grade glioma harboring an IDH1 mutation. Rigel Pharmaceuticals, Inc. was incorporated in 1996 and is headquartered in South San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1757541600000/xp5LLQqytUNsWluZe8l5aQ/gr39LA7pF7W-oaIHBqRVWY5AOtfiDmofF5cy-39QA4BQrfVxJhQrqkdfpWsgTQpDywB6W1fh_ABZKONJFkOW1BN75qToDCMygxqNDAcZOtrsC0LB3UE0frgJQbbShJKS_TGyrqcvi19NYZM4J5EGWEFHeJY1AmZxdegsGPhXzRbReV-LisG9VM3QB__MiMFJ/dy3q0iW-Hc406xAV6Ns6X2nLQxRoBxzZL_9kSAjy28k",
    "price": 37.22,
    "prevClose": 35.93,
    "absReturn": 1.2899999999999991
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 651.545,
    "prevClose": 650.33,
    "absReturn": 1.2149999999999181
  }
]