[
  {
    "fullTicker": "CLF:USA",
    "baseTicker": "CLF",
    "rank": 0.4869,
    "description": "Cleveland-Cliffs Inc. operates as a flat-rolled steel producer in the United States, Canada, and internationally. The company offers hot-rolled, cold-rolled, electrogalvanized, hot-dip galvanized and galvannealed, aluminized, galvalume, enameling, and advanced high-strength steel products; austenitic, martensitic, duplex, precipitation hardening, and ferritic stainless-steel products; steel plates; and grain oriented and non-oriented electrical steel products, as well as slab, rail, scrap, iron ore, coal, coke, and tool and die, stamped components. It also provides tubular components, including carbon steel, stainless steel, and electric resistance welded tubing products. In addition, the company offers tin mill products; hot and cold stamp assembly, tooling, and sampling solutions; ingots, rolled blooms, and cast blooms; and hot-briquetted iron products. Further, it owns five iron ore mines in Minnesota and Michigan. The company serves automotive, infrastructure, and manufacturing industries; and distributors and converters, and steel producers. The company was formerly known as Cliffs Natural Resources Inc. and changed its name to Cleveland-Cliffs Inc. in August 2017. Cleveland-Cliffs Inc. was founded in 1847 and is headquartered in Cleveland, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/GCFR9A3X2qyIvijyYYfY5Q/2HJxhzHyW7yaKUm3Fwr_pWopc2Fu9TtkszFkVzO_d425BOq0xvzEx3U0yz-_FRBfJn3GwY9vOznWKMFBZpYtThO26XADmon7GZDnkkfP1E2WBY7kFNv_PV2anKRcThNQgLRpYBD1TAu1UuZG78XbDZCAsqTi8sYUPVKs1UF6-0E/in9KoZro6k2bD-aqiuHc9G93lL-NeY_x60uyTiqYWR0",
    "price": 11.785,
    "prevClose": 12.43,
    "absReturn": -0.6449999999999996
  },
  {
    "fullTicker": "STI:USA",
    "baseTicker": "STI",
    "rank": 8.1643,
    "description": "Solidion Technology Inc. focuses on the development and commercialization of battery materials, components, cells, and selected module/pack technologies. It offers advanced anode materials, as well as silicon-rich all-solid-state lithium-ion cells, anodeless lithium metal cells, and lithium-sulfur cells. The company is headquartered in Dallas, Texas. Solidion Technology Inc. operates as a subsidiary of Global Graphene Group, Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/ZA_7Bop9qIzIbqx0xNEoew/u8omJ-YkJ3UkZchq0F0OMLNso3XjxMGXfB-MJt77STXrsJYRTAEqnQ3l9MDf4Q_mHvqy2iTdcQQa44wRuY8tyNHe2SQiG-wuqGJRLjapNcxItx1DkKfYJpW9kX1DUolgRooU88AtgVNv15_7IP_cZyiOMmjJNnbKOEV1m2UwrMY/WR3EMhQtPpic327vqIpQjngBfZL_Y6bPVAOiuFzLvUM",
    "price": 11.165,
    "prevClose": 12.65,
    "absReturn": -1.4850000000000012
  },
  {
    "fullTicker": "RPID:USA",
    "baseTicker": "RPID",
    "rank": 14.9976,
    "description": "Rapid Micro Biosystems, Inc., a life sciences technology company, provides products for the detection of microbial contamination in the manufacture of pharmaceutical, medical devices, and personal care products in the United States, Germany, Switzerland, Japan, and internationally. The company offers Growth Direct platform, which includes growth direct system, proprietary consumables, lab information management system connection software, and customer support and validation services. Its platform automates and modernizes the manual microbial quality control (MQC) testing workflows for therapeutic modalities, such as biologics, vaccines, cell and gene therapies, and sterile injectables. The company also provides onsite technical training services. Its solutions are used in environmental monitoring, water, bioburden, and sterility release testing applications. In addition, the company offers RMBNucleus Mold Alarm software; and Growth Direct LIMS connection software. Rapid Micro Biosystems, Inc. was formerly known as Genomic Profiling Systems, Inc. and changed its name to Rapid Micro Biosystems, Inc. The company was incorporated in 2006 and is headquartered in Lexington, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/dy8X0U0akydIIACEK1MKZw/-4kdtRJAa6j9-u47in5E3JrI8BBYut0KcIJ2XJSD6aCJ238Tm0CrV3edhHY9HoDc7HJsOYnC9IwT3NKrsTGwoo_veYV1Up42k7W7AiF10Ujz6SFNi8UJIBH5o1sMq0I0mRuS2F1UdOleJQMOP184c1bVoc5E4uW-A97ctFS1hWVFAAzRkqoaE7Wo0tTaE13x/oEza2OKyHBTNlfKnZ0x1MWIQOpiOe_ocjoH9lUZc3iQ",
    "price": 2.83,
    "prevClose": 2.99,
    "absReturn": -0.16000000000000014
  },
  {
    "fullTicker": "GLUE:USA",
    "baseTicker": "GLUE",
    "rank": 27.4306,
    "description": "Monte Rosa Therapeutics, Inc., a clinical-stage biotechnology company, engages in the development of novel small molecule precision medicines that employ the body's natural mechanisms to selectively degrade therapeutically relevant proteins. The company develops orally bioavailable molecular glue degraders (MGDs), such as MRT-2359 for the treatment of MYC-driven tumors; MRT-6160 for the treatment of neurologic and systemic autoimmune and inflammatory diseases; and MRT-8102 for the treatment of inflammatory diseases driven by IL-1b and the NLRP3 inflammasome. In addition, it develops CDK2 to treat multiple cancers, including ovarian, endometrial, gastric and breast. Further, its pipeline includes programs in immunology and inflammation (I&I) indications, oncology, and genetic diseases. The company has developed QuEEN, a discovery engine, to enable its unique target-centric MGD discovery and development approach and its rational design of MGD product candidates. It has a strategic collaboration and licensing agreement with F. Hoffmann-La Roche Ltd. to discover and develop MGDs against targets in cancer and neurological diseases. The company was incorporated in 2019 and is headquartered in Boston, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/r_JomLSFUhkgJ4A70gHGWA/djUOttS4Nt4E1Jt9NmlnMuefzRRQ5v-DjiA1CXCTyPruH1hHoOKLxZYnwmTmAvhsbE_Qw_HcMJurtbNthtf-Rg81n8ZQZ8e_gidATqGZnMa1Prb7Au3OJ8bo5eV4JwLOCO-Y84tAeytk5_oKvZHs4hR89f7b3p6OcsQDYcKxYCIvhrxi2auBByMLWWAvw1Bt/sLYHKhQpwPshAqW19qSso8aDbdPAx7EyvWmsznuwxtU",
    "price": 12.03,
    "prevClose": 12.85,
    "absReturn": -0.8200000000000003
  },
  {
    "fullTicker": "OCG:USA",
    "baseTicker": "OCG",
    "rank": 32.8193,
    "description": "Oriental Culture Holding LTD, through its subsidiaries, operates an online platform to facilitate e-commerce trading of artwork and collectables in China and Hong Kong. The company facilitates trading by individual and institutional customers of various collectibles, artworks, and commodities on its online platforms. It also provides online and offline integrated marketing, storage, and technical maintenance services. In addition, the company offers industry solutions and related software products, and system development and technical support services. Further, it is involved in the development of Wine and Spirits metaverse project. Oriental Culture Holding LTD was incorporated in 2018 and is headquartered in Central, Hong Kong.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/sDqgA8dGAIudxZN46_4hig/iP-WbgtjE9VqATgMz39OK4Ks0KnR62B1BUITxOWP_x0bDofIp6LDTGrprTNHj8GsGfPnlRevM6ZMBUiRtPLHh44TTjNL_MkhPWhgqMlvafPZW-J3rCAcfMS3njV5XZWai315UhijShnU8RFSq_mpYu_XBS1fsQdUNL_UDmv9cExxnUuuVq6xlm6xSe2qwErd/zcjwceUpKG4e4RbXHqClWqrlxahsTnpa6DD_TCrVHrY",
    "price": 3.01,
    "prevClose": 3.15,
    "absReturn": -0.14000000000000012
  },
  {
    "fullTicker": "LSTR:USA",
    "baseTicker": "LSTR",
    "rank": 44.3597,
    "description": "Landstar System, Inc. provides integrated transportation management solutions in the United States, Canada, Mexico, and internationally. It operates through two segments: Transportation Logistics and Insurance. The Transportation Logistics segment offers a range of transportation services, including truckload and less-than-truckload transportation, rail intermodal, air cargo, ocean cargo, expedited ground and air delivery of time-critical freight, heavy-haul/specialized, U.S.-Canada and U.S.-Mexico cross-border, intra-Mexico, intra-Canada, project cargo, and customs brokerage, as well as offers transportation services to other transportation companies, such as third party logistics and less-than-truckload services. It provides truck services through dry and specialty vans of various sizes, unsided/platform trailers, temperature-controlled vans, and containers; rail intermodal services through contracts with domestic and Canadian railroads, certain short-line railroads, and asset-based intermodal equipment; and domestic and international air and ocean services. This segment serves the automotive parts and assemblies, consumer durables, building products, metals, chemicals, foodstuffs, heavy machinery, retail, electronics, and military equipment industries. The Insurance segment provides risk and claims management services; and reinsures risks of the company's independent contractors. It markets its services through independent commission sales agents and third-party capacity providers. The company was incorporated in 1991 and is headquartered in Jacksonville, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/VA5ZlbBhOlLlS12rbozqog/xeBrwZK7rku2ZkUC9VDHIGTYOBMf4CgrYUrtBwIl_phqqTjB-hc9_sZAQ441d6VVc-Vx05221OCvkNFHuNQ04GJGvRpADD_eFDHcsEKSpFCluKmGdZrLSBA_2aeyTlnyPtAvFNFYuF01D0ioqirD9xkG6bEpXzRwJblDJJPMLbcNffsNtOsT8VVXjylcFWmB/uGT-4vv5HMg2DZskGPSQ6CfX3reHXXFDG7xFNA2i4wc",
    "price": 125.835,
    "prevClose": 128.43,
    "absReturn": -2.595000000000013
  },
  {
    "fullTicker": "SRDX:USA",
    "baseTicker": "SRDX",
    "rank": 54.6989,
    "description": "Surmodics, Inc., together with its subsidiaries, provides performance coating technologies for intravascular medical devices, and chemical and biological components for in vitro diagnostic immunoassay tests and microarrays in the United States and internationally. It operates through two segments, Medical Device and In Vitro Diagnostics (IVD). The Medical Device segment engages in the provision of surface modification coating technologies to enhance access, deliverability, and predictable deployment of medical devices; and drug-delivery coating technologies to provide site-specific drug-delivery from the surface of a medical device for neurovascular, peripheral, coronary, and structural heart, and other markets, as well as manufacturing of vascular intervention medical devices, including drug-coated balloons, mechanical thrombectomy devices, and radial access balloon catheters and guide sheaths. The IVD segment develops, manufactures, and sells chemical and biological components for in vitro diagnostic immunoassay and molecular tests, as well as diagnostic and biomedical research markets. This segment offers protein stabilizers, substrates, surface coatings, and antigens. The company was founded in 1979 and is headquartered in Eden Prairie, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/imskf7XEeUaECrpwBkzfAw/hOwwpxdEJYiiai0xd9s-qSjABny1r6oBJLYjQ-qnuGJ06Nrv7-T4XhZ7vHa-qnwz1SGVmBX4t58ekB5DRvISS7LWv053WzG1aIrumMt6rTXG2s0yeFJKxJIvE6RPsJS3WpvYKOobJ9K-9R7eOuwemsB3sSSJp1IfTIPhsOPhE24/kYEHlf3rEjZ1PT8QqkEVReGEonVc8lnveR-Bt-uAr4M",
    "price": 28.39,
    "prevClose": 27.435,
    "absReturn": 0.9550000000000018
  },
  {
    "fullTicker": "AMAT:USA",
    "baseTicker": "AMAT",
    "rank": 74.4197,
    "description": "Applied Materials, Inc. engages in the provision of manufacturing equipment, services, and software to the semiconductor, display, and related industries. The company operates through three segments: Semiconductor Systems, Applied Global Services, and Display. The Semiconductor Systems segment develops, manufactures, and sells semiconductor capital equipment that is used to fabricate semiconductor chips or integrated circuits. The Applied Global Services segment provides integrated solutions to optimize equipment and fab performance and productivity comprising spares, upgrades, services, and other equipment and factory automation software for semiconductor, display, and other products. The Display segment offers products for manufacturing liquid crystal displays; organic light-emitting diodes; and other display technologies for TVs, monitors, laptops, personal computers, smart phones, and other consumer-oriented devices and solar energy cells. It operates in the United States, China, Korea, Taiwan, Japan, Southeast Asia, Europe, and internationally. The company was incorporated in 1967 and is headquartered in Santa Clara, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/ZIIez9bw9zUOJgegHxzngQ/SXon6zWs31GP9Y6T_39R5xFYe8HDyUu4raT_SBg3a56uPg-DOtbPKa3vdpETsqmF0WQN8KsvNEWtzd4bWDMlBx7mu6NfYka9gw17KaykIgh-4qYZOvRcW6YI7rim74ms1KWGsrdmDkURIkxTXkDxikJvJqfggu3p89uTGfkXKizOgFUTJpVVIqzj_ifIlzu0/fYMddm8oopamJ7AzBMyKRyCnsO_Y9sIRegEeNWzSeE8",
    "price": 238.37,
    "prevClose": 233.1,
    "absReturn": 5.27000000000001
  },
  {
    "fullTicker": "OII:USA",
    "baseTicker": "OII",
    "rank": 83.3469,
    "description": "Oceaneering International, Inc. provides engineered services and products, and robotic solutions to the offshore energy, defense, aerospace, manufacturing, and entertainment industries in the United States. It operates through Subsea Robotics, Manufactured Products, Offshore Projects Group, Integrity Management & Digital Solutions, and Aerospace and Defense Technologies segments. The company offers remotely operated vehicles (ROVs) for drill support and vessel-based services, including subsea hardware installation, construction, pipeline inspection, survey and facilities inspection, maintenance, and repair; ROV tooling; and survey services, such as hydrographic survey, positioning services, and autonomous underwater vehicles for geoscience. It also provides distribution and connection systems, including production control umbilicals and field development hardware, pipeline connection and repair systems, and subsea and topside control valves to the energy industry; and autonomous mobile robotic technology and entertainment systems to various industries. In addition, the company offers subsea installation and intervention products comprising riserless light well intervention services, as well as inspection, maintenance, and repair services; installation and workover control systems, and ROV workover control systems; diving services; project management and engineering solutions; and drill pipe riser services and systems, and wellhead load relief solutions. Further, it provides asset integrity management services; software and analytical solutions for the bulk cargo maritime industry; and software, digital, and connectivity solutions for the energy industry, as well engineering and related manufacturing in defense and space exploration activities to the United States' government agencies and their prime contractors. The company operates in Africa, the United Kingdom, Norway, Brazil, Asia, Australia, and internationally. Oceaneering International, Inc. was founded in 1964 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/5OLM7HznGZdrnh5AryRCeg/D07U_gXeL28POVkAyhU8Owgg_StrLqFzYNVt6ZqZXv7VYlqQzf8PlXBqguDHIpZqFgTAk3hKNiOLaLhjZb7UR9MOkbOsMxLJyoAKxC8G1KR-S7e-OZcM-9X0zPbUMtgb4d96IPdFfTZKNxWG80AvtJqx75drK6FkO6bysRFnbyr0maN-DBRcOGHYQGzFapiI/l8X50tQ-8gsQl9TH5sNNVC0x0h6y8QRlfPlX0gdFEbI",
    "price": 24.02,
    "prevClose": 23.29,
    "absReturn": 0.7300000000000004
  },
  {
    "fullTicker": "THG:USA",
    "baseTicker": "THG",
    "rank": 96.6077,
    "description": "The Hanover Insurance Group, Inc., through its subsidiaries, provides various property and casualty insurance products and services in the United States. The company operates through four segments: Core Commercial, Specialty, Personal Lines, and Other. It offers commercial multiple peril, workers' compensation, commercial automobile, and other commercial lines coverage; and professional and executive lines, marine, and surety and other, as well as specialty property and casualty comprising Hanover program business, excess and surplus business, Hanover specialty industrial, and specialty general liability business coverage. The company also provides personal automobile; and homeowners and other personal lines, including residences and personal property, liability claims, personal umbrella, inland marine, fire, personal watercraft, personal cyber, and other miscellaneous coverages. It markets its products and services through independent agents and brokers. The company was formerly known as Allmerica Financial Corp. and changed its name to The Hanover Insurance Group, Inc. in December 2005. The Hanover Insurance Group, Inc. was founded in 1852 and is headquartered in Worcester, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1762207200000/ayczVRFOsjyFUGeoigkMRA/_tws7yyvr2NcWl2YYCveFV5qBARPcsHxLhUfIkBSoJ7l8ozhZhbD1vxDmkHdd2Uxs_hOv0MhPt4CzH4Tcja6GeJGRO7RHQoO3sgQLVL-U2GLx4_Ipbd9td7_R8YVy8w-iLwE8-mfueAjbafuZsgG88izVvPumKRwVMDZtwg4l7Uksq8PY5DbR10pBARkuOzLEsyqLHfCYQ9f5mdmzB16Kg/plWCYvKSqZrAjpf4LQhEyFhhhmNTDvzW1-1MNVbDQeE",
    "price": 170.73,
    "prevClose": 170.88,
    "absReturn": -0.15000000000000568
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 684.155,
    "prevClose": 682.06,
    "absReturn": 2.0950000000000273
  }
]