[
  {
    "fullTicker": "WEST:USA",
    "baseTicker": "WEST",
    "rank": 1.8453,
    "description": "Westrock Coffee Company, LLC operates as an integrated coffee, tea, flavors, extracts, and ingredients solutions provider in the United States and internationally. It operates through two segments, Beverage Solutions, and Sustainable Sourcing & Traceability (SS&T). The Beverage Solutions segment provides various packaging, including branded and private label coffee in bags, fractional packs, single serve cups, multi-serve bottles, and ready-to-drink bottles and cans, as well as extract solutions for applications in cold brew and ready-to-drink offerings. The SS&T segment engages in delivery and settlement of forward sales contracts for green coffee. The company offers coffee sourcing, supply chain management, product development, roasting, packaging, and distribution services to the retail, food service and restaurant, convenience store and travel center, non-commercial account, CPG, and hospitality industries. Westrock Coffee Company, LLC was founded in 2009 and is headquartered in Little Rock, Arkansas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/VfXaKAzaCbS40E1vm8xwoQ/Sj1D5wHxraMEwacxnnrkOgy30T_nyP3ZS45Iz2Svg0WqhQW47m70YE5agG2dcm5_v4lmK31jAT7Qg7N55d1rPlPbt6oGZW-FlKPN8vs6wCjISmm0NE8ilh16l8EBDJqfaconydiVRVKc11WeYIyl-pRq_rgqFnDVxNCZCsMY0t1deraPGsbBymP_mn8_fXKG/KaGY_pLatf1LQ9mYjP7V8Stz8_hZA4FAWElVTNPY7ho",
    "price": 5.96,
    "prevClose": 6.31,
    "absReturn": -0.34999999999999964
  },
  {
    "fullTicker": "DBGI:USA",
    "baseTicker": "DBGI",
    "rank": 9.7299,
    "description": "Digital Brands Group, Inc. engages in the provision of various apparel products through direct-to-consumer and wholesale distribution. The company offers women's clothing, including dresses, shirts, sweaters, skirts, shorts, athleisure bottoms, and other accessory products, as well as t-shirts. It sells its products under the Bailey 44, Stateside, DSTLD, Sundry, and ACE Studios brand names. The company sells directly to the consumer through its websites and showrooms, as well as through its wholesale channel in specialty stores and select department stores. The company was formerly known as Denim.LA, Inc. Digital Brands Group, Inc. was incorporated in 2012 and is headquartered in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/0fx4uRFT2It0mJrZkZYsdw/dhLC0IDaWFjdSa-IOlEUYp66FE1STNmzpkV0xEPVrYsy3ZyPcigRRIQKzGH2HQiwgz1ZxhumWMWtYoR5QxRoTJurmSO2_6HA44Rma3Gzw5XQtI6R5KOTaOoORpDY-NGGlhcF8qNBUBWF9HH88ulgziv8byBT0vqicEpl5rJNZ4wAJM4R37bhv6TGy15Yx2es/X3tDNAxWZNUVPXHlTMWYuI4gn1vxj6oPua6Wf_MkY_I",
    "price": 9.5,
    "prevClose": 10.7,
    "absReturn": -1.1999999999999993
  },
  {
    "fullTicker": "RITR:USA",
    "baseTicker": "RITR",
    "rank": 20.2818,
    "description": "Reitar Logtech Holdings Limited, through its subsidiaries, provides construction management and engineering design services. It operates in two segments, Asset Management and Professional Consultancy Services; and Construction Management and Engineering Design Services. The company provides construction management and engineering design services for cold storage facilities, automated warehouses, renovated offices, and tailor-made electrical systems. It also offers asset management services for construction projects, including refrigerated storages and warehouses; and professional consultancy services for construction projects, such as renovation works, interior designs and modification works of commercial units, and residential or commercial redevelopment works. The company serves logistics property investors, including investment funds and property owners; and logistics operators and direct users. Reitar Logtech Holdings Limited was founded in 2015 and is based in Kwun Tong, Hong Kong.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/NRN80e8DHo2Bu8nHdlum3A/zEm_KTM4EI5ODnDM3h8lL_MzEluAVwr6tSaZUZ1TTtNpzGa5IB719Ri8qltznbAVgGudRmoZ5zx2T7FgnKRpTfV7c6s-mNKx1IWyCB53-Y5Vh5EO7YUv1LOqwrs6WY5gFXHJq2M_KzG8hxW4IlI_S6a3YGB__-seC2vSe8AOcSuIZSpmy4wf4iSBZyEoht9h/MDt4jYuVtdwAIMZeI15mBoKkM1shYnsxgzQ9pxU95RA",
    "price": 5.24,
    "prevClose": 5.23,
    "absReturn": 0.009999999999999787
  },
  {
    "fullTicker": "HRI:USA",
    "baseTicker": "HRI",
    "rank": 26.6231,
    "description": "Herc Holdings Inc., together with its subsidiaries, operates as an equipment rental supplier in the United States and internationally. It rents aerial, earthmoving, material handling, trucks and trailers, air compressors, compaction, and lighting equipment. The company offers ProSolutions, an industry specific solution-based services, which include power generation, climate control, remediation and restoration, pump, trench shoring, and studio and production equipment; and ProContractor professional grade tools. In addition, it provides various services, including repair, maintenance, equipment management, and safety training; and equipment re-rental and on-site support services, as well as ancillary services, such as equipment transport, rental protection, cleaning, refueling, and labor. Further, the company sells used equipment and contractor supplies, such as construction consumables, tools, small equipment, and safety supplies. It serves non-residential and residential construction, specialty trade, restoration, remediation and environment, and facility maintenance contractors; industrial manufacturing industries, including refineries and petrochemical, automotive and aerospace, power, metals and mining, agriculture, pulp, paper and wood, and food and beverage industries; infrastructure and government sectors; and commercial facilities, commercial warehousing, education, healthcare, data centers, hospitality, retail, special event management customers. The company sells its products through its sales team and industry catalogs, as well as through participation and sponsorship of industry events, trade shows, and Internet. Herc Holdings Inc. was incorporated in 1965 and is based in Bonita Springs, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/M8tWs63DCJGtmV9Y3uJ_gQ/VYAo-MKf1Ia7puc0G7CmG7xcO_Sxl8zn-PwSl-pzXygLVRsLFK5uO2PUi5uUsOE3RQBQEdMxOs6wUu6baIFCMIlowvDMKZ2rG1qjM9i7uJztvTOCTzwuAOy6RRlKcMQVIdgZu-oF5Dxs8HJrQMgy9snVgIdUpPgd3O3mGns2Fs1fmo-T4G5URe2DTojJ-u1U/juWiBE91cc_MJyVRPCzgDSnyTdwfqqYbD5Yy0Xoqvxo",
    "price": 114.98,
    "prevClose": 111.68,
    "absReturn": 3.299999999999997
  },
  {
    "fullTicker": "NTIC:USA",
    "baseTicker": "NTIC",
    "rank": 35.1954,
    "description": "Northern Technologies International Corporation develops and markets rust and corrosion inhibiting solutions in North America, South America, Europe, the Middle East, China, Brazil, India, Rest of Asia, and internationally. It offers rust and corrosion inhibiting products, such as plastic and paper packaging, liquids, coatings, rust removers, cleaners, diffusers, and engineered solutions designed for the oil and gas industry under the ZERUST brand. The company markets and sells a portfolio of bio-based and certified compostable polymer resin compounds under the Natur-Tec brand; and finished products, such as trash bags, agricultural film, and single-use disposable products under the Natur-Bag brand. In addition, it offers on-site and technical consulting for rust and corrosion prevention issues. It sells its products and services to automotive, electronics, electrical, mechanical, military, retail consumer, and oil and gas markets through direct sales force, network of independent distributors, agents, manufacturer's sales representatives, and joint venture and strategic partners. Northern Technologies International Corporation was founded in 1970 and is headquartered in Circle Pines, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/XJ3nk2MAM2ML6O95XunBNg/T1_hsQWuAmMfVHEfjAIm2HBT85KJrDevdrWPZtklyqMbmaU0JQVF-WrEpFq_rlDlO4Nme8gyI814QfqIQ7NdMkMjMu4lN4IjZ-K1bJm4-3gEfg9jpfp_7yM9_nmji7vufzlla7HsWKtoVaQIyhNxnSWFP8aw4_qdc3yZ2iE2R5bKX-n_ampjxlKFWsnAuYP-Ai_0DESNUUpTVu7k42isRw/pN3wN9Jymm-0S3yptCOh9ZzkjUXc4JM1dZ0WXcUqoUo",
    "price": 7.37,
    "prevClose": 7.2,
    "absReturn": 0.16999999999999993
  },
  {
    "fullTicker": "MTCH:USA",
    "baseTicker": "MTCH",
    "rank": 47.3075,
    "description": "Match Group, Inc. engages in the provision of digital technologies. It operates through four segments: Tinder, Hinge, Evergreen and Emerging, and Match Group Asia. The company's portfolio of brands includes Tinder, Hinge, Match, Meetic, OkCupid, Pairs, Plenty Of Fish, Azar, BLK, and other brands, built to increase users' likelihood of connecting with others. Its services are available in over 40 languages to users worldwide. The company was incorporated in 1986 and is based in Dallas, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/EYj4JrkKHedifjTtRjAIMA/30Qs24GuvQxzJGmHFqqfb2z8l_YxCglBn7kcKB2LNmWks3AbbbJJJvnJRDH8cx9y_9XFoyDduqMgtmDOdEO7bj1jzmuP3UDDP4mA976r_xSN6odXJg80N0hus7s-LZpuVMePQQwTKqMJYAYaDwBLMqCcOfhtwRDEjeVLqUYdSVyQrQovXNjo4lwaEgefh8Nu/ZJa5nn5JZO5HeJsk-lCMSeQOfdlE_EA4KTbRU1CKLa8",
    "price": 30.59,
    "prevClose": 30.3,
    "absReturn": 0.28999999999999915
  },
  {
    "fullTicker": "HUBS:USA",
    "baseTicker": "HUBS",
    "rank": 50.713,
    "description": "HubSpot, Inc., together with its subsidiaries, provides a cloud-based customer relationship management (CRM) platform for businesses in the Americas, Europe, and the Asia Pacific. The company's CRM platform includes Marketing Hub, a toolset for marketing automation and email, social media, SEO, and reporting and analytics; Sales Hub offers email templates and tracking, conversations and live chat, meeting and call scheduling, lead and website visit alerts, lead scoring, sales automation, pipeline management, quoting, forecasting, and reporting; Service Hub, a service software designed to help businesses manage, respond, and connect with customers; and Content Hub enables businesses to create new and edit existing web content. It offers Operations Hub, which is designed for customer data to automate business processes, data cleanup, and provide customer insights and connections; and Commerce Hub, a B2B commerce suite. In addition, the company provides professional services to educate and train customers on how to utilize its CRM platform; and customer success, as well as phone and/or email and chat-based support services. It serves mid-market business-to-business companies. The company was incorporated in 2005 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/JwUATQ7CC1L7YaZUF_TL9g/KpSKMRG7EUwle6z9svIcZny0Sl4-Rhh4zHEu1GPWBQ32gK-NI-EjO446_hUjjM9tLGiYHfMXozS1R153_Jn26zgJknp3c5IOzPtKmlf2oA5BkohwirXyY-C22DJM48aEl8HGvLuWgibxO3WTyI2m4p0UBabIHR6q-L86Ng5a4nw/yleYjfJIbFgWWKln7B7wu_VY4jtJRBUZ2mehI6BbI34",
    "price": 534.51,
    "prevClose": 544.46,
    "absReturn": -9.950000000000045
  },
  {
    "fullTicker": "WMB:USA",
    "baseTicker": "WMB",
    "rank": 61.852,
    "description": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of America, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of America segment comprises Transco, NWP, and MountainWest interstate natural gas pipelines, and their related natural gas storage facilities, as well as natural gas gathering and processing; and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment consists of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, the Mid-Continent region that includes the Anadarko and Permian basins, and the DJ Basin of Colorado; and operates natural gas liquid (NGL) fractionation and storage assets in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; asset management services; and transports and markets NGLs. The company owns and operates approximately 33,000 miles of pipelines. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/UkBKN5MWjed7t8prNsZTrg/SRSjlx0Cn7vF9hc6vCsTyjV_H4fdc8zR1kg6rvTkvII2y6AY70KEgB_FnZiNnXrC_CdgRrvXI0NAx-VwYX8wAahkW9W9e_eJkFJHhKozBNtgVfgSJFBzawW_8WDnUL-bZVPlnqhKsaG2wC47CDcOIgu5yOK--ZngJQe9Lz7WWmk/gMsfMXr-WmoZAWFhcSBEB5uewwiJgwBbVLZOAg5Px2Y",
    "price": 60.49,
    "prevClose": 59.12,
    "absReturn": 1.3700000000000045
  },
  {
    "fullTicker": "CRMT:USA",
    "baseTicker": "CRMT",
    "rank": 83.5095,
    "description": "America's Car-Mart, Inc., through its subsidiaries, operates as an automotive retailer for the used car market in the United States. It primarily sells older model used vehicles and provides financing for its customers. The company was founded in 1981 and is headquartered in Rogers, Arkansas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/FXqiOcqYvcdudOOwXOKq8g/qoHfng5i4PoJDD77CCmYTyEImNYeIzRbxM1uhXmUlB9l71fcj8WRUZ84-G0WsJDofN2GKE6t7lDFwdHnzOszHCswtlq3x_8h5CGXTU0dfDyx_Vcd7MObuJypQ7bvjK1lkFDLtoBXnABLiFg4BbO1lM6bEwrgTsxtkSiRXl63LmcqRdYcEV7HemsovM1JZ1s0/0n9F-Yt02asWpV8168da4pE4_xFWEuxJRpr2le2lYto",
    "price": 51.3,
    "prevClose": 48.88,
    "absReturn": 2.4199999999999946
  },
  {
    "fullTicker": "PPIH:USA",
    "baseTicker": "PPIH",
    "rank": 98.4399,
    "description": "Perma-Pipe International Holdings, Inc., together with its subsidiaries, engineers, designs, manufactures, and sells specialty piping and leak detection systems. It offers insulated and jacketed district heating and cooling piping systems for energy distribution from central energy plants to various locations; and primary and secondary containment piping systems for transporting chemicals, hazardous fluids, and petroleum products, as well as engages in the coating and insulation of oil and gas gathering and transmission pipelines. The company also offers liquid and powder based anti-corrosion coatings for external and internal surfaces of steel pipe, including shapes like bends, reducers, tees, and other spools/fittings that is used in pipelines for the transportation of oil and gas products and potable water. It has operations in the United States, Canada, the Middle East, North Africa, Europe, India, and internationally. The company was formerly known as MFRI, Inc. and changed its name to Perma-Pipe International Holdings, Inc. in March 2017. Perma-Pipe International Holdings, Inc. was incorporated in 1993 and is headquartered in Spring, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750514400000/pOKE-hf4CCDRIPq22FbTBA/gvo8VWyJEQBWgEGV4qCQ5-amH6QdQOJCKTYpdc0mYzP0z9v6TUOfA_CJHHcuDe0Sl3SR_74eY6-wtGoYWAGr9bngIzQTjUHhdFWUz1BLwGMJvsSdx2poXo0ZwcVrMfbBA8Br9AjaiS11usX4z2MFONpfairH_IHbytfAFGFGOEOOKjXkvETXhcp-xD1iUkK99eEr9HWEutekwY4tu67WIQ/EGNE-VIUpbCAI1rEbLI1Qb7z4bst6p7l5hqS4dwGbBc",
    "price": 20.695,
    "prevClose": 21.2,
    "absReturn": -0.504999999999999
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 594.28,
    "prevClose": 595.67474973375,
    "absReturn": -1.394749733750018
  }
]