[
  {
    "fullTicker": "ARBE:USA",
    "baseTicker": "ARBE",
    "rank": 3.6285,
    "description": "Arbe Robotics Ltd., a semiconductor company, provides 4D imaging radar solutions for tier 1 automotive suppliers and automotive manufacturers in China, Hong Kong, Sweden, Germany, the United States, Israel, and internationally. It offers 4D imaging radar chipset solutions that address the core issues that have caused autonomous vehicle and autopilot accidents, such as detecting stationary objects, identifying vulnerable road users, operation at poor lighting conditions, and eliminating false alarms without radar ambiguities. The company was founded in 2015 and is headquartered in Tel Aviv-Yafo, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/2CmhpBNQ2EqdvS77_psVug/T0MenPlwfEiv6YYv_J2idiOTWiPGOQL0JqHeJX_mR3ZthFTrDed_tAtPACDrMzBAeoKtmEAfA11tkTHAT00aTjHHjPUSV1Lim6kINwqq9eiWgTB6BmbGkcl35rXnoIdeoMkW6QSCpyYyD_EgCvHjQjYa8extjgbZeAKkNL3OfhiwJXVwd4hjP2ynWkOZE08p/fgGrar1_uKgVgeielYNtRJd_j8eXqU749FatE20z0i4",
    "price": 1.375,
    "prevClose": 1.37,
    "absReturn": 0.004999999999999893
  },
  {
    "fullTicker": "COGT:USA",
    "baseTicker": "COGT",
    "rank": 8.3888,
    "description": "Cogent Biosciences, Inc., a biotechnology company, focuses on developing precision therapies for genetically defined diseases. Its lead product candidate includes bezuclastinib (CGT9486), a selective tyrosine kinase inhibitor in Phase 3 trial designed to target mutations within the KIT receptor tyrosine kinase, including KIT D816V mutation that drives systemic mastocytosis, as well as other mutations in KIT exon 17, which are found in patients with advanced gastrointestinal stromal tumors. The company also develops CGT4859, a reversible and selective fibroblast growth factor receptor 2 inhibitor in Phase 1 trial for patients with documented FGFR mutations, including advanced cholangiocarcinoma. It has a licensing agreement with Plexxikon Inc. for the research, development, and commercialization of bezuclastinib. Cogent Biosciences, Inc. is headquartered in Waltham, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/PhqztiJ9YDze2bjyx4rrHA/ryi6UdpjupZpHd6fhOPXY7AUVPIzVw1Xeyg_8aYF6Vi4vC78Woa7G63LXeQVpn7Z-5Av5CHnEClDukzOvjHFxVGnIHbZT3LDOolrP9_xnZ20REgYuug10waJYXtlA6GmAW9KjNUDoq2P92VUZ4DBk2hBkYcJLBx3T9iyF7l22T9O86NswmRSQLleYy2A6QCv/q8Ujl6lSFkEo4b9bdOopeTl8_gs8Dl_CyoyiDns_-o8",
    "price": 11.47,
    "prevClose": 12.05,
    "absReturn": -0.5800000000000001
  },
  {
    "fullTicker": "ADMA:USA",
    "baseTicker": "ADMA",
    "rank": 14.4308,
    "description": "ADMA Biologics, Inc., a commercial biopharmaceutical company, engages in developing, manufacturing, and marketing specialty plasma-derived biologics for the treatment of immune deficiencies and infectious diseases in the United States and internationally. The company offers BIVIGAM, an intravenous immune globulin (IVIG) product indicated for the treatment of primary humoral immunodeficiency (PI); ASCENIV, an IVIG product for the treatment of PI; and Nabi-HB, a human polyclonal antibody product for the treatment of acute exposure to blood containing Hepatitis B surface antigen and other listed exposures to Hepatitis B. It also develops a pipeline of plasma-derived therapeutics. In addition, the company operates source plasma collection facilities, including collections of source plasma, procurement of raw materials and packaging materials, and the testing of finished drug products. The company sells its products through independent distributors, drug wholesalers, specialty pharmacies, and other alternate site providers. ADMA Biologics, Inc. was incorporated in 2004 and is headquartered in Ramsey, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/m5QbcddqulDqaxU_HYm6pQ/F-5qNM6LIG4Oy4nqKl6CoMPXhMkH9rkfPwY7kcN9bTiwb_RZ7COndwsSGtW3n0AOkXg6t6fKphP6W2oUwyJ2dgqD83kBiKqhT6J-PuoXT27WZZwIH_qI5WjM64YcO3cZmlkK_UDXhFS6WBLfMgLuskOXna1gZtBruLGePah4ej4SZGyRMchtZMNXb0LSaJiL/74w1ql-h19VXq_ZYQw2RPfJZFJC1Pa-MRhnf6AttBaw",
    "price": 19.36,
    "prevClose": 19.91,
    "absReturn": -0.5500000000000007
  },
  {
    "fullTicker": "KNTK:USA",
    "baseTicker": "KNTK",
    "rank": 29.494,
    "description": "Kinetik Holdings Inc., through its subsidiaries, operates as a midstream company in the Texas Delaware Basin. It operates through two segments, Midstream Logistics and Pipeline Transportation. The company offers gathering, compression, processing, stabilization, treating, and storage services; transportation services through pipelines; and water gathering and disposal services for companies that produce natural gas, natural gas liquids (NGL), and crude oil. It also sells condensates, natural gas residue, and NGLs. Kinetik Holdings Inc. was founded in 2017 and is headquartered in Midland, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/UhpvfVDmbmSIF8K5W_fQDg/NUTKMwGIuHhGga5ZD0Xcg7JN1-hXbgXfCcsFIe9cwmqg9IVnRr36SLnRD2WWaOvMsROW9_vcTzsD6tLrBn4ZZXYtNkU0lho-3qY2W-YfZ9K51FMiBghMu2MdoDQKiPJeFLIZGGSzURQ2B7vRxlf0mfOcnmlpnCgTe21_4Nz45U_lzurCuRhuDT8EHWEKKyGD/3Zo1syVL9eypJR0H0p9zri-7Y7tSkAr5uDINoTnb7-Y",
    "price": 41.58,
    "prevClose": 43.11,
    "absReturn": -1.5300000000000011
  },
  {
    "fullTicker": "BCC:USA",
    "baseTicker": "BCC",
    "rank": 34.0546,
    "description": "Boise Cascade Company engages in manufacture and sale of engineered wood products (EWP) and plywood, and wholesale distribution of building materials in the United States and Canada. It operates through two segments, Wood Products and Building Materials Distribution. The Wood Products segment manufactures laminated veneer lumber and laminated beams used in headers and beams; I-joists for residential and commercial flooring and roofing systems, and other structural applications; structural, appearance, and industrial grade plywood panels; and ponderosa pine lumber and appearance grade boards. The Building Materials Distribution segment distributes a line of building materials, including oriented strand boards, plywood, and lumber; general line items, such as siding, composite decking, doors and millwork, metal products, insulation, and roofing; and EWP. It markets and sells its products to dealers, home improvement centers, wholesalers, specialty distributors, and industrial converters for use in the construction of new residential housing, repair-and-remodeling of existing housing, construction of light industrial and commercial buildings, and other industrial applications through warehouse and direct sales. Boise Cascade Company was incorporated in 2004 and is headquartered in Boise, Idaho.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/l6cfN3TjG-1if9nQQj4lOw/_yuN8P2zV8Pu0n5HPYN-iPrVYqConM4isLfd6QWcHWCcldvbZnHK6ZBG0jcnRdOH40k4a3hdjyls7FvAhKFhyu9_6M5dD99Ln0e_o8bNatnKv2kwknO8UyqLywfO1hSbFUTyz-d1E9snWLdbq7s7fsFbqUYPCqv_UQ-U4Bf37rU/7foX33DHdpNk229R4Zz5aJkaNPv9q-3BO8YGMUv7N6g",
    "price": 86.31,
    "prevClose": 82.71,
    "absReturn": 3.6000000000000085
  },
  {
    "fullTicker": "RMTI:USA",
    "baseTicker": "RMTI",
    "rank": 51.0486,
    "description": "Rockwell Medical, Inc., together with its subsidiaries, operates as a healthcare company that engages in the development, manufacture, commercialization, and distribution of various hemodialysis products for dialysis providers worldwide. Also, the company manufactures, sells, delivers, and distributes hemodialysis concentrates, such as CitraPure citric acid concentrate, Dri-Sate dry acid concentrate, RenalPure liquid acid concentrate, dry acid concentrate mixer, and RenalPure and SteriLyte powder bicarbonate concentrate; and ancillary products, including testing supplies, 5% acetic acid cleaning solution, 5% and 2% citric acid descaler, filtration salts, and other items used by hemodialysis providers. The company's hemodialysis concentrate products are used to sustain patient's life by removing toxins and balancing electrolytes in a dialysis patient's bloodstream. The company serves to hemodialysis clinics. Rockwell Medical, Inc. was formerly known as Rockwell Medical Technologies, Inc. and changed its name to Rockwell Medical, Inc. in June 2012. Rockwell Medical, Inc. was incorporated in 1996 and is headquartered in Wixom, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/15b-CX71UuPrvw3p5Q7sYg/qJejfjEvg8zXM9E93GHQrd0GUNRLfGT4TUQdIX5FCt4aY4x7cj73ngyQsKYY1p319glxEK6UEDC0xJDNg8N5YWCvUKRbpILAfRI2FX8JdnBK8k18WWYeKeA7czgqbj9VT_Aidr-NhaQzs07EBBy8sdnETOgXdX728u5LNKkL6gM2pJK8irkNhZ_58l381R5O/tpC49klrW5gSHOnn92inoeQqXJlhOpTIibCJqqLzvOU",
    "price": 0.9846,
    "prevClose": 0.992,
    "absReturn": -0.007399999999999962
  },
  {
    "fullTicker": "SLP:USA",
    "baseTicker": "SLP",
    "rank": 57.6232,
    "description": "Simulations Plus, Inc. develops drug discovery and development software for modeling and simulation, and prediction of molecular properties utilizing artificial intelligence and machine learning based technology worldwide. The company operates through Software and Services segments. It also offers GastroPlus, which simulates the absorption and drug interaction of compounds administered to humans and animals; and DDDPlus and MembranePlus simulation products. In addition, the company provides products based on mechanistic and mathematical models, such as DILIsym, NAFLDsym, ILDsym, IPFsym, RENAsym, MITOsym, and OBESITYsym products. Further, it offers Absorption, Distribution, Metabolism, Excretion, and Toxicity Predictor for chemistry-based computer program that takes molecular structures as inputs and predicts their properties; and MedChem Designer, as well as MonolixSuite products for modeling and simulation that allows for population analyses, rapid clinical trial data analyses, and regulatory submissions. Additionally, the company provides clinical-pharmacology-based consulting services, which includes population pharmacokinetic and pharmacodynamic modeling, exposure-response analyses, clinical trial simulations, data programming, and technical writing services in support of regulatory submissions; and early drug discovery services. Furthermore, it offers creative and insightful consulting services to support its quantitative systems pharmacology and other modeling systems. The company serves pharmaceutical, biotechnology, agrochemical, cosmetics, and food industry companies, as well as academic and regulatory agencies. Simulations Plus, Inc. was incorporated in 1996 and is headquartered in Lancaster, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/S7-BjZXYb9DkMQLpqE2Pzg/AjycrKHImoMutZbEuiJMBQkVIM69MTpIQjbk6fmeqPvWe_dhUS9ZlqyvEj0a4tq-n_TQQcPTpnjR8uACBl4xx-ONwRlIwcuHUm8IjCHN9KL_zz78zVcZMjAmF9Kceo1IHGHP2AClgs9JGhbyDrhQF9J1dm9ewJIDDcgeXZdFUN0/1swmqgTckn9JurBn1jlxjp-yLiMFvyY0rFpddMEtfyM",
    "price": 12.935,
    "prevClose": 12.99,
    "absReturn": -0.054999999999999716
  },
  {
    "fullTicker": "ZWS:USA",
    "baseTicker": "ZWS",
    "rank": 67.8262,
    "description": "Zurn Elkay Water Solutions Corporation engages in design, procurement, manufacture, and marketing of water management solutions in the United States, Canada, and internationally. It offers water dispensing and filtration products, such as filtered bottle filling stations, water fountains and water dispensers, and filtered faucets under the Elkay and Halsey Taylor brand names; filtered units including water filters; and water safety and control products, such as backflow preventers, fire system valves, pressure reducing valves, thermostatic mixing valves, PEX pipings, fittings, and installation tools under the Zurn and Wilkins brand names. The company also provides flow systems products comprising point drains, hydrants, fixture carrier systems, and chemical drainage systems; and oil and grease interceptors and separators, acid neutralization systems, and remote monitoring systems under the Zurn, Green Turtle, and Wade brands. In addition, it offers sensor-operated flush valves under the AquaSense, Aquaflush, and AquaVantage brands; heavy-duty commercial faucets under the AquaSpec brand; flush valves and faucets under the Hydro X Power brand name; water conserving fixtures under the EcoVantage and Zurn One brands; stainless steel, quartz, fireclay-ceramic, and cast iron sinks under the Elkay brand name; stainless steel sinks and plumbing fixtures under the Just brand; restroom partition systems and lockers under the Hadrian brand name; and hand dryers. The company offers its products to institutional, commercial, waterworks, and residential end markets through independent sales representatives, plumbing wholesalers, and industry-specific distributors in the waterworks, foodservice, industrial, janitorial, sanitation, and sitework industries. The company was formerly known as Zurn Water Solutions Corporation and changed its name to Zurn Elkay Water Solutions Corporation in July 2022. Zurn Elkay Water Solutions Corporation was founded in 1891 and is based in Milwaukee, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/mWmFDE9XNIv-EZMpZkpqJg/A0DL9AILqK2WuJwk_nzdN4ehHmqQKIVe6bm0WMiVmI91HjF9dupsnj_72q-w6-BJr-1JfcylV2NhALAZ9ocsdo1XdQQKUj-VqEGibK8-TwEOFfeRkuusWrJF1FiKiHstKmbQGTzpvwGlbGwru6REei_fOMvCI9midd8p9sJlxOmL9nKr0J3gtp9NS19SH5nu/r2zkFp1YqteFajOqC9i9FqlNP8sSeH6K9e-jxIRgils",
    "price": 44.28,
    "prevClose": 43.98,
    "absReturn": 0.30000000000000426
  },
  {
    "fullTicker": "HALO:USA",
    "baseTicker": "HALO",
    "rank": 82.723,
    "description": "Halozyme Therapeutics, Inc., a biopharmaceutical company, researches, develops, and commercializes of proprietary enzymes and devices in the United States and internationally. The company's products are based on the patented recombinant human hyaluronidase enzyme (rHuPH20) that enables delivery of injectable biologics, such as monoclonal antibodies and other therapeutic molecules, as well as small molecules and fluids. It offers Hylenex recombinant, a formulation of rHuPH20 that facilitates subcutaneous (SC) administration to enhance the dispersion and absorption of other injected drugs in SC urography and to enhance resorption of radiopaque agents; XYOSTED, an injection for SC administration of testosterone replacement therapy; and ATRS-1902, a proprietary drug device combination product. The company offers Herceptin (trastuzumab), Herceptin Hylecta, and Phesgo to treat breast cancer; Mabthera SC for chronic lymphocytic leukemia treatment; HYQVIA to treat primary immunodeficiency disorders; Ocrevus (ocrelizumab) for multiple sclerosis; N6LS and cabotegravir to treat HIV; DARZALEX to treat amyloidosis, and smoldering and multiple myeloma; Epinephrine Injection to treat allergic reactions; nivolumab and relatlimab to treat solid tumors; teriparatide injections; OTREXUP, an SC methotrexate injection for severe active rheumatoid arthritis, severe recalcitrant psoriasis, and active polyarticular juvenile idiopathic arthritis; ARGX-113; and ARGX-117 to treat severe autoimmune diseases in multifocal motor neuropathy. The company has collaborations and licensing agreements with F. Hoffmann-La Roche, Ltd. and Hoffmann-La Roche, Inc.; Takeda Pharmaceuticals International AG and Baxalta US Inc; Pfizer Inc.; Janssen Biotech, Inc.; AbbVie, Inc.; Eli Lilly and Company; Bristol Myers Squibb Company; argenx BVBA; ViiV Healthcare; Chugai Pharmaceutical Co., Ltd.; and Acumen Pharmaceuticals, Inc. The company was founded in 1998 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/gMHXeX_4DevGJ5m0h8XCgw/3h10KxzyaI11igeM4nSF_9DlUhVxFIlQZBWK3ZD_PWFLHzNsesfMY-Bv99dIsTcYUm_gyR1O5kZ2iiyAL3UFklAxucV0lMYws_wThucaf-AyyWTBCB02PYsHAagVeXMaqgle6Fq8NEI7ywPiyks2RsCMgyvi_zordZU9guZ8ibtzG4R-pilkbftcXkN9UVUr/xcqkKUKfv1UdHi8YvWmbiXQrl6ARhp_5L7p40oZkTnA",
    "price": 59.545,
    "prevClose": 59.99,
    "absReturn": -0.4450000000000003
  },
  {
    "fullTicker": "SPOK:USA",
    "baseTicker": "SPOK",
    "rank": 95.6391,
    "description": "Spok Holdings, Inc., through its subsidiary, Spok, Inc., provides healthcare communication solutions in the United States, Europe, Canada, Australia, Asia, and the Middle East. The company's products and services enhance workflows for clinicians and support administrative compliance. It delivers clinical information to care teams when and where it matters to enhance patient outcomes; and provides GenA Pager, a one-way alphanumeric pager. The company offers subscriptions to one-way or two-way messaging services, as well as alphanumeric pagers that are configurable to support unencrypted or encrypted operation; and ancillary services, such as voicemail, and equipment loss or maintenance protection services, as well as sells devices to resellers who lease or resell them to their subscribers. It provides Spok Care Connect suite products for contact centers, clinical alerting and notification, mobile communications and messaging, and public safety notifications. In addition, the company provides professional, software license updates, and product support services, as well as sells third-party equipment. It serves businesses, professionals, management personnel, medical personnel, field sales personnel and service forces, members of the construction industry and construction trades, real estate brokers and developers, sales and services organizations, specialty trade organizations, manufacturing organizations, and government agencies. The company was formerly known as USA Mobility, Inc. and changed its name to Spok Holdings, Inc. in July 2014. Spok Holdings, Inc. was founded in 1986 and is headquartered in Plano, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754424000000/vSVbE_f6bnGOVHpHwf1u3Q/4IeGn-GggYVkdDk85tM0f8t-DfkvkiOJOB2lrOq_GaOSLUvEP3w-ARlIZpTAzU-7Viwi6LikMn-0SqmiI7qAnAiPjeEePbdMgJWxA0OR2_dD2zWYYxNwWi-qJeSbgjfmSM83N5y4sw4AC64hwRZsK1CEv2lDAcOyDvfordJ0XxdwSEwnkj5klMLcAPuruRTk/g_2g-nTFqrUlJvvU1SWJ0K1JbVPLn_AGWwUzWJ1NoxI",
    "price": 18.29,
    "prevClose": 18.58,
    "absReturn": -0.28999999999999915
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 628.04,
    "prevClose": 631.17,
    "absReturn": -3.1299999999999955
  }
]