[
  {
    "fullTicker": "SBET:USA",
    "baseTicker": "SBET",
    "rank": 0.4237,
    "description": "SharpLink Gaming, Inc. operates as an online technology company that connects sports fans, leagues, and sports websites to sports betting and iGaming content. The company operates through four segments: Affiliate Marketing Services  United States, Affiliate Marketing Services  International, Sports Gaming Client Services, and SportsHub Games Network. It operates a performance marketing platform, which owns and operates state-specific web domains to attract, acquire, and drive local sports betting and casino traffic directly to the company's sportsbook and casino partners, which are licensed to operate in each respective state; and offers sports betting data to sports media publishers. It also provides iGaming and affiliate marketing network, which focuses on delivering quality traffic and player acquisitions, and retention and conversions to global iGaming operator partners worldwide; and development, hosting, operations, maintenance, and service of free-to-play games and contests. In addition, the company owns and operates various real-money fantasy sports and sports simulation games and mobile apps on its platform; and is licensed or authorized to operate in every state in the United States, where fantasy sports play is legal and in which SportsHub has elected to operate based on the financial viability. SharpLink Gaming, Inc. was founded in 2019 and is headquartered in Minneapolis, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/8sQ1HXSHuDsF2i8OiwiQKg/-lKkNwgv4VKhScKQZC_7XS7t86Aasqw7rdPxrDuxJnVWLqyJocfxaNyVEa4C5TGyI_gLNgJLw7YiWPsw2PpH_FKEMtXQr729Oo3O5kJ96POpizXcBzSE53TUljhv_UyOwXEXd8GI08K5mEbCYZlVv_e5i0gp5AfkBmwew9MPttf5RshBYsPNOe6ku87SIqEg/IVqeWa3zV8vGLSpAJT8Z7N_uVvbNH7IBa02jYPQL9PY",
    "price": 9.24,
    "prevClose": 9.57,
    "absReturn": -0.33000000000000007
  },
  {
    "fullTicker": "CING:USA",
    "baseTicker": "CING",
    "rank": 11.5855,
    "description": "Cingulate Inc., a biopharmaceutical company, focuses on the development of pharmaceutical products for the treatment of attention deficit/hyperactivity disorder and anxiety in the United States. The company's stimulant medications are CTx-1301 (dexmethylphenidate), which is in phase 3 clinical trial, as well as CTx-1302 (dextroamphetamine), which is in investigational new drug application development for the treatment of attention deficit/hyperactivity disorder intended for children, adolescents, and adults. It also focuses on developing CTx-2103 that is in a formulation stage for the treatment of anxiety. The company was founded in 2012 and is headquartered in Kansas City, Kansas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/MBxBmj08d6kCJ9TjMU80qA/d1CXX_ic1CV1zoZ7KkrZRU85_gLTi14nHrZWZz51SKWYkYS29jPVt2RGJTfdafaxuzwHG854s7mzo83WATZy4i9D5gwwtJDPVy4lK4_DfMIsukL_yJWrj5Rjnp0UZXLoYDu2djKFc98bAZfNiSkw0GjGGu67yxMufEiKiEpaULM/eK7fulFnQjuwvzA4i3by6WgVD3q9wGQ45KO_DsKXuls",
    "price": 4.06,
    "prevClose": 4.18,
    "absReturn": -0.1200000000000001
  },
  {
    "fullTicker": "UWMC:USA",
    "baseTicker": "UWMC",
    "rank": 16.9627,
    "description": "UWM Holdings Corporation engages in the origination, sale, and servicing residential mortgage lending in the United States. The company offers mortgage loans through wholesale channel. It originates primarily conforming and government loans. UWM Holdings Corporation was founded in 1986 and is headquartered in Pontiac, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/nj2RVK77rik2ifDrD85ZSA/J1-21NbCCmtyu7Vqo5PdyrJNUJ4tAbxKLJJpoan6nheyZcJS2WW-Lm-KDUSMIHF46RrICAdiSivV5OOsCqHfdVINnWJMpadPdsS712nokpJ5-8W46Sv56AjuGpxeYaQx3yGqlg_vWM9dpB0JtupFd-XI6oOYVinVsxmXQYUhOS34cAWmeO7tXR2kEW2ujNpb/HHql5C796hU5eGzkgyz1f_vcGj-r5FIi9iUdbTOZST8",
    "price": 4.63,
    "prevClose": 4.87,
    "absReturn": -0.2400000000000002
  },
  {
    "fullTicker": "UROY:USA",
    "baseTicker": "UROY",
    "rank": 30.3894,
    "description": "Uranium Royalty Corp. operates as a pure-play uranium royalty company. The company acquires, accumulates, and manages a portfolio of geographically diversified uranium interests. Uranium Royalty Corp. has royalty interests in the McArthur River, Cigar Lake / Waterbury Lake, Roughrider, Russell Lake, Russell Lake south, and Dawn Lake projects in Saskatchewan, Canada; Anderson and San Rafael projects in Arizona; Lance and Reno Creek projects in Wyoming; Church Rock and Roca Honda projects in New Mexico; Dewey-Burdock project in South Dakota; Slick Rock project in Colorado; Langer Heinrich project in Namibia; and Michelin project in Newfoundland and Labrador, Canada; Energy Queen and Whirlwind project in Utah; and Workman Creek projects in Arizona. The company was incorporated in 2017 and is headquartered in Vancouver, Canada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/__JORAaKV7LNqNuQX05Qew/8bb4r04ru3PtcEKZYYrD1VsDXxLPxz62L5kmkZHHkV5h_oSDHQvaLePOiXCVw4ILlCkg6pfBSdASSfebwSxgGuXfOZ_4dVQDxR-V-gy5Ca4dLkTcT3fZcxZdR04ARAxn2WlxXH0NGoP9I2RLvF2EnrID9NMlyhXWx2sJtiFdEbx09A8QzP-aQmkr4ZYngJ-_/NkXinAv7DfLpY_jh1OkEZaVGnUY0GIK-k8hk4o38jxM",
    "price": 3.72,
    "prevClose": 3.73,
    "absReturn": -0.009999999999999787
  },
  {
    "fullTicker": "RH:USA",
    "baseTicker": "RH",
    "rank": 36.4836,
    "description": "RH, together with its subsidiaries, operates as a retailer in the home furnishings market. The company offers products in various categories, including furniture, lighting, textiles, bathware, décor, outdoor and garden, baby, child, and teen furnishings. It provides its products through rh.com, rhbabyandchild.com, rhteen.com, rhmodern.com, and waterworks.com online channels, as well as operates RH Galleries, RH outlet stores, RH Guesthouse, and Waterworks showrooms in the United States, Canada, the United Kingdom, and Germany. The company was formerly known as Restoration Hardware Holdings, Inc. and changed its name to RH in January 2017. RH was incorporated in 2011 and is headquartered in Corte Madera, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/lpetyOL0EClewiJL6hDkKw/e8xnXO5CXQQ-3chPeeMWoO-bm6u3rywA4YgIK0xT7klSkhAQ-NGcQuJXm8A6CP9Ts75FIXMFk6iCC3nhGVyyRNhMjc1oayU7PcnQEisFRrxylmDZU1xnZvzOIecbd9J1jw6LCLi0sti5_6WobYLltYFV--BWmGARGetbIRPYRPk/SqKYuXkscmEjwdDX3kTOXLoZtgelOeo6pqoovABzaxE",
    "price": 182.37,
    "prevClose": 179.49,
    "absReturn": 2.8799999999999955
  },
  {
    "fullTicker": "PII:USA",
    "baseTicker": "PII",
    "rank": 50.497,
    "description": "Polaris Inc. designs, engineers, manufactures, and markets powersports vehicles in the United States, Canada, and internationally. It operates through three segments: Off-Road, On-Road, and Marine. The company offers off-road vehicles (ORVs), including all-terrain vehicles and side-by-side vehicles; military and commercial ORVs; snowmobiles; motorcycles; and moto-roadsters, quadricycles, and boats. It also provides ORV accessories comprising winches, bumper/brushguards, plows, racks, wheels and tires, pull-behinds, cab systems, lighting and audio systems, cargo box accessories, and tracks; snowmobile accessories, which include covers, traction products, reverse kits, electric starters, tracks, bags, windshields, replacement parts, and lubricants; and motorcycle accessories, such as saddle bags, handlebars, backrests, exhausts, windshields, seats, oil, and various chrome accessories. In addition, the company offers light duty hauling and passenger vehicles; gear and apparel, such as helmets, goggles, jackets, gloves, boots, bibs, hats, and pants; and pontoon and deck boats. It provides its products through dealers and distributors, and online; and retail and e-commerce marketplaces. The company was formerly known as Polaris Industries Inc. Polaris Inc. was founded in 1945 and is headquartered in Medina, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/DyjcLsaRGw7eKfz6H3rfAg/3NeJaw-brOAJxnX5MGJ5k2zDFh0mmw07-5PGKWoMTTNKQa-oBF_a2CWqcVzHRrUbIrJGn5jT6rBpldd9PTfuipm9jzsP18YFNZNmC-UM-DhEG5a9XToi7kwJ30i6Fx9e-lRLBstvh5SpQpCxcZzKi9vxwLTfJNb7YFEVujLX1T0/bCfURrnYhVCTPsbzrA2aB2dhkdsJ7bhS0Gk8YmYE164",
    "price": 67.12,
    "prevClose": 68.65,
    "absReturn": -1.5300000000000011
  },
  {
    "fullTicker": "QSR:USA",
    "baseTicker": "QSR",
    "rank": 60.3063,
    "description": "Restaurant Brands International Inc. operates as a quick-service restaurant company in Canada, the United States, and internationally. It operates through six segments: Tim Hortons, Burger King, Popeyes Louisiana Kitchen, Firehouse Subs, International, and Restaurant Holdings. The company owns and franchises Tim Hortons, a coffee and baked good restaurant chain that offers beverages, sandwiches, wraps, flatbread pizzas, and others; Burger King, a quick service hamburger restaurant chain that offers flame-grilled hamburgers, chicken, and other sandwiches; Popeyes, a quick service chicken concept that offers a Louisiana style menu, including fried bone-in chicken, chicken sandwiches, chicken tenders, wings, fried shrimp, and regional items; and Firehouse Subs, which offers subs with meats and cheese, as well as chopped salads, chili, soups, soft drinks, and other sides. Restaurant Brands International Inc. was founded in 1954 and is based in Toronto, Canada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/RTrpvus5hejK7K7CteHh0A/LeeUaKxCh6aU2AXer-3AB5X7Et-9m-WbPr2AiAZ_gmAO7KAWUDUgm4IiCge3in4AWJ3aoqAUMATTHynEBgYKHK7Lg8jzEujw9h2i7qsliawl0J2ZUIj_LrCDuWbgRAL2hdfuhcpW3I3J-Mgc_DUE-rRjmnBPjZhuELDVlFvC_2AsuQqucLX0PPq3hGd7MAGILHQ8QNj_gldwwdiosb3ruw/DjJUNm3CIb-78tQqR86jngu1KmktA2xn4X2CagR0yug",
    "price": 68.86,
    "prevClose": 69.7024150834772,
    "absReturn": -0.8424150834772064
  },
  {
    "fullTicker": "MHK:USA",
    "baseTicker": "MHK",
    "rank": 67.6226,
    "description": "Mohawk Industries, Inc. designs, manufactures, sources, distributes, and markets flooring products for residential and commercial remodeling, and new construction channels in the United States, Europe, Latin America, and internationally. It operates through three segments: Global Ceramic, Flooring North America, and Flooring Rest of the World. The company provides ceramic, porcelain, and natural stone tiles products for floor and wall applications; natural stones, porcelain slabs, and quartz countertops, as well as installation materials; floor covering products comprising broadloom carpets, carpet tiles, rugs and mats, carpet pads, laminates, medium-density fiberboards, wood floorings, vinyl tiles, and sheet vinyl; and roofing panels, insulation boards, mezzanine flooring products, medium-density fiberboard, decorative panels, and chipboards. It also licenses its intellectual property to flooring manufacturers. The company sells its products under the American Olean, Daltile, Decortiles, Eliane, Elizabeth, Lentex Flooring, EmilGroup, KAI, Kerama Marazzi, Marazzi, Ragno, Aladdin Commercial, Durkan, Foss, IVC Resilient Design, Karastan, Mohawk, Mohawk Group, Mohawk Home, Pergo, Portico, Quick-Step, Feltex, GH Commercial, Godfrey Hirst, Hycraft, IVC Home, Lentex, Leoline, Moduleo, Redbook, Unilin, and Vitromex brands. It offers its products to home centers, company-owned service centers and stores, floor covering retailers, ceramic tile specialists, e-commerce retailers, residential builders, independent distributors, commercial contractors, and commercial end users. The company was incorporated in 1988 and is headquartered in Calhoun, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/42sPNFqr1Gv4kGnN1H_wFQ/NMkf7_sE_Wi_y42A3WqLGL7-2lCiSlD0o_25SZyZ5W4ZLoXCvbd0dfFQDqBzRuSnn6xa3ZfCX0L0qDqSUfXk3fVzzfIOquamO_ZPn3wGxwQy86n0bPIjW8qTYEXACYrh9riOYvi9mnES67fFxyfsR7-7YVpH8CbEpDz-KIfgM3EONcTULQItliBSudRFH-i1/Z_Mb7H0SbUjJDS83lvWCy_iJeNg6WWH5Pfziyhbn66E",
    "price": 108.93,
    "prevClose": 108.58,
    "absReturn": 0.3500000000000085
  },
  {
    "fullTicker": "ASYS:USA",
    "baseTicker": "ASYS",
    "rank": 81.082,
    "description": "Amtech Systems, Inc., together with its subsidiaries, manufactures and sells capital equipment and related consumables for use in fabricating silicon carbide, silicon power devices, digital and analog devices, power electronic and semiconductor packages, and electronic assemblies in the United States, Canada, Mexico, China, Malaysia, Taiwan, the Czech Republic, Austria, Germany, and internationally. It operates through Thermal Processing Solutions and Semiconductor Fabrication Solutions segments. The company offers thermal processing equipment for use in solder reflow operations for advanced semiconductor packaging and electronics assembly; high-temperature belt furnaces for use in producing power semiconductor packaging substrates and electronic components; and horizontal diffusion furnaces for use in wafer processing. It also provides double-sided wafer cleaning systems, entegrity head testers, substrate carriers, substrate polishing templates, substrate process chemicals, wafer processing lubricants, and coolants under the Entrepix, PR Hoffman, and Intersurface Dynamics brands. The company sells its products to semiconductor substrate, device, electronic assembly, and module manufacturers through sales personnel and a network of independent sales representatives and distributors. Amtech Systems, Inc. was founded in 1981 and is headquartered in Tempe, Arizona.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/4j2R9EfrON_5b1iu2LWw9Q/Bk8psYui80VrjLUqv6UVPnw0j22iFJaIzm-1P5T3OC46zXJBVmDOtBUx5Q0rT7x9vqfmgHwFPrtANZQMVRN7OWmjrbk4KWRx4nHVOiajOYZ13db1GFvpuuE4RqckpywsNBFfFsXGBwzGDYKde5xWbHmGxRfOIUGSq3uoZMoGhv3sBTO69a8PXzAy_3FpE7hM/tsIejScQr0vLD808J6jBiKLBSsy40JpjiCcYBcAnFvU",
    "price": 12.83,
    "prevClose": 12.76,
    "absReturn": 0.07000000000000028
  },
  {
    "fullTicker": "CMCL:USA",
    "baseTicker": "CMCL",
    "rank": 98.729,
    "description": "Caledonia Mining Corp. Plc is a company that operates in the Non-Energy Materials sector. The company holds a 49% interest in the Blanket Mine, an operating gold mine in Zimbabwe. Blanket Mine aims to increase gold production from 50,351 ounces in 2016 to around 80,000 ounces in 2021. Caledonia pays a quarterly dividend of 6.875 cents per share.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1766592000000/G1t5Tzn_bgXc8vkzQEtZ4A/dyX9BwsmSa16ftpQaqTaWBYfAOab1YhPb27O4iR8Xa2SmEbosQtcYNVUdP1tI-m7xCZTEE2q4LhjuQLqqcaETKkIg5G00Zf2FRhud96OO1OnsndizfoxClm2S9SlcYsHGiROJ9xdK8gBaV4qIZwDpjmXIcmmGVG5gFSCoFcol8GBuInZTC6XgVEkiRof7Cpj/ouTjQWIzF05H3WuDN40CRg8l3L3Yvhw1KJYsGwuzcq4",
    "price": 27.17,
    "prevClose": 26.57,
    "absReturn": 0.6000000000000014
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 687.905,
    "prevClose": 687.96,
    "absReturn": -0.055000000000063665
  }
]