[
  {
    "fullTicker": "AGRI:USA",
    "baseTicker": "AGRI",
    "rank": 4.8563,
    "description": "AgriFORCE Growing Systems Ltd., an agriculture-focused technology company, focuses on the development and commercialization of plant-based ingredients and products that deliver healthier and nutritious solutions. The company operates in AgriFORCE Solutions and AgriFORCE Brands segments. It offers controlled environment agriculture equipment; management advisory services; and holds intellectual property, as well as engages in the real estate holding and development business; and food products manufacturing activities. The company was formerly known as Canivate Growing Systems Ltd. and changed its name to AgriFORCE Growing Systems Ltd. in November 2019. AgriFORCE Growing Systems Ltd. was incorporated in 2017 and is headquartered in Vancouver, Canada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/53RR0KA-IMg6g2O9k4fmkA/-GOoSrdQqOeBWJKswW75RFrJctfJL6UTxWrNyhy132AkdO1FAcRAxvrSv67lvPzuHWeH2nLnUvdqxU-Z8SX0ue40zCLEYc8Bs4UpaviaKIFfw0GF1WUV2pwv4ia7p36OQyexmKTBGv0nFk15xk9BFA/uZXhLasgxQEIMcJEIm0E81eyoxi1CpFYq3_c4QoRuow",
    "price": 2.54,
    "prevClose": 2.44,
    "absReturn": 0.10000000000000009
  },
  {
    "fullTicker": "AREC:USA",
    "baseTicker": "AREC",
    "rank": 7.0036,
    "description": "American Resources Corporation engages in the production of production of rare earth and critical mineral concentrates electrification market and recycled metals. It also extracts and processes metallurgical carbon and iron ore for steelmaking; and aggregates and processes waste metal and steel products used in the recycling industries. The company was founded in 2006 and is headquartered in Fishers, Indiana.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/OXF6BFaDuslHfgBDA1w9Ww/DvVZNHP7kLYVG9CeNz_hqLIKVJGs9o0JX6yyg7DF3n80u99QsW1-4CxLbTHOXxQon2BgXrtoO5N1_V9rvMl1kJGPstPVgr1n7Q5qsneFbajHLL6eFPy0HQN73PU4wK3HkjoIoI_gkrJCSf6rwEENy_MTBdoAgEH4lybKOgqLx0suh0UPRVR72HFG8M0L7qdq/KOAAyLf5E0rMMZhdEbROvwurTLRyHDiSsX71K6mmcX8",
    "price": 1.825,
    "prevClose": 1.87,
    "absReturn": -0.04500000000000015
  },
  {
    "fullTicker": "VNDA:USA",
    "baseTicker": "VNDA",
    "rank": 21.143,
    "description": "Vanda Pharmaceuticals Inc., a biopharmaceutical company, focuses on the development and commercialization of therapies to address high unmet medical needs worldwide. The company's marketed products include HETLIOZ to treat non-24-hour sleep-wake disorders; Fanapt (iloperidone) for the treatment of bipolar I disorder and Parkinson's disease psychosis, as well as a long acting injectable (LAI) formulation to treat schizophrenia; and Ponvory for the treatment of psoriasis and ulcerative colitis. Its pipeline products include HETLIOZ (tasimelteon) to treat jet lag disorder, insomnia, delayed sleep phase disorder, sleep disturbances in autism spectrum disorder, and pediatric Non-24; Fanapt (iloperidone) a LAI formulation to treat schizophrenia; Bysanti for the acute treatment of bipolar I disorder, schizophrenia, and major depressive disorder; and Tradipitant (VLY-686), a small molecule neurokinin-1 receptor (NK-1R) antagonist to treat gastroparesis, motion sickness, and atopic dermatitis. The company's pipeline products also include Imsidolimab, an IL-36R antagonist, for the treatment of generalized pustular psoriasis; VTR-297, a small molecule histone deacetylase inhibitor to treat hematologic malignancies and with potential use as a treatment for various oncology indications; VQW-765, a small molecule nicotinic acetylcholine receptor partial agonist to treat performance anxiety and psychiatric disorders. In addition, it offers a portfolio of cystic fibrosis transmembrane conductance regulator activators and inhibitors that include VSJ-110 for the treatment of dry eye and ocular inflammation; VPO-227 for the treatment of secretory diarrhea disorders comprising cholera; Antisense oligonucleotide molecules, including VCA-894A for the treatment of Charcot-Marie-Tooth Disease and Type 2S (CMT2S); and VGT-1849A for the treatment of polycythemia vera. Vanda Pharmaceuticals Inc. was incorporated in 2002 and is headquartered in Washington, the District of Columbia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/j2ZYfM96peLEIhaC_Ytw9g/Vvx-Fpv4_PRCJ1-92rqpjvr8nS9iPd6W9VJDRQev3NEEKc190zFcr4gKcKPZbUfAgpsvQ8B9bR1omGqscENqh1ngD9i8tgZXo7AqGznAstqjCBwQKWuUJuf-XDEYEeRp3wtp2vHO8Qx3koKdCHhWpHG-XRZrg9P9hIpfF1yBZJfETaUOsdwGGYGPlPshQOA5/95C81FR4u2SkfvowuQ_i-GDeolfIx5JFNB0JGLHD73E",
    "price": 4.615,
    "prevClose": 4.64,
    "absReturn": -0.024999999999999467
  },
  {
    "fullTicker": "VANI:USA",
    "baseTicker": "VANI",
    "rank": 23.1417,
    "description": "Vivani Medical, Inc., a preclinical stage biopharmaceutical company, engages in the development of miniaturized and subdermal implants that treat chronic diseases. The company uses its NanoPortal implant technology to develop and potentially commercialize drug implant candidates in the treatment of chronic disease, medication non-adherence. Its pipeline includes NPM-115, a high-dose exenatide implant candidate is in preclinical stage development for the treatment of chronic weight management in patients with obesity or overweight; NPM-119, an exenatide implant candidate is in preclinical stage development for the treatment of patients with type 2 diabetes; NPM-139, a miniature, subdermal GLP-1 implant in development for chronic weight management; and OKV-119, an exenatide implant is under development for metabolic diseases in cats including for the treatment of obesity and diabetes. The company is headquartered in Alameda, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/9uG-vPANrrRBNhaeP9q2ow/-wyYX-NemyoVBEh6I8_qp4NZAAjjAWlW2yqY1aHf40viDEzY46UAaxfDpuzMsjpyoBdU7imfMlSphOn8b1puWZjJxFzJeONDRZ_P1SLbwHCZzOHZzrHPV9w65SDS8FVuJZ-CjNMy_PX3hJN9XpsfJTrzJR3cucpqTw61bEar-diOg7vitk7Xp6cRaDnPDVwe/8LhT0fDie3ClRKlP7GLm5IHVB_jumIcrd7Q7cpMAnYY",
    "price": 1.37,
    "prevClose": 1.16,
    "absReturn": 0.2100000000000002
  },
  {
    "fullTicker": "ATNM:USA",
    "baseTicker": "ATNM",
    "rank": 34.4566,
    "description": "Actinium Pharmaceuticals, Inc. develops antibody radiation conjugates and other targeted radiotherapies intended to improve outcomes for people who have failed existing oncology therapies. The company advances two clinical stage product candidates, Actimab-A, to treat patients with myeloid malignancies including acute myeloid leukemia and myelodysplastic syndromes; and Iomab-ACT, to improve patient access to and outcomes with cellular therapies, such as CAR-T for various blood cancer indications and gene therapies for non-malignant hematologic disorders such as sickle cell disease. It also develops ATNM-400, a preclinical non-prostate specific-membrane antigen targeting radiotherapy utilizing the Actinium-225 radioisotope for patients with prostate cancer. In addition, the company's Iomab-B is an induction and conditioning agent prior to bone marrow transplant in patients with relapsed and refractory acute myeloid leukemia (r/r AML). Further, it engages with the National Cancer Institute under the cooperative research and development agreement for the development of Actimab-A in AML and other myeloid malignancies, and its research and development activities primarily focus on advancing various preclinical programs for solid tumor indications. The company is based in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/r1afARtIUTvg9DDA92Khrw/w0sfnUf_u_0HdeIfUZotSGAvPSsTfhKh1sCczEyeERvbZjwk6Uf_QGTfebCpHPe5INlESHjv_fgKDidU9BL7pf37gIV_gmiHMccsMWyjHyHY1qGihyZbuthZDGxrKx2u4CsOeBHdqUcXrG34rDHrgg/LQF2ypSyqy27xoY2t67-CkaJRv_t0G1pt5_p7ryjqCo",
    "price": 1.58,
    "prevClose": 1.69,
    "absReturn": -0.10999999999999988
  },
  {
    "fullTicker": "XOS:USA",
    "baseTicker": "XOS",
    "rank": 48.2326,
    "description": "Xos, Inc. designs, manufactures, and sells battery-electric commercial vehicles. The company provides class 5-6 medium duty rolling chassis, such as commercial stepvans and armored trucks; class 7-8 heavy duty chassis; and Xos product development. It offers Xos provides mix-use powertrain solutions for off-highway, industrial and other commercial equipment, and specialty vehicles, such as school buses, medical and dental clinics, blood donation vehicles, and mobile command vehicles. In addition, the company offers energy solutions, a comprehensive charging infrastructure business that offers mobile and stationary multi-application chargers, mobile energy storage, and turnkey energy infrastructure services to accelerate client transitions to electric fleets; Xos Hub, a rapid-deployment mobile charger designed to expedite fleet transitions to electric vehicles; and Xosphere, a platform that interconnects vehicle, maintenance, charging, and service data to improve overall customer experience. Further, it offers X-Pack, a proprietary battery pack technology for last-mile commercial use cases; X-Platform foundation of Xos vehicle products; and vehicle control software, which include powertrain controls, body controls, and instrument cluster and infotainment. Xos, Inc. was founded in 2020 and is headquartered in Los Angeles, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/opqaNoCY4BM2p5ynxFrVJg/7SYwyjHFZoXw3iMy2k77YI_B7-E8YtqdWMlPfVEoXPQDBsWOn5MdKfSLAj5ZeduJ39Vr1rOB7ZCHFErgwc0vRtZ96vIGLN1ZkC2H-xYrZEzAVcRRTkaUuNfIv-cGW4xB1OpyEGBeXgnoM6rSNXR4201Jkh3VT6vvVbcAjzjzRe4/FEDGLnz7FanXBpJLyN6Yvm4qUVAv5cagaejzrdW1KL0",
    "price": 2.28,
    "prevClose": 2.3,
    "absReturn": -0.020000000000000018
  },
  {
    "fullTicker": "SMPL:USA",
    "baseTicker": "SMPL",
    "rank": 60.3403,
    "description": "The Simply Good Foods Company, a consumer-packaged food and beverage company, engages in the development, marketing, and sale of snacks and meal replacements, and other products in North America and internationally. The company offers protein bars, ready-to-drink shakes, sweet and salty snacks, cookies, muffins, protein chips and crackers, protein powders, and recipes under the Quest, Atkins, and OWYN brand names. It also provides confectionery products, such as full-size and mini peanut butter cups, brownies, caramel candy bites, chocolatey coated peanut candies, and caramel candy bars. In addition, the company licenses certain products that contain its brands and logos; and distributes its products to various retail channels, such as mass merchandise, grocery and drug stores, club and convenience stores, gas stations, and other channels. It also sells its products through e-commerce channels, including questnutrition.com, atkins.com, liveowyn.com, amazon.com and others. The company was incorporated in 2017 and is headquartered in Denver, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/Amf4EHjVX7GEyAeQsQGFqA/6EKH1jywyvtHMKH11DDVNrishyfzSWAe9NBcK4IrmAUors1leABnDjb4SDN0GhpU8bwzMUrqr8MVLAwA2Ely3fcbwLZZAnjDcq9pRnJaYxK4EpPuNSuPxCZNhtQyXspoe3NjTMf5li1i6wBy8MOsqDhh65-hJDVnENTDHaApO671baxLbsUgVXP0zIGHus3A/25FgFO2NJSDq65xMvA_vHqNhDaEorQxDk9sqEjg7DJU",
    "price": 28.485,
    "prevClose": 28.53,
    "absReturn": -0.045000000000001705
  },
  {
    "fullTicker": "DXPE:USA",
    "baseTicker": "DXPE",
    "rank": 72.3819,
    "description": "DXP Enterprises, Inc., together with its subsidiaries, engages in distributing maintenance, repair, and operating (MRO) products, equipment, and services in the United States, Canada, and internationally. It operates in three segments: Service Centers, Supply Chain Services, and Innovative Pumping Solutions. The Service Centers segment offers MRO products, equipment, and integrated services, including technical expertise and logistics capabilities. It also provides a range of MRO products in the rotating equipment, bearing, power transmission, hose, fluid power, metal working, fastener, industrial supply, safety products, and safety services categories. This segment serves customers in the oil and gas, general industrial, manufacturing, chemical, food and beverage, refining, water and wastewater, fabrication and construction, and other industries. The Supply Chain Services segment manages procurement and inventory optimization and management, storeroom management, transaction consolidation and control, vendor oversight and procurement cost optimization, productivity improvement, and customized reporting services. Its programs include SmartAgreement, a procurement solution for various MRO categories; SmartBuy, an on-site or centralized MRO procurement solution; SmartSource, an on-site procurement and storeroom management solution; SmartStore, an e-Catalog solution; SmartVend, an industrial dispensing solution; and SmartServ, an integrated service pump solution. The Innovative Pumping Solutions segment fabricates and assembles custom-made pump packages; remanufactures pumps; and manufactures branded private label pumps. The company was formerly known as INDEX INC and changed its name to DXP Enterprises, Inc. in May 1997. DXP Enterprises, Inc. was founded in 1908 and is based in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/g_0mN2p9XMC2f9tG_ClrCg/7jtIe78MRKmQvCy35ORJO1vx5hpksv2H_K7rmErm4cU7EwsURbZTw0i0KA1e9Q8F9Z4Ft4HwKnOiCHGgS7moyv-R3IwF3paXaOAMY7CxolZRnBH1e7l88YlMoAImIkkYvPtBgxmGZyfS00r_3shUUcxcf6qqVigngU9orGb7ITBoVhZqRA9KXmwk2sQWRWsN/x5PqOVcd2mVoKY6t6_kb3qo1Zm5CN1oIhVSV7wm06-s",
    "price": 123.09,
    "prevClose": 125.82,
    "absReturn": -2.7299999999999898
  },
  {
    "fullTicker": "ACAD:USA",
    "baseTicker": "ACAD",
    "rank": 84.5226,
    "description": "ACADIA Pharmaceuticals Inc., a biopharmaceutical company, focuses on the development and commercialization of medicines for central nervous system (CNS) disorders and rare diseases in the United States. The company offers NUPLAZID (pimavanserin) for the treatment of hallucinations and delusions associated with Parkinson's disease psychosis; and DAYBUE, a novel synthetic analog of the amino-terminal tripeptide of insulin-like growth factor 1 for treatment of Rett Syndrome. It also develops Pimavanserin which completed Phase III clinical trial to treat the negative symptoms of schizophrenia; ACP-101, which completed phase III clinical trial for the treatment of hyperphagia in Prader-Willi syndrome; ACP-204 that completed phase II clinical trial for the treatment of Alzheimer's disease psychosis and Lewy Body Dementia with psychosis; ACP-711, which is in phase I clinical trial for the treatment of essential tremor; ACP-211 that is in phase I clinical trial for the treatment of treatment-resistant depression; ACP-2591 that is in Phase I development for Rett syndrome and Fragile X syndrome; and ACP-271, a GPR88 agonist used in evaluation of neurology and is in the IND-enabling stage. The company has a license agreement with Neuren Pharmaceuticals Limited to trofinetide for Rett syndrome and other indications; and a license and collaboration agreement with Stoke Therapeutics, Inc. to discover, develop and commercialize novel RNA-based medicines for the potential treatment of severe and rare genetic neurodevelopmental diseases of the CNS. The company was formerly known as Receptor Technologies, Inc. and changed its name ACADIA Pharmaceuticals Inc. in 1997. ACADIA Pharmaceuticals Inc. was incorporated in 1993 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/rKwhlfXPVRugVoh5rahlGg/PA94SnjOAsJKrtcAHoaK5O4GI6q2N4a4X3quA9TBszn3EGtIfRJ85P3qbFMNDOM5Kef8HvmNjTBcgqUZcpsEUQ2lDqOZ0FsPobdP3CI-gqsbWicqtgU0NYc9YPGqVzyIrwsZ9tJvYBjUpdAZ1t1qTZukw2L7Mmjk5b7FOJ_6I11VTw5EPHk1QOR0is6Y7ZHN/9VcoxjWoSVCqKCRggtrB2zcEL684zYxErpij5ZcgY_8",
    "price": 25.27,
    "prevClose": 25.5,
    "absReturn": -0.23000000000000043
  },
  {
    "fullTicker": "DCI:USA",
    "baseTicker": "DCI",
    "rank": 92.22,
    "description": "Donaldson Company, Inc. manufactures and sells filtration systems and replacement parts worldwide. The company operates through three segments: Mobile Solutions, Industrial Solutions, and Life Sciences. The Mobile Solutions segment provides replacement filters for air and liquid filtration applications, such as air filtration systems, fuel, lube and hydraulic systems, emissions systems and sensors, indicators, and monitoring systems. This segment sells its products to original equipment manufacturers (OEMs) in the construction, mining, agriculture, and transportation markets; and to independent distributors, and OEM dealer networks. The Industrial Solutions segment offers dust, fume, and mist collectors; compressed air and industrial gasses purification systems; and hydraulic and lubricated rotating equipment applications, as well as gas and liquid filtration for industrial processes and connected services. This segment sells its products to various distributors, OEMs, and end-users. The Life Sciences segment provides micro-environment gas and liquid filtration for food, beverage, and industrial processes; bioprocessing equipment, that includes bioreactors and fermenters; and bioprocessing consumables, such as chromatography devices, reagents and filters, and polytetrafluoroethylene membrane-based products, as well as specialized air and gas filtration systems for applications, including hard disk drives, semi-conductor manufacturing and sensors, battery systems, and powertrain components to OEMs and various end-users. The company was founded in 1915 and is headquartered in Bloomington, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1757102400000/kxz3fAF1bFlG7qaZeAWqRw/0HYIWTUkGzon_eR2Z45W4v5MIOuDY2HsRG-LFrYK5d6-o4UlVwfD8qewNW8oP9caLnsQoK26rNu3zKF_olt67xMPk-xL-AfUF7emIL1jzzmFj1NNMpZ5NMtvREpM6cTd9j0D3QEHUSRnfBz60AK59KkNI_3rPVPcofPqtYqDo5duxNtZXg_rnF9vYph6aoej/7x-oT_Y0ev-pHj5Pnac-5OPwHw2xqTMbZRy65d1K_zw",
    "price": 80.56,
    "prevClose": 80.62,
    "absReturn": -0.060000000000002274
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 646.14,
    "prevClose": 649.12,
    "absReturn": -2.980000000000018
  }
]