[
  {
    "fullTicker": "MLTX:USA",
    "baseTicker": "MLTX",
    "rank": 1.0753,
    "description": "MoonLake Immunotherapeutics, a clinical stage biopharmaceutical company, engages in developing therapies. The company develops Sonelokimab, a novel tri-specific investigational Nanobody for the treatment of inflammation diseases; and hidradenitis suppurativa, psoriatic arthritis, axial spondyloarthritis, and psoriasis. MoonLake Immunotherapeutics was founded in 2021 and is headquartered in Zug, Switzerland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/fDnYrUi-P56xeMihTru12w/P2p9fMbfazAJ2l5naNRnOU5PY1-JGcR8oXwTLz5TirAnII-OTS5qZEkfurik-R8dcN2a-I191IzXO5MP6qpvGJD8umGKClMud3VuKI5Crh6sXlc4BinYzCJl1yMzv1mnSSeJcBGSZL_qqUxy7764fOY446tU2Bvw-zRa1UUHKWKfS58B2OYsscF-BFRrWlOn/8UvoJ0ADug7lY3lcV8l68nchQ-lCkBmBMb6-5hVTT0I",
    "price": 55.75,
    "prevClose": 54.8,
    "absReturn": 0.9500000000000028
  },
  {
    "fullTicker": "PESI:USA",
    "baseTicker": "PESI",
    "rank": 7.5269,
    "description": "Perma-Fix Environmental Services, Inc., through its subsidiaries, operates as an environmental and technology know-how company in the United States. It operates through two segments, Treatment and Services. The Treatment segment offers nuclear, low-level radioactive, mixed waste, hazardous and non-hazardous waste treatment, and processing and disposal services through treatment and storage facilities. This segment is also involved in the research and development activities to identify, develop, and implement waste processing techniques for problematic waste streams. The Services segment provides technical services, including professional radiological measurement and site survey of government and commercial installations; health physics services; integrated occupational safety and health services; and consulting, engineering, project and waste management, environmental, decontamination and decommissioning (D&D) field, technical and management personnel and services; and waste management services. This segment also offers nuclear services, including D&D of government and commercial facilities, including engineering, technology applications, specialty services, logistics, transportation, processing, and disposal; and license termination support, such as project management, planning, characterization, waste stream identification and delineation, remediation/demolition, compliance demonstration, final status survey, reporting, transportation, disposal and emergency response. In addition, it maintains, services, maintains, calibrates, and sources health physics, IH and customized nuclear, environmental, and occupational safety and health instruments. The company provides its services to research institutions, commercial companies, public utilities, and governmental agencies through direct sales to customers or through intermediaries. Perma-Fix Environmental Services, Inc. was incorporated in 1990 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/wYpXPiv69tlc7sd5IKU85A/JkPVu7dT9LcXt4fFn_VZ_agU2cL29ILcTDfLk2q4OVO9xw49Yr5hsXDk7mbzRqjR19D7oAbr8Cx93dGcfZ7gg6B_XHW_f8-OWcKz06RKdb-Gs_jDlYIx97IFd6V3RZrgBVo6onBy68x4ndqqWljO0AoPBLA27kDS0dB1pv5HTyMgTEnyR_55J-hkW-OzPL81mXEbr0PM_lhnUReVX7P69g/vG20vP0ZQRpwsPvAw0Xdxq3OiMfbf-7Jx1S3ZpVN64Y",
    "price": 11.89,
    "prevClose": 11.92,
    "absReturn": -0.02999999999999936
  },
  {
    "fullTicker": "SCL:USA",
    "baseTicker": "SCL",
    "rank": 19.1563,
    "description": "Stepan Company, together with its subsidiaries, produces and sells specialty and intermediate chemicals to other manufacturers for use in various end products worldwide. It operates through three segments: Surfactants, Polymers, and Specialty Products. The Surfactants segment offers surfactants that are used in consumer and industrial cleaning and disinfection products, including detergents for washing clothes, dishes, carpets, and floors and walls, as well as shampoos and body washes; and other applications, such as fabric softeners, germicidal quaternary compounds, disinfectants, lubricating ingredients; emulsifiers for spreading agricultural products; and industrial applications comprising latex systems, plastics, and composites. The Polymers segment provides polyurethane polyols that are used in the manufacture of rigid foam for thermal insulation in the construction industry, as well as a base raw material for coatings, adhesives, sealants, and elastomers (CASE); polyester resins used in coating applications; specialty polyols, such as CASE and powdered polyester resins; and phthalic anhydride that is used in unsaturated polyester resins, alkyd resins, and plasticizers for applications in construction materials, as well as components of automotive, boating, and other consumer products. The Specialty Products segment offers flavors, emulsifiers, and solubilizers for use in food, flavoring, nutritional supplement, and pharmaceutical applications. Stepan Company was founded in 1932 and is headquartered in Northbrook, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/huOwzz_qZz8VZlYUbm3qFg/VgL5dSlWApsE51GwHbT47hUQfwLAOubJ9VsgFWYrIhvI6yfSgvYq8SMdbia701u2gWN6rl2playhHNt-ZtNWGxBMRpa8LXkw282fPvk-wyCLO9nJHLFyaqGy2woAMyUehKXUMeuz2bazHZtUSa3XuZiKDHtglyq6MtTWnsnAkL5qJwP9z-z5r78sGH1lipQo/faCRm3HaAKIHDpfilrcyAEi4d_4swVNU34O7Z7Bu45k",
    "price": 50.03,
    "prevClose": 49.8662600416543,
    "absReturn": 0.1637399583457011
  },
  {
    "fullTicker": "ENVB:USA",
    "baseTicker": "ENVB",
    "rank": 25.1613,
    "description": "Enveric Biosciences, Inc., a biotechnology company, engages in the development of small-molecule therapeutics for the treatment of anxiety, depression, and addiction disorders. Its lead product candidates are EB-002, an active metabolite of psilocybin, which is in preclinical development stage for the treatment of anxiety disorders; and EB-003 that is in preclinical development stage for the treatment mental health. The company also focuses on the development of cannabinoid conjugate molecules for the treatment of pain and cancer. Enveric Biosciences, Inc. is headquartered in Naples, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/_y6mhlCgu8QlHb-X5BCh-A/rQvOQzZpAej22rDCugjeX0UhqwpgDS3bNs7aSLxwD6R_SKECng0GziZZtqxuNw5SN2G104LtVR_5jBDJhWirGPS0O_aYda6W1KmyVH4EpZrH0dof8Y371PxyPHsD30l8k7OQjkF7sWrs4iVvleo85T_JP4U6OQCmVF7875bUc2UtKl9zj0ZN6umCevK7FwWF/SfmmHL9CWSjDfK1ezURr4bQnwt-sbiBC6nmJb1IJntw",
    "price": 1.13,
    "prevClose": 1.26,
    "absReturn": -0.13000000000000012
  },
  {
    "fullTicker": "INSP:USA",
    "baseTicker": "INSP",
    "rank": 41.3896,
    "description": "Inspire Medical Systems, Inc., a medical technology company, focuses on the development and commercialization of minimally invasive solutions for patients with obstructive sleep apnea (OSA) in the United States and internationally. The company offers Inspire system, a neurostimulation technology that provides a safe and effective treatment for moderate to severe OSA. It also develops a novel, closed-loop solution that continuously monitors a patient's breathing and delivers mild hypoglossal nerve stimulation to maintain an open airway. The company was incorporated in 2007 and is headquartered in Golden Valley, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/pGzSQJ2y2Rswp9jzJQBGKw/OUb3GkdG1ZdLshfyw_RIJYvOZhD0cJ7vmnuWIchr9TBakjZy4_foAK1P3uBy0VVnq7MbjUK8B0kTIx279Eypr9TSr9QgHhda2x75BiHFtByqghR2utsFavAbxAsbZm3nm7gCp7Y-u_kKrriQ1-x8b0EgzE05oyPmq7NezPcTTfpzUtaV5RdpIO1MSsM7dLsT/QZ0dCLUPY0-ktjXrByl0q-lpMIQaX_FKohMCF3Y7T-w",
    "price": 93.69,
    "prevClose": 91.46,
    "absReturn": 2.230000000000004
  },
  {
    "fullTicker": "GLTO:USA",
    "baseTicker": "GLTO",
    "rank": 45.8561,
    "description": "Galecto, Inc., a clinical-stage biotechnology company, develops molecules for the treatment of fibrosis, cancer, inflammation, and other related diseases. The company's lead product candidate is GB2064, which is in Phase IIa for the treatment of myelofibrosis. It also develops GB2064, a selective oral small molecule inhibitor of LOXL2 that is in Phase 2a clinical trial for the treatment of fibrotic diseases, including cancer and myelofibrosis; and GB1211, a selective oral galectin-3 inhibitor that is in Phase IIa for the treatment of cancer, as well as in Phase Ib/IIa for fibrosis. Galecto, Inc. was founded in 2011 and is headquartered in Copenhagen, Denmark.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/nbhCGfHzIlUXklAPisHBkQ/aLZwKSrvAqY3aRaV9jdsjEE_al8h1nwWbK_qMrGOMZxJu5EM3ctHOHffLc3ufXInSmwQrPfwzfpmOx-C5VM4qYUEO7I9RtyOc-bpL_6-6fRbzmOk6_MnyhW0Un6mNy0jxjmw1bJdPdzUU36SHzOZ3UKbkH3xOYBLWXVhWZirnhc/ULl7u32G6bGw88KegJK-hHvUAFxw8maYYT3StD3_Rj0",
    "price": 3.18,
    "prevClose": 3.22,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "SYY:USA",
    "baseTicker": "SYY",
    "rank": 62.4648,
    "description": "Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/lpXzoCqS6TzRtYAPYp_mtA/gVIBNVbNckVjB8lN60vziYPc2LKOpyyCPLYJvhS-aLk2TwRUvdQIzI20G7Jmq_T5w4ysDg5CljizsgyyiE58JLxuqHII8fMKUb_PFUPHcISJWw9hpXeeOm8RFTdpgeI0Y5jqoenBjIH8VsxzYgP4Xr0JOf_23mu2iALl2q7WIlU/BtGQqXbeZFQouSYR1comx5xCi60zENcpjJ0HG59t6o0",
    "price": 80.47,
    "prevClose": 79.59,
    "absReturn": 0.8799999999999955
  },
  {
    "fullTicker": "ULY:USA",
    "baseTicker": "ULY",
    "rank": 69.909,
    "description": "Urgent.ly Inc. offers mobility assistance software platform for roadside assistance in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Its services include car lockout, tire changes, towing, stuck in ditch and winch services, motorcycle towing, electric vehicle towing, jump start, and gas delivery. The company's software platform combines location-based services, real-time data, AI and machine-to-machine communication to provide roadside assistance solutions. It serves automotive, insurance, telematics, and other transportation-focused verticals. Urgent.ly Inc. was incorporated in 2013 and is headquartered in Vienna, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/FgP-MsfqhSsWxvtuPbFrxg/DIirlxw-jZTZ70Xjbn0ydji-EHJH7P-gtwxbJM0B896ryaMsTalh2hAsXJX3odB6b_qs2oRCA1HxJj2zlXQAiSYKmH0minQNMHbWkRFNqAlkbNaG1fNsu0533M8qdzifTcTrUK65zc77AP1ix29YyvQA3qFLEav75ivnR-xsIh4/Gy6Ksh0Y2YZXsItjLMgXsxzxcLt8AjRvpcsN6OV9R48",
    "price": 4.29,
    "prevClose": 4.326,
    "absReturn": -0.03599999999999959
  },
  {
    "fullTicker": "NFLX:USA",
    "baseTicker": "NFLX",
    "rank": 76.8569,
    "description": "Netflix, Inc. provides entertainment services. The company offers television (TV) series, documentaries, feature films, and games across various genres and languages. It also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. The company operates approximately in 190 countries. Netflix, Inc. was incorporated in 1997 and is headquartered in Los Gatos, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/ecbXv2iqUsWVet5vtNfVNA/B49fg9HCOo8FmkutmdS4v3U2111zK0_QcD7FAlL_yjpiy5ep4Jea8aNe3rwXwDco65x3jlomOWgD0xRIva0RVaEigqoANi9JO5ZXwssx1QDmDsUHGc3cZjP2qKZKBiReUVNwisLNne_DkkGe3W6GKOaYf7WxcxjPSeGnQlt0PEA/j0GuQzKL1_QkP0MxLDD02SQ4DTfwAvc_beNnrD94D2U",
    "price": 1208.25,
    "prevClose": 1231.45,
    "absReturn": -23.200000000000045
  },
  {
    "fullTicker": "VLGEA:USA",
    "baseTicker": "VLGEA",
    "rank": 96.6749,
    "description": "Village Super Market, Inc. engages in the operation of a chain of supermarkets in the United States. It offers grocery, meat, produce, dairy, deli, seafood, prepared food products, and bakery and frozen food products. The company also provides non-food products, including health and beauty care, general merchandise, liquor, and pharmacy products. It operates its supermarkets under the ShopRite and Fairway banners, and specialty markets under the Gourmet Garage banner, as well as operates online stores through shoprite.com, fairwaymarket.com, and gourmetgarage.com, as well as ShopRite app, Fairway app, and Gourmet Garage app. The company was founded in 1937 and is based in Springfield, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1756634400000/yaWYZsBh-MtOyGZO63RTJg/w-AUBbGgYpFGG8qNlzQe5rPKqOEYLw20oYKwQm_yuUee82dvYPABd_lE4dNtoWvc_vy6FJ3Nrq9VPdNub1VCX7QP6rsjra0FzJxxEnJFu1QyMQSt2-YF6Vpc6h7391uDATgN6f40J4SgrKrT3e3aoHGrz0wWrr_Fwl0YwMmHlIgqgH8sD3TnMd_Cd9T3FCAN/nLcnTW9haNuawSYKbmevEbu51lqznUmhA5m1A1cHl7c",
    "price": 36.28,
    "prevClose": 36.15,
    "absReturn": 0.13000000000000256
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 645.05,
    "prevClose": 648.92,
    "absReturn": -3.8700000000000045
  }
]