[
  {
    "fullTicker": "SRRK:USA",
    "baseTicker": "SRRK",
    "rank": 0.5967,
    "description": "Scholar Rock Holding Corporation, a biopharmaceutical company, focuses on the discovery, development, and delivery of medicines for the treatment of serious diseases in which signaling by protein growth factors plays a fundamental role. Its transforming growth factor beta (TGFß) superfamily biology, its novel understanding of the molecular mechanisms of growth factor activation enabled us to develop a proprietary platform for development of monoclonal antibodies that locally and selectively target the precursor. The company develops Apitegromab, an inhibitor of the activation of myostatin that is in Phase 3 clinical trial for the treatment of spinal muscular atrophy; and SRK-181, which has completed Phase 1 clinical trials for the treatment of cancers that are resistant to checkpoint inhibitor therapies, such as anti-PD-1 or anti-PD-L1 antibody therapies. It is developing a pipeline of product candidates to deliver novel therapies to treat a range of serious diseases, including neuromuscular disorders, cardiometabolic disorders, cancer, fibrosis, and iron-restricted anemia. Scholar Rock Holding Corporation was founded in 2012 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/LFjdfbTVXo50a2e3YPRrQQ/Ug5F9qSY0VOhliBYCNuEmKKzJSoCf3ZWm2Pz57_c6_Cd4skXnJTqtiE-jdfO5x2eIVZpkgpRHdkZTMJiEQePIFYNUOsHSLFdmhlJXN2rehubnIszH2g1Fxr8MCddf34_fnB1pJFNKjl6N9HF1nGT3MeFEMrFGPqgulf5lDp_8qOE24WT4z2xs56o3BZmzo_O/BdeapKNrPChJw6k_2P8HJkj-ygX4-E7jVnXZeTCgu4I",
    "price": 38.66,
    "prevClose": 37.27,
    "absReturn": 1.3899999999999935
  },
  {
    "fullTicker": "SMCI:USA",
    "baseTicker": "SMCI",
    "rank": 6.2821,
    "description": "Super Micro Computer, Inc., together with its subsidiaries, develops and sells high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. It offers various IT solutions, including complete servers, storage systems, modular blade servers, blades, workstations, full-rack scale solutions, networking devices, server sub-systems, and server management and security software. The company also provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company identifies service requirements, creates and executes project plans, conducts verification testing and training activities, and provides technical documentation services. Additionally, it offers help desk and on-site support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, 5G, and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/ZFLVGShiq4ef_N1VCsyInQ/VlFB2we2obn0r2dWWHuvEGmDnkpJzvbrcUjlvzG5o89loiTFiZceZWPL514v8LGvedms9JEZpFe-w3Zm8a93Vc3zj5lfLSaaEgQIEuw8yTkSQBzolc5CsbtRCeHOnwGZ4zSfrjboNsOjx5aArR6OQ7XnrILjy4X231IcEpXwNTqj5ngQSotpRqMmvWiPzP13/x-JPJnKRhd_4Yti_-io0ue4HZOSX7sxuyCushX-DOOE",
    "price": 61.395,
    "prevClose": 58.63,
    "absReturn": 2.7650000000000006
  },
  {
    "fullTicker": "CRWD:USA",
    "baseTicker": "CRWD",
    "rank": 18.3822,
    "description": "CrowdStrike Holdings, Inc. provides cybersecurity solutions in the United States and internationally. Its unified platform provides cloud-delivered protection of endpoints, cloud workloads, identity, and data through a software as a service (SaaS) subscription-based model. The company offers corporate endpoint and cloud workload security, managed security, security and vulnerability management, IT operations management, identity protection, threat intelligence, data protection, SaaS security posture management, and AI powered workflow automation, and securing generative AI workload services, as well as security orchestration, automation, and response; and security information and event management, and log management services. It primarily sells subscriptions to its Falcon platform and cloud modules. CrowdStrike Holdings, Inc. was incorporated in 2011 and is headquartered in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/bXuolfMpWewB03NmcO8mpg/Ms4z9NXzcYTwxw7D23e4IGP7uyrAkBAaP82czfA66ME-Mf199iQZsivSMYIqguSRQOGhR8_exwqGLegqje2PfbK5LnCKbtSbhpyskvT1smJ7kWtOMEGzzdQiJ7uY8Q-f42f4AL0gWBZzU_DJoeqZlob766-LFdIOCJengWuMhuHty0uB1vJW-OE_drz1qVqT/_8Msw5I5DmlF7ka4HuZ8m-R9ydeZGYla9RB2xDjuVtY",
    "price": 464.12,
    "prevClose": 465.51,
    "absReturn": -1.3899999999999864
  },
  {
    "fullTicker": "SDHC:USA",
    "baseTicker": "SDHC",
    "rank": 27.4822,
    "description": "Smith Douglas Homes Corp., together with its subsidiaries, engages in the design, construction, and sale of single-family homes in the southeastern United States. It also provides closing, escrow, and title insurance services. The company sells its products to entry-level and empty-nest homebuyers. Smith Douglas Homes Corp. was founded in 2008 and is headquartered in Woodstock, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/xcOPlZvBwGrM9sa5JkZfTg/UDmTiXMj_1XzfSH6jB6uOw2Mg5mXI_r8GGtS-x5q_d3M5i_4Uxjv3Xgd6k-ddCSBBhmHrjc8GdYuLzyZIY3phJ-5cK1yyofcfIH7a5inYEUnnZZ6kyqK2n7XzQTIYbJvVXC9zF3YfRkILa0NUNydCiQX9i8IcmdKUlBtWhiKKxl7-gKhEPISr-LM48hBewj7/Gf1ZjUKYhQZyfolDlgrQMAagH-dn5paRx4Aqe_0rGaA",
    "price": 20.17,
    "prevClose": 20.57,
    "absReturn": -0.3999999999999986
  },
  {
    "fullTicker": "CDW:USA",
    "baseTicker": "CDW",
    "rank": 39.9635,
    "description": "CDW Corporation provides information technology (IT) solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Corporate, Small Business, and Public. The company offers discrete hardware and software products and services, as well as integrated IT solutions, including on-premise and cloud capabilities across hybrid infrastructure, digital experience, and security. It also provides hardware products comprising notebooks/mobile devices, tablets, network communications, collaboration hardware, data storage and servers, desktop computers, and other hardware; and software products, such as cloud solutions, software assurance, application suites, security, virtualization, collaboration and productivity applications, operating systems, and network management. In addition, the company offers advisory and design, software development, implementation, and managed services, as well as warranties. It serves business, government, education, and healthcare customers. The company was formerly known as CDW Computer Centers, Inc. and changed its name to CDW Corporation in June 2003. CDW Corporation was founded in 1984 and is based in Vernon Hills, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/9LcyDv-oe-tdLofUujiJ5Q/lHggdp9K7qdyjKIQEcn4u7o1lpnpfLbIlOhbsBseGSIQFBRRh2IV7DUDRote5lXjpJmZwa06hTX22ON-mEMO2zuLrvpZV4tiqGtyqKxZ-ILrhuVx51sy1PFkF34e06c1ZdvPDdAOVfZlsLNk9BWzwgnVMyWbzrKy4xU_Isx-ZINp905PP2mdNnQ6UKbM06HM/ZWdIV3DzqJJJj_eTf0DvOeeK3XehLq-9LX0u2hqggwQ",
    "price": 181.15,
    "prevClose": 182.18,
    "absReturn": -1.0300000000000011
  },
  {
    "fullTicker": "GSHD:USA",
    "baseTicker": "GSHD",
    "rank": 44.6378,
    "description": "Goosehead Insurance, Inc operates as a holding company for Goosehead Financial, LLC that engages in the provision of personal lines insurance agency services in the United States. The company offers insurance service for homeowner's; automotive; dwelling property; flood, wind, and earthquake; excess liability or umbrella; general liability, and property and auto insurance for small businesses; life insurance; and motorcycle, recreational vehicle, and other insurance policies. It distributes its products and services through corporate and franchise locations. The company was founded in 2003 and is headquartered in Westlake, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/qL-97QLrVttxATr-RB0Yjg/o6V8w4384MOWXfZjNU0CmaddK-gpnHNp6uDXiLN8Ov_DRtINwsmNiwkvR_6rX7nhJ9zTGCzSrgAVHBEAeR4J0-Bhsb8x3-dkIrPRjrrowdtmUAfDMWZOSlF6-lZBsDGtYIoZPzwkpuC5o2Pe3wW8U0UnNOtcwuLr1APALvAWDsX_iIqlyzYeUBmuB1VevClo/tuHEpccjh9WhTgBv5CBKMsQb8kU2iLJzpDT8rm9Bjtk",
    "price": 90.275,
    "prevClose": 86.75,
    "absReturn": 3.5250000000000057
  },
  {
    "fullTicker": "FERG:USA",
    "baseTicker": "FERG",
    "rank": 57.749,
    "description": "Ferguson Enterprises Inc. distributes plumbing and heating products in the United States and Canada. The company provides expertise, solutions, and products, including infrastructure, plumbing, appliances, fire, and fabrication, as well as heating, ventilation, and air conditioning (HVAC) to residential and non-residential customers. It also supplies specialist water and wastewater treatment products to residential, commercial, and infrastructure contractors, as well as supplies pipe, valves, and fittings solutions to industrial customers. In addition, it offers customized solutions, such as virtual design, fabrication, valve actuation, pre-assembly, kitting, installation, and project management services, as well as after-sales support that comprises warranty, credit, project-based billing, returns and maintenance, and repair and operations support. The company sells its products through a network of distribution centers, branches, counter service and specialist sales associates, showroom consultants, and e-commerce channels. Ferguson Enterprises Inc. was founded in 1953 and is headquartered in Newport News, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/f9jpKaiIdCTD98a-xyyaXw/zhLMGucvUtLox6avkq9inPPIM4g5gSAukjNi09MBUXErHScsiBRQj2BAxL_JvdgscTZts6qIso_XmGdo5pr1jwCYng3Ms0NTAs_X7J5JSNaAQSUcD5XIhEnQZZxB5Ttn1PpVuFeK34o97EA2r0l5KSX6sn7co63beClFtwxKYgA/_-l3K0tFAfrbEQyUNEMjin5nElDFvQxmawzhJPLbAmQ",
    "price": 226.94,
    "prevClose": 226.96,
    "absReturn": -0.020000000000010232
  },
  {
    "fullTicker": "CNA:USA",
    "baseTicker": "CNA",
    "rank": 69.4016,
    "description": "CNA Financial Corporation, an insurance holding company, primarily provides commercial property and casualty insurance products in the United States and internationally. It operates through Specialty, Commercial, International, and Life & Group segments. The company offers professional liability coverages and risk management services to various professional firms, including architects, real estate agents, and accounting and law firms; directors and officers, errors and omissions, employment practices, fiduciary, and fidelity and cyber coverages to small and mid-size firms, public and privately held firms, and not-for-profit organizations; professional and general liability, as well as associated casualty coverages for healthcare industry; surety and fidelity bonds; and warranty and alternative risks products. It also provides property, marine, boiler, and machinery coverage insurance products; casualty insurance products comprising workers' compensation, general and product liability, commercial auto, umbrella, and excess and surplus coverages; specialized loss-sensitive insurance programs and total risk management services; and run-off long term care policies. The company was founded in 1853 and is based in Chicago, Illinois. CNA Financial Corporation operates as a subsidiary of Loews Corporation.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/ZP8og9IeHGorJUVWpucEbQ/DziFHNgwNgA9-6mv2IF048sLXVX-xAouqs4mMyB87kzDSzxsG_rSi1hcQAvgtLYV28hunBjVCULiphTwi39VALUfQ4G_z6K_cFHZYt7er2ezlFXhkEnV8e2u2p9Xc7PoNo_KD9CQvyok4occgLkuGKOIs8Ij-Z1Dl0c2czigSN4CZL52raycSK_UK342bisS/zf85L4taoXNrIDaAFGwt50oxRxB1vh3l1v_CeLFGmVw",
    "price": 44.42,
    "prevClose": 44.48,
    "absReturn": -0.05999999999999517
  },
  {
    "fullTicker": "QNST:USA",
    "baseTicker": "QNST",
    "rank": 81.1702,
    "description": "QuinStreet, Inc., an online performance marketing company, provides customer acquisition services for its clients in the United States and internationally. The company offers online marketing services, such as qualified clicks, leads, calls, applications, and customers through its websites or third-party publishers. It serves financial and home services industries. The company was incorporated in 1999 and is headquartered in Foster City, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/qv9_vbbAjwl289WdxbsOHA/2eJ2tQc9Bmm13rskQZ_tNnZqjhzUp2MiKm_HftSto8w_XmGrLv8aO_hAtd5VCFEobEQY7C0_08s5OEGvsslSzGnOZiyY3NNeINnCRvIEOYbgHNhKHx4q9MZ96BR7gfbd2sLo0UWi1KDOVEL7oO6oN5u3domIE48VzRJ79ZtMiDjf5roE60H2cdIHqUf3yTs4/Y3pCcAioDeWXnIysJVNmetyRzpY71qJGe2GSwqa0QeA",
    "price": 16.28,
    "prevClose": 16.2,
    "absReturn": 0.08000000000000185
  },
  {
    "fullTicker": "RNGR:USA",
    "baseTicker": "RNGR",
    "rank": 90.6183,
    "description": "Ranger Energy Services, Inc. provides onshore high specification well service rigs, wireline services, and complementary services to exploration and production companies in the United States. It operates through three segments: High Specification Rigs, Wireline Services, and Processing Solutions and Ancillary Services. The High Specification Rigs segment offers well service rigs and complementary equipment and services to facilitate operations throughout the lifecycle of a well; and well maintenance services. This segment has a fleet of 406 well service rigs. The Wireline Services segment provides wireline production and intervention services to provide information to identify and resolve well production problems through cased hole logging, perforating, mechanical, and pipe recovery services; wireline completion services that are used primarily for pump down perforating operations to create perforations or entry holes through the production casing; and pumping services. This segment has a fleet of 72 wireline units and 29 high-pressure pump trucks. The Processing Solutions and Ancillary Services segment rents well service-related equipment consisting of fluid pumps, power swivels, well control packages, hydraulic catwalks, frac tanks, pipe racks, and pipe handling tools; and coiled tubing, decommissioning, and snubbing services, as well as provides proprietary and modular equipment for the processing of natural gas streams. This segment also engages in the rental, installation, commissioning, start up, operation, and maintenance of mechanical refrigeration units, nitrogen gas liquid stabilizer units, nitrogen gas liquid storage units, and related equipment. The company was incorporated in 2017 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1753891200000/8w40aXAwy6UgeTL30T60BQ/B4SyQ4O6AVqeFiqABXTdQKERwwCfGHkjgBPo-UpSSkVKzS0tCGeAIccYPQvOxRUBJS33XhyN2Sl18mxZRvhtGJXgLIP6TWw_-PLDfAO20ZEAYijwfgz0pRhQandrSYrnmgZwYV3tlKb8fk_00jkwAXegxntpfghlf54KQGaI9arMGXsuRFUsGBTVcZ_ftxv6/IBXIYYSoCHnrmCF9XJcA_KSwyYZ5-sFZWwcoE2enW-0",
    "price": 14.75,
    "prevClose": 14.72,
    "absReturn": 0.02999999999999936
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 635.575,
    "prevClose": 635.26,
    "absReturn": 0.31500000000005457
  }
]