[
  {
    "fullTicker": "SRRK:USA",
    "baseTicker": "SRRK",
    "rank": 0.9889,
    "description": "Scholar Rock Holding Corporation, a biopharmaceutical company, focuses on the discovery, development, and delivery of medicines for the treatment of serious diseases in which signaling by protein growth factors plays a fundamental role. Its transforming growth factor beta (TGFß) superfamily biology, its novel understanding of the molecular mechanisms of growth factor activation enabled us to develop a proprietary platform for development of monoclonal antibodies that locally and selectively target the precursor. The company develops Apitegromab, an inhibitor of the activation of myostatin that is in Phase 3 clinical trial for the treatment of spinal muscular atrophy; and SRK-181, which has completed Phase 1 clinical trials for the treatment of cancers that are resistant to checkpoint inhibitor therapies, such as anti-PD-1 or anti-PD-L1 antibody therapies. It is developing a pipeline of product candidates to deliver novel therapies to treat a range of serious diseases, including neuromuscular disorders, cardiometabolic disorders, cancer, fibrosis, and iron-restricted anemia. Scholar Rock Holding Corporation was founded in 2012 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/V4_7XZ6_OoCCFa5qCMVTtw/BBj-bkehkPHTYrD_j-5gioB_wk2KVcTG-U2_KGSO09wdc1UYoRg38EWsxd0XyEGkX6FX02VntLyZTRsY-Re7O2T88vJ9ZJ0iziIkqiWLAWl6SU4uwukpaxGHoLVhsurh4mfdhtgXAZP4vbVep7HegdHh3KASazPJouxzgfLP2EqM41o4340JsjtGq89yH6qa/ghmWGZxBbYjUwR3dQ76WS0BpBthgnNV55wZhpf5sp_4",
    "price": 38.73,
    "prevClose": 37.47,
    "absReturn": 1.259999999999998
  },
  {
    "fullTicker": "SJM:USA",
    "baseTicker": "SJM",
    "rank": 13.3504,
    "description": "The J. M. Smucker Company manufactures and markets branded food and beverage products worldwide. It operates in four segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, U.S. Retail Pet Foods, and Sweet Baked Snacks. The company offers coffee, pet snacks, peanut butter, cat food, frozen handheld products, sweet baked goods, fruit and specialty spreads, portion control products, baking mixes and ingredients, toppings and syrups, dog food, cookies, frozen sandwiches and snacks, hot beverages, frozen handheld products, and flour. It provides its products under the Folgers, Café Bustelo, Dunkin', Jif, Smucker's, Smucker's Uncrustables, Meow Mix, Milk-Bone, Pup-Peroni, Canine Carry Outs, Hostess, Voortman, 1850, Robin Hood, and Five Roses brands. The company sells its products through direct sales and brokers to food retailers, club stores, discount and dollar stores, online retailers, pet specialty stores, distributors, drug stores, military commissaries, mass merchandisers, supermarket chains, national mass retailers, convenience stores, vending channels, and foodservice distributors and operators. The J. M. Smucker Company was founded in 1897 and is headquartered in Orrville, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/OBEKjb8re-6KfHSdF_CRvw/X8GPDU4tEfJqWon84t0uZfTKowd7vb_hpCkOks4uk0TLtHRlFuNT_x31Mzw1_GEyOzguU4dhBFapcyQz6JqDgBdUwt3AERm_TOFZeOxKnDFT-X0bAU1eI9kGM_p_rwSpzuhBGLIgjBWewuTdsAlXPj96eu_rT9Rfx-Yt5HgTUCf-aFp6yTIsa4ML-zuVLB1j/OpT5UTvPKni3lZBgd_QAy9-Mj3gNDFE7wmCpmsdWq9Q",
    "price": 106.995,
    "prevClose": 108.3,
    "absReturn": -1.3049999999999926
  },
  {
    "fullTicker": "MOD:USA",
    "baseTicker": "MOD",
    "rank": 15.8568,
    "description": "Modine Manufacturing Company provides thermal management products and solutions in the United States, Italy, Hungary, China, the United Kingdom, and internationally. It operates through Climate Solutions and Performance Technologies segments. The company offers heat transfer coils, including heat recovery and round tube plate fin coils; gas-fired, hydronic, electric and oilfired unit heaters; roof-mounted direct- and indirect-fired makeup air units; duct furnaces; infrared units; perimeter heating products; single packaged unit ventilators; modular chillers; air handler and condensing units; ceiling cassettes; evaporator unit coolers, remote condensers, fluid coolers, gas coolers, and dry and brine coolers; and motor and generator cooling coils, transformer oil coolers, radiators, dryers, and industrial heat exchangers. It also provides data center products consisting of IT cooling solutions, including precision air conditioning units for data center applications; computer room air conditioning and handler units; hybrid fan coils; fan walls; chillers; condensers; condensing units; and liquid cooling solutions for high-density computing, as well as replacement parts, maintenance service and control solutions for existing equipment and new building management controls and systems. In addition, the company offers powertrain cooling products, such as radiators, condensers, engine cooling modules, charge air coolers, fan shrouds, and surge tanks; cooling module generator sets; aluminum and stainless steel engine oil coolers, exhaust gas recirculation coolers, liquid charge air coolers, transmission and retarder oil coolers, and chillers; battery thermal management systems, electronics cooling packages, battery chillers, battery cooling plates, coolers and casings for electronics cooling, and coolers for electric axles; and coatings products and application services. Modine Manufacturing Company was incorporated in 1916 and is headquartered in Racine, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/j93ZGumUSuvnmOkQExXeqg/izbx-Kn3VsMAOtjIzvfY3wRKPSNEwreYUfzpC9UtR_cM0U9mghKmpZvhubX8kJJ6QieZZexuSmRPLrfNbipruEI4lDt8IktvpiUIoLz9DMJEc95EjYoS09JQ5aj5t8pu-34E08hMuAhko45VwwTC0vMw-9sKY9KyRj_IWhHXv2OZ0S6Cp0BOLO9RdYrKAHO4/ODYpMjnOYEt2Fumpy_uVdtFNQz8ekoXbMesPYBksoIM",
    "price": 154.18,
    "prevClose": 147.61,
    "absReturn": 6.569999999999993
  },
  {
    "fullTicker": "SPWH:USA",
    "baseTicker": "SPWH",
    "rank": 31.2873,
    "description": "Sportsman's Warehouse Holdings, Inc., together with its subsidiaries, operates as an outdoor sporting goods retailer in the United States. It offers camping products, such as backpacks, camp essentials, canoes and kayaks, coolers, outdoor cooking equipment, sleeping bags, tents, and tools; and apparel products, including camouflage, jackets, hats, outerwear, sportswear, technical gear, and work wear. The company also provides fishing products comprising bait, electronics, fishing rods, flotation items, fly fishing products, lines, lures, reels, tackles, and small boats; and foot wear products consist of hiking and work boots, socks, sport sandals, technical footwear, trial and casual shoes, and waders. In addition, it offers hunting and shooting products, such as ammunition, archery items, ATV accessories, blinds and tree stands, decoys, firearms, firearms safety and storage products, reloading equipment, and shooting gear products; and optics, electronics, accessories, and other products comprising gift items, GPS devices, knives, lighting, optics, and two-way radios. Further, the company's stores provide archery technician services, fishing-reel line winding, scope mounting and bore sighting, and cleaning services, as well as issues hunting and fishing licenses. Additionally, it offers various private label and special make-up offerings under the Rustic Ridge, Killik, Vital Impact, Yukon Gold, Lost Creek, and Sportsman's Warehouse brands. Sportsman's Warehouse Holdings, Inc. was founded in 1986 and is headquartered in West Jordan, Utah.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/pDcbuE1mCpN86oP6xDd6dg/_fOdWV3jT67Lz1S3tVttUsLZ9MI5RX5y3IrRHJcjYnHfBWkspm0C3WVqzfyr3yhs8ZIrNQaJ7Tai8A2OcaJ8SsdDB7YEmiBSG9ZOvehzEOIsZ2_jPvfaS37DALTstKDQAZgZM6vPIO3KubHlxykILJ-jpGrIzxmVlQDzwK9AzDTHPqJkHPGSGL3Rzs7NCuNdtm4K77H2L6cktorHCPBunw/jZSfVZL6Lmw5yAk8Eu-bUIvgA5UO_4ybYqbcpOi0QmU",
    "price": 3.18,
    "prevClose": 2.88,
    "absReturn": 0.30000000000000027
  },
  {
    "fullTicker": "CISS:USA",
    "baseTicker": "CISS",
    "rank": 38.636,
    "description": "C3is Inc. offers international seaborne transportation services. It provides its services to dry bulk charterers, including national and private industrial users, commodity producers and traders, oil producers, refineries, and commodities traders and producers. The company owns and operates a fleet of two drybulk carriers, which transport major bulks, such as iron ore, coal and grains, as well as minor bulks comprising bauxite, phosphate, and fertilizers, and one Aframax crude oil tanker that transports crude oil. C3is Inc. was founded in 2021 and is based in Athens, Greece.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/GsN4cPdRNsnmv2pSt86xaQ/pbFIhArQRn0imKGMjTq13OwU-q6c0QUzT4OZJgbiruE0FjCNELHY5ZGvNTABsCiO8f1V2pkfC2xb05r_69eoq3R1yXd3PobZKhWbJb8-Bhu3FQBI7tYJwdXeOm2te-splojphrGCz71xWZLxr5pErHAQnMn8EDs2OJ-JO83Xvhc/_fSHyPOIDV2vUWSWkNJvSEm0uEcCZXf4FuiwSr2i7gs",
    "price": 2.195,
    "prevClose": 2.24,
    "absReturn": -0.04500000000000037
  },
  {
    "fullTicker": "MSM:USA",
    "baseTicker": "MSM",
    "rank": 52.5149,
    "description": "MSC Industrial Direct Co., Inc., together with its subsidiaries, engages in the distribution of metalworking and maintenance, repair, and operations (MRO) products and services in the United States, Canada, Mexico, the United Kingdom, and internationally. The company's MRO products include cutting tools, measuring instruments, tooling components, metalworking products, fasteners, flat stock products, raw materials, abrasives, machinery hand and power tools, safety and janitorial supplies, plumbing supplies, materials handling products, power transmission components, and electrical supplies. It offers stock-keeping units through its catalogs and brochures; e-commerce channels, including its website, mscdirect.com; inventory management solutions; and customer care centers, customer fulfillment centers, regional inventory centers, and warehouses. The company serves individual machine shops, manufacturing companies, and government agencies. MSC Industrial Direct Co., Inc. was founded in 1941 and is headquartered in Melville, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/h3U35BOxVpHkyyEq5-P60g/bGaiONkvPIf-ChUKjX_ShBXA8FN1mOkA1d2u2DgZmheAdRG_cz0pY4Myrho_NbLuHL7t5LosyNobpEnmHj13ScpmJDpWHQn0TC9TUvbhdnee4711bgsZ7rNZwiEB0J_a0IWvAl_gYwj-YA04B3ktqC9ir54EwuYrC8RHgSoC3z4r0aowKSHDYUhcewoKdld4/3_2cY1xZvWZSaDOuMzzkaDTA_XYJeI5VvRiD-cmAFvs",
    "price": 91.91,
    "prevClose": 91.99,
    "absReturn": -0.0799999999999983
  },
  {
    "fullTicker": "WEN:USA",
    "baseTicker": "WEN",
    "rank": 63.9898,
    "description": "The Wendy's Company, together with its subsidiaries, operates as a quick-service restaurant company in the United States and internationally. It operates through Wendy's U.S., Wendy's International, and Global Real Estate & Development segments. The company involved in operating, developing, and franchising a system of quick-service restaurants specializing in hamburger sandwiches. It also owns and leases real estate properties. The company was formerly known as Wendy's/Arby's Group, Inc. and changed its name to The Wendy's Company in July 2011. The Wendy's Company was founded in 1969 and is headquartered in Dublin, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/g1rPtnoj65FbL9IGJDANpQ/ET4ful6sML0fhiT9WryfYzifzPXFb7lmRZ9uVaH_qb1Hq7nFtx5sFpsP0zylE_ctG5F6cJ8OCKdA_DGMnaZT1ns0UDv2NFuPyJVEgpePZcUrFKoEkt5kqSiBTNQTlgVq1Rp_zV0AslLupNi3C3NQb-0cKrPnYIFiWg9xZuNC-II/R7V93cy9JRADacHpO_fV1CfquatzmsIhKUXPJFQ-owg",
    "price": 9.345,
    "prevClose": 9.55,
    "absReturn": -0.20500000000000007
  },
  {
    "fullTicker": "MGPI:USA",
    "baseTicker": "MGPI",
    "rank": 66.6837,
    "description": "MGP Ingredients, Inc. produces and supplies distilled spirits, branded spirits, and food ingredients worldwide. It operates in three segments: Distillery Solutions, Branded Spirits, and Ingredient Solutions. The Distillery Solutions segment processes corn and other grains, including barley, wheat, barley malt, and milo into food grade alcohol and distillery co-products, such as dried distillers' grain; and offers food grade alcohol for beverage applications, that include bourbon, rye, and other whiskeys, as well as grain neutral spirits, including vodka and gin. This segment also offers warehouse services, including barrel put away, barrel storage, and barrel retrieval services; and blending services. The Branded Spirits segment provides Tequila under the premium plus, ultra-premium, super premium, premium under the Penelope Bourbon, Yellowstone Bourbon, Rebel Bourbon, Remus Bourbon, Blood Oath Bourbon, Ezra Brooks Bourbon, Minor Case Straight Rye Whiskey, Rossville Union Straight Rye Whiskey, The Quiet Man Irish Whiskey, Green Hat Gin, Everclear grain alcohol, El Mayor Tequila, and Dos Primos names; mid branded spirits under the Brady's Irish Cream, Saint Brendan's Irish Cream Liqueur, Pearl Vodka, Lord Calvert Canadian Whisky, and Exotico Tequila names; and value branded spirits under the Arrow Cordials, Canada House Canadian Whisky, Lady Bligh Rum, and Juarez Tequila names, as well as private label products. The Ingredient Solutions segment provides specialty wheat starches for food applications, such as Fibersym, a resistant wheat starch; specialty wheat proteins for food applications under the Arise and Proterra names; gluten-free textured pea proteins; commodity wheat starch for food and non-food applications; and commodity wheat proteins. It sells its products directly or through distributors to manufacturers and processors of finished packaged goods or to bakeries. The company was founded in 1941 and is based in Atchison, Kansas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/6qmZGf4e6A5Vn-euCDyecQ/ZNRkw9G4GfiipiQ50je1WN_vqgha7NFUwXu3h_Q2Tdhm-VgZjS2_WZ9KCOwnCn6WNbvqkswiFeF4vgD3QXwVK6aO0g5uHUresvqygwxzcAYIjxL9TwMR5z6neoAF3XWVk1mSoBjmmK1L_Eyy6MP4ZgU6muuaQkPWZGtpVhESHJ98GwdQEb3fXNST8HVYXqV5/rl_Rnue7FXM5R-iQo9YRkny3jisFexfBoObUrX4wahA",
    "price": 24.05,
    "prevClose": 24.62,
    "absReturn": -0.5700000000000003
  },
  {
    "fullTicker": "HDSN:USA",
    "baseTicker": "HDSN",
    "rank": 78.977,
    "description": "Hudson Technologies, Inc., through its subsidiary, Hudson Technologies Company, engages in the provision of solutions to recurring problems within the refrigeration industry in the United States. The company is involved in the sale of refrigerant and industrial gas; refrigerant management services consisting primarily of reclamation of refrigerants, laboratory testing through its laboratory, and banking storage services; and RefrigerantSide Services comprising system decontamination to remove moisture, oils, and other contaminants intended to restore systems to designed capacity. It also offers diagnostic services for use in the prediction of potential problems in air conditioning, process cooling, and refrigeration systems; Chiller Chemistry, which integrates several fluid tests of an operating system and the corresponding laboratory results into an engineering report; Fluid Chemistry for use in identification of systems that require further examination; and SmartEnergy OPS, a system for measuring, modifying, and improving the efficiency of energy systems, including air conditioning and refrigeration systems, in industrial and commercial applications. In addition, the company provides a snapshot of a packaged chiller's operating efficiency and health through ChillSmart, a maintenance tool. Further, it is involved in the generation of carbon offset projects. The company serves commercial, industrial, and governmental customers, as well as refrigerant wholesalers, distributors, contractors, and refrigeration equipment manufacturers. Hudson Technologies, Inc. was incorporated in 1991 and is headquartered in Woodcliff Lake, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/yRqKYaif958Zi7UrpEHGkw/txpOjbqCFo8cXJ634NxE3MK-saoyEHNBxuhgzALMHNTRAoI7vRXyOt1S5fHJsjUwdb7PlqvdAvO0dQubB0gcVnN8m15mc9-ZKdgq08B-0ewTthRQDuxtUF8E4oV4uc1mwHzl_EzmU5J0mWzbWmWKEQzoc6coMNFbzrSmhRNkqjjJpAR99SLUZGj4lbu6SNxU/I-SSiWsErv7x_esCCxs863vI_6Fscn4WdMaPjeya528",
    "price": 9.245,
    "prevClose": 9.45,
    "absReturn": -0.20500000000000007
  },
  {
    "fullTicker": "NEM:USA",
    "baseTicker": "NEM",
    "rank": 94.1347,
    "description": "Newmont Corporation engages in the production and exploration of gold properties. It also explores for copper, silver, zinc, lead, and other metals. The company has operations and/or assets in the United States, Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, Papua New Guinea, Ecuador, Fiji, and Ghana, and internationally. Newmont Corporation was founded in 1916 and is headquartered in Denver, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1759788000000/utIi7hrqte4tlAoB13NpHQ/ny8bE_sA2upgUYIHQ59hp2ZZz0E3JQnnJAG1DF4iRJs4mU5lMMt7h4_xI-YMulCnbRwwWUl38o9ynUZpE9qxz7AZGXU1DicpJAm-lvThN3niO9rvbldevBU1jzdvdU_d5-xjibd5LjxluK8lDBFAveHftF3RJOa7hM0HZg9N8Nw/IDLNsbcp43xWwAi5T_XoUfGOpr4z3ux4RAn4cJk-24g",
    "price": 88.865,
    "prevClose": 86.86,
    "absReturn": 2.0049999999999955
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 671.885,
    "prevClose": 669.21,
    "absReturn": 2.6749999999999545
  }
]