[
  {
    "fullTicker": "CRDF:USA",
    "baseTicker": "CRDF",
    "rank": 1.4595,
    "description": "Cardiff Oncology, Inc., a clinical-stage biotechnology company, develops novel therapies to treat various cancers in California. The company's lead drug candidate is Onvansertib, an oral, small molecule drug candidate that is highly specific for PLK1 inhibition. It also focuses clinical program in indications, such as RAS-mutated metastatic colorectal cancer, as well as investigator-initiated ongoing or planned trials in metastatic pancreatic ductal adenocarcinoma, small cell lung cancer, and triple negative breast cancer; CRDF-004, a Phase 2 open-label, randomized multi-center clinical trial of onvansertib in combination with SoC FOLFIRI and bevacizumab or SoC FOLFOX and bevacizumab for the first-line treatment of patients with RAS-mutated mCRC; TROV-054, a Phase 1b/2 open-label multi-center clinical trial of onvansertib in combination with SoC FOLFIRI and bevacizumab for the second-line treatment of patients with KRAS-mutated mCRC; and CRDF-001, a Phase 2 open-label multi-center clinical trial of onvansertib in combination with nanoliposomal irinotecan leucovorin, and fluorouracil for second line treatment of patients with mPDAC. The company was formerly known as Trovagene, Inc. and changed its name to Cardiff Oncology, Inc. in May 2012. Cardiff Oncology, Inc. was incorporated in 1999 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/B1OfSZlS5b3EoJVQFDxEvQ/S5Qn4yBO1dpiBiI5dlZfVusWopfoXupD9S7P6nwTOByQ2hIOPG0NJS0BPq3-7ivJl9V1ZhjlaL5tI0jYWPcwW0lt6gCElCDoSXIcMhVLmS8ghp27B-zOS8IWKhzTu1EkE7qUfapipH2hTSgzVIDquAHlZVsQsQ64CBRUBdABmn1QfWdYivYy9eWeRgJS2DE1/HJ4-Emv6Ck_rgM_dLtyV4QwZTPg7Kqv5upt9ygPTQPM",
    "price": 3.1,
    "prevClose": 3.02,
    "absReturn": 0.08000000000000007
  },
  {
    "fullTicker": "BE:USA",
    "baseTicker": "BE",
    "rank": 10.8203,
    "description": "Bloom Energy Corporation designs, manufactures, sells, and installs solid-oxide fuel cell systems for on-site power generation in the United States and internationally. It offers Bloom Energy Server, a power generation platform to convert fuel, such as natural gas, biogas, hydrogen, or a blend of these fuels, into electricity through an electrochemical process without combustion. The company also provides Bloom Electrolyzer for producing hydrogen. It sells its products through direct and indirect sales channels to utilities, data centers, agriculture, retail, hospitals, higher education, biotech, and manufacturing industries. The company was formerly known as Ion America Corp. and changed its name to Bloom Energy Corporation in 2006. Bloom Energy Corporation was incorporated in 2001 and is headquartered in San Jose, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/Bj63vWdPPjnfE9d1YnIHOQ/54jzHxD-6wm1-TCrz6lTWKMNYpWx2G8QvulRLHPK0SjTcd6VV-SqxB5R6KJAyIQDflBQZGtygs6xxcvmLakZt1uImvqeaiot3h9m7hsJUzeaSjQqwp38b6EZQA5WicvIwvBI8dDfErSjxthSqeAzuTnhxfDVwdELGjLof0FXj6919Wyd3MbsjFAmBw9se1W8/EE_oijO1otExb302IbwQ0R_Q3ySxfgOhvxylcshDFCU",
    "price": 21.75,
    "prevClose": 21.5,
    "absReturn": 0.25
  },
  {
    "fullTicker": "HRL:USA",
    "baseTicker": "HRL",
    "rank": 14.0077,
    "description": "Hormel Foods Corporation develops, processes, and distributes various meat, nuts, and other food products to foodservice, convenience store, and commercial customers in the United States and internationally. It operates through three segments: Retail, Foodservice, and International segments. The company provides various perishable products that include fresh meats, frozen items, refrigerated meal solutions, bacons, sausages, hams, and guacamoles; and shelf-stable products comprising canned luncheon meats, nut butters, snack nuts, chili, shelf-stable microwaveable meals, hash, stews, tortillas, salsas, tortilla chips, nutritional food supplements, and others. It sells its products under the HORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHI'S, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DAN'S PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST N EASY, FIRE BRAISED, FONTANINI, HERDEZ, HORMEL GATHERINGS, HOUSE OF TSANG, JENNIE-O, JUSTIN'S, LA VICTORIA, LAYOUT, LLOYD'S, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER'S SMOKEHOUSE, SKIPPY, SPAM, SQUARE TABLE, SPECIAL RECIPE, VALLEY FRESH, and WHOLLY brands through sales personnel, independent brokers, and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/j2XOUZ3GpB8LszpbNNwwhg/ZRjTJqGpXtSJrjAeszgpp3h2XvsSbhXP58ZZWb5WJ0HQE74V9BX4j0S0R2rs28_IGUP7b6npOwdrOUs86zmoJ0a2fQgNwQ3gbxT8pmYde9IGTidrNUGC5uPSGqKKymOHTyCRaA3zip-LothahlYRJz7Fhj-GMK_dj2NN-iRvwzZNVkP-rYxgfBKNk-tMtDMT/dO3y0U87v0UE3DQUaoxACzpGKgf4ho3y9a7CRDC-Ob8",
    "price": 30.41,
    "prevClose": 30.16,
    "absReturn": 0.25
  },
  {
    "fullTicker": "DBI:USA",
    "baseTicker": "DBI",
    "rank": 29.7601,
    "description": "Designer Brands Inc., together with its subsidiaries, engages in the design, production, and retailing of footwear and accessories in the United States and Canada. It operates through three segments: U.S. Retail, Canada Retail, and Brand Portfolio. The company offers dress, casual, and athletic footwear and accessories, as well as handbags for women, men, and kids. It sells its products under the Vince Camuto, Keds, Topo, as well as Jessica Simpson, Lucky Brand, Le Tigre, and Hush Puppies brands. The company offers its products through its direct-to-consumer stores and e-commerce sites; and a portfolio of banners, including DSW Designer Shoe Warehouse, The Shoe Co, and Rubino; and mobiles applications. The company was founded in 1991 and is based in Columbus, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/39Z35udt3DKX2-hA2M_JLQ/4LGbunnGo7sQg0p61HSSXMYaYBaGCbDHHvgC5qKpuuA75i_TDU_hvj4Hc-lZkD9UMrDq6ZdaZMFfZRUSd64d7pl13t0qrL5OdsvgX7CdYOs9g0thaKgSL4nwA7I4Uz-u9JRhaKyIaiot-jKMAafizELuNl9fyWtcDO5bmXqX5uU-30LCI8kzXt0gAod3uiEH/LbGyZDpR3qHY4fMFPM3AlYWCVtLtRWZ4VBBOLmoK340",
    "price": 2.29,
    "prevClose": 2.28,
    "absReturn": 0.010000000000000231
  },
  {
    "fullTicker": "LEE:USA",
    "baseTicker": "LEE",
    "rank": 39.4565,
    "description": "Lee Enterprises, Incorporated provides local news and information, and advertising services in the United States. The company offers digital subscription platforms; daily, weekly, and monthly newspapers and niche publications; and web hosting and content management services. It provides advertising and marketing services, such as audience extension, search engine optimization, search engine marketing, web and mobile production, social media services, and reputation monitoring and management. In addition, the company offers integrated digital publishing and content management solutions for creating, distributing, and monetizing multimedia content for media publications, universities, television stations, and niche publications. Further, it provides commercial printing services; distributes third party products, as well as operates a digital marketing services agency. Lee Enterprises, Incorporated was founded in 1890 and is based in Davenport, Iowa.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/IEIUAaTRzdRhQKk--rXGzA/ijuYWJxk_v9YJ0Q6nSJpyBIOqbZHiMfIb3D-77e4vAKCX4cVbqi2qeX-NWgQHKG7vfaDl6kYXKRKAwewc5y69lCBYxsJ5cAInvwK9VE2cm5BuG7xjMOCIvLVjieb6M57kooyUL50_yf7Y0RY3RwUFNWlcAEyEtm63wds0qPugWRE3urdeJqVLzohZjjk7edV/sVEuscoLr5X5ETiZQlhzwgyj0zPFA0gpaR52k2VhAZw",
    "price": 6.16,
    "prevClose": 6.42,
    "absReturn": -0.2599999999999998
  },
  {
    "fullTicker": "GAP:USA",
    "baseTicker": "GAP",
    "rank": 43.382,
    "description": "The Gap, Inc. operates as an apparel retail company. The company offers apparel, accessories, and personal care products for men, women, and children under the Old Navy, Gap, Banana Republic, and Athleta brands. Its products include adult apparel and accessories; and lifestyle products for use in yoga, training, travel, and recovery activities for women and girls. The company offers its products through company-operated stores, franchise stores, websites, and third-party arrangements, as well as licensing partnerships. It has franchise agreements to operate Old Navy, Gap, Banana Republic, and Athleta in Asia, Europe, Latin America, the Middle East, and Africa. The Gap, Inc. was incorporated in 1969 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/fwFArZbCZmF_sk_E7DYOuQ/aFV1NzGDXB9HL3bEoRjrmVPNZ3Mws3IdcVxH7nFvmypzPckvz2Wk1mgv0vgV3OGrYZ9zd-NG2kf2QwudvI2JdxKjId5jB-Tri-hbu_VE96svQLWn1zx4i89Ma-AqsNRRMejSEEq69fnX3QEJyLSxY6uZe6GDEE4F7fMglRsIG9w/DQvcdWP1izybFPKF2Jg4iN7OcTKO2FE-ViOqIuRvr_s",
    "price": 21.34,
    "prevClose": 20.86,
    "absReturn": 0.4800000000000004
  },
  {
    "fullTicker": "ATRC:USA",
    "baseTicker": "ATRC",
    "rank": 58.3459,
    "description": "AtriCure, Inc. develops, manufactures, and sells devices for surgical ablation of cardiac tissue, exclusion of the left atrial appendage, and temporarily blocking pain by ablating peripheral nerves to medical centers in the United States, the Asia-Pacific, and internationally. The company offers Isolator Synergy Clamps, a single-use disposable radio frequency products; multifunctional pens and linear ablation devices, a single-use disposable RF products for the treatment of cardiac arrhythmias; cryoICE Cryoablation System that enables the user to make linear ablations of varied lengths; and EPi-Sense Systems, a single-use disposable device used for the treatment of symptomatic, drug-refractory, and long-standing persistent atrial fibrillation. It also provides cryoSPHERE probe, which provides temporary pain relief by applying cryothermic energy to targeted intercoastal peripheral nerves in the ribcage; AtriClip System, an implantable device coupled to a single-use disposable applier; LARIAT System, a solution for soft-tissue closure; Lumitip dissectors to separate tissues to provide access to key anatomical structures that are targeted for ablation; Glidepath guides for placement of clamps; and Subtle Cannula's to support access for EPi-Sense catheters. In addition, the company sells various reusable cardiac surgery instruments. It markets and sells its products through independent distributors and direct sales personnel. The company was incorporated in 2000 and is headquartered in Mason, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/pUedwsRJGrVwDrfBKX00uQ/074Hyfuy7HvQ_8UWGaZkE50vHJCTEyr9nqrk5Dga7lUUGobyM6Au20Gdm7GzaSS2MSF2KuzVitWFzWyjJG28KQzKXjpyAqzRij-DJOPlTA7zMEH_BqRalhfNJ_PPoszXISM1l1Ml-qR8GHPJCutIW0dHxe0eg6Y7xPB1t3PKKlg/pQDDykKW3oLKUDIPKE7yQ_XxHxXPOTmX4SSfW1ZWZWY",
    "price": 31.4,
    "prevClose": 31.61,
    "absReturn": -0.21000000000000085
  },
  {
    "fullTicker": "LIN:USA",
    "baseTicker": "LIN",
    "rank": 61.9191,
    "description": "Linde plc operates as an industrial gas company in the United States, China, Germany, the United Kingdom, Australia, Mexico, Brazil, and internationally. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, electronic gases, specialty gases, acetylene, etc. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations consist of air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries comprising healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. Linde plc was founded in 1879 and is based in Woking, the United Kingdom.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/DwV-_kyNMChyF5U-1WDfEA/2W7-6hE1my4Bi8ooxOiUw5pDqnZ8XWLp4-cObQVrCq0XM3ucreAnoMGzYczNy0DgzEILfHgMkOIM5tta-C_l9zebWdZcVEPwG3O-I5y513RvwO2VQZ-PeEqeYjuoySfVGZUtrur-3hlhVSw7HIWtW4ltxbdOCWb8fcq5FylLxx8/zgCqz3rqO_OFGjZS--xMXx7rXSQ9U-PPyIfIASJgpg4",
    "price": 455.86,
    "prevClose": 458.7,
    "absReturn": -2.839999999999975
  },
  {
    "fullTicker": "RMBS:USA",
    "baseTicker": "RMBS",
    "rank": 80.6241,
    "description": "Rambus Inc. manufactures and sells semiconductor products in the United States, South Korea, Singapore, and internationally. The company offers DDR memory interface chips comprising DDR5 memory interface chips which include registering clock driver, multiplexed registering clock driver, multiplexed data buffer, power management integrated circuits, serial presence detect hubs, temperature sensors, and client clock driver products; and DDR4 memory interface chips. It also provides silicon IP, such as interface and security IP solutions that move and protect data in advanced data center, government, and automotive applications; interface IP solutions for high-speed memory and chip-to-chip digital controller IP; security IP solutions, including crypto cores, hardware roots of trust, high-speed protocol engines, and chip provisioning technologies. In addition, the company offers portfolio of patents that covers memory architecture, high-speed serial links, and security products. It sells its products to memory module manufacturers, OEMs and hyperscalers, as well as to chip makers. The company markets its products and services through its direct sales force and distributors. Rambus Inc. was incorporated in 1990 and is headquartered in San Jose, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/uPQE9yphA6HTlmqCBPrfeA/7qogBPb1GqgAVk1vrRhBElIxm-sHsWAwb9cuu4tyc8JQBqPZCUBxdZO1UzZ6xJ1UyJ2rh73RtS1OBLI_8sWOKnK2Nm5780THzRL2hHJ_Va_JXuvARtoHCA-pPbHhZ1ybQo-eguQSQSgrov8-yZV2koa8-W6Ir2OqodelT1kR_DA/RFS3pcMpeZNBMpzRgDkryjRJueU1K7G0Ze5rY0JQF9I",
    "price": 59.38,
    "prevClose": 60.55,
    "absReturn": -1.1699999999999946
  },
  {
    "fullTicker": "PGNY:USA",
    "baseTicker": "PGNY",
    "rank": 89.5152,
    "description": "Progyny, Inc., a benefits management company, provides fertility, family building, and women's health benefits solutions in the United States. The company offers fertility benefits solutions, such as differentiated benefits plan design that includes smart cycle treatment bundle; personalized concierge-style member support services; and a selective network of fertility specialists. It also offers Progyny Rx, an integrated pharmacy benefits solution that provides access to the medications needed during their treatment and offers care management services. In addition, the company offers assistance service program where various services can be offered through a reimbursement program, including adoption, surrogacy, doula, and travel reimbursement when travel is required to receive medical services. The company was formerly known as Auxogyn, Inc. and changed its name to Progyny, Inc. in 2015. Progyny, Inc. was incorporated in 2008 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1750636800000/bprG_qFdYF4n1kXBfwvGhA/uB8wIxzB9lw6snz_ea2h85lZ31fdi3pV5DRFAVCLkSc2igrcTs5tXNsOmX27vv1j_0bGmbQ9xjA-XP30KijGi1dj2bAbFwjpyRX6jumyBFwYs_Qh085BgZeO75rREpr9b_Q50BKshRbGlUoJz8mJ8X3AYVe0nmNCJVsVLrWaVWY/1UwI-MSeLhKjB4oyZGfnR6rM1wUqsheK2kIQVHqkjqA",
    "price": 20.98,
    "prevClose": 21.65,
    "absReturn": -0.6699999999999982
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 594.28,
    "prevClose": 595.67474973375,
    "absReturn": -1.394749733750018
  }
]