[
  {
    "fullTicker": "LUCD:USA",
    "baseTicker": "LUCD",
    "rank": 3.3932,
    "description": "Lucid Diagnostics Inc. operates as a commercial-stage medical diagnostics technology company in the United States. The company focuses on patients with gastroesophageal reflux disease (GERD) who are at risk of developing esophageal precancer and cancer, primarily highly lethal esophageal adenocarcinoma. Its flagship product, the EsoGuard Esophageal DNA Test performed on samples collected with the EsoCheck Esophageal Cell collection device, a testing tool with the goal of preventing EAC deaths through early detection of esophageal precancer in at-risk GERD patients. The company was incorporated in 2018 and is based in New York, New York. Lucid Diagnostics Inc. operates as a subsidiary of PAVmed Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/nBR9gO1Ggk3f7HhAWnaecQ/TP_GN_psFPRqdmptAuEz3cAF5IkbSclb_U9QNBXlrIBmsilzs7Y2ZtNL_NjNyTvrd0VmXNwMl3WEXdikCjYE8zMff7MIPYcBj0UbciyowZOo7XWxp1OpM9vH_usysE4UyeudHqR6QOGjiQz8hgrk3SQD9R_C7USZFiGikomxCOf1fw35EHEcA7T0ATXcytM7/f46Zwfdz5-dnr6wCU0OcuoAGVnOnCO_vhJyh1UTeeq8",
    "price": 0.9913,
    "prevClose": 0.9811,
    "absReturn": 0.010199999999999987
  },
  {
    "fullTicker": "DMAC:USA",
    "baseTicker": "DMAC",
    "rank": 8.7492,
    "description": "DiaMedica Therapeutics Inc., a clinical stage biopharmaceutical company, focuses on improving the lives of people suffering from serious diseases with a focus on acute ischemic stroke. Its lead candidate is DM199, a pharmaceutically active recombinant form of the human tissue kallikrein-1 protein, which is in Phase II/III trials for the treatment of acute ischemic stroke, as well as that is in Phase 2 to treat cardio-renal disease. The company also develops DM300, which is in preclinical stage for the treatment of severe inflammatory diseases. In addition, it develops treatment for neurological disease. The company was formerly known as DiaMedica Inc. and changed its name to DiaMedica Therapeutics Inc. in December 2016. DiaMedica Therapeutics Inc. was incorporated in 2000 and is headquartered in Minneapolis, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/mBQRGBn96FCkeewc1MiB3A/ejQIyjjHe8ToqWueesBpjGp7NvdMltFDrnF7YrwxJWbJ9RAAFHqENCht4cEXIF9xpOVOkCNi8fgO8E0392AY4JernE06N8dFUhPgLHxOyO5rSF6Gz7f7XVNVA6WgDft7q4WQNvgSwez1SwIKzsOtcjs9sEuqBYSgo6ihh3wfxNsdptetqMESc-IYd9ZjYQDU/1bX_DMVdcie3FYDe8MBYFH6ilMDyssGFZQr6-5mPc6A",
    "price": 6.115,
    "prevClose": 6.01,
    "absReturn": 0.10500000000000043
  },
  {
    "fullTicker": "PTEN:USA",
    "baseTicker": "PTEN",
    "rank": 22.2222,
    "description": "Patterson-UTI Energy, Inc., through its subsidiaries, provides drilling and completion services to oil and natural gas exploration and production companies in the United States and internationally. It operates through three segments: Drilling Services, Completion Services, and Drilling Products. The Contract Drilling Services segment engages in the provision od contract and directional drilling, and measurement-while-drilling (MWD) services in onshore oil and natural gas basins; supply and rental of downhole performance motors, such as Mpact drilling motors, and Mpower MWD systems; electrical controls and automation to the energy, marine and mining industries; and servicing and re-certification of equipment for drilling contractors. This segment also provides software and services, such as MWD Survey Fault Detection, Isolation and Recovery (FDIR) services, a data analytics technology to analyze MWD survey data in real-time and identify the position of a well; HiFi Nav, which enhances FDIR by targeting improved vertical placement of the directional well within the reservoir; and HiFi Guidance, utilizes trajectory optimization to determine optimal steering recommendations and placement within the reservoir. The Completion Services segment offers services for hydraulic fracturing, wireline and pumping, completion support, and cementing; and is involved in the power solutions natural gas fueling, and last mile logistics and storage businesses. The Drilling Products segment engages in the design, manufacture, sale, and rental of matrix and steel-bodied polycrystalline diamond compact drill bits. It also rents oilfield tools; and offers specialized services for land-based oil and natural gas drilling, completion, and workover activities. The company was founded in 1978 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/rrLorUoQrMIiVLCSbgMmpg/MITCQeBKyr9l4gge7mxIsc_2_frXQ4TeNkhJGYYAQJfII1kZ26ogU-s8iB-fN7q7Ei9IReXjCKYMpsy7o3Fd416UkURsH3jGtgEywdXUhYD1HEZm4G4QedTqPdJE5Bd_0nzbjiyus6WQFWbTQGQbaWZ77TLFezZt9TtlzpaLRzFnzpVh9kPWJq6UDxhIXCnb/YqGoaoy1NpN3LBF7VH4DFhk3VDA1bQE5-V1xMsRdhGM",
    "price": 5.495,
    "prevClose": 5.61,
    "absReturn": -0.11500000000000021
  },
  {
    "fullTicker": "ELUT:USA",
    "baseTicker": "ELUT",
    "rank": 26.7964,
    "description": "Elutia Inc., a commercial-stage company, develops and commercializes drug-eluting biologics products for neurostimulation, wound care, and breast reconstruction in the United States. The company operates in three segments: Device Protection; Women's Health; and Cardiovascular. It offers CanGaroo Envelope, which is used to accommodate cardiac implantable electronic devices, such as pacemakers and internal defibrillators. The company also develops CanGarooRM, a combination of the CanGaroo envelope with antibiotics, to reduce the risk of infection after surgical implantation of an electronic device. In addition, it provides ProxiCor for cardiac tissue repair and pericardial closure; Tyke, an extracellular material that is used in the repair of cardiac structures for neonate and infant patients; and VasCure, a patch material to repair or reconstruct the peripheral vasculature. Further, the company offers SimpliDerm, which uses human acellular dermal matrices for tissue repair and reconstruction in various applications, such as sports medicine, hernia repair, trauma reconstruction, and breast reconstruction surgeries following mastectomy. It serves hospitals and healthcare facilities through its direct sales force, independent sales agents, and distributors. The company was formerly known as Aziyo Biologics, Inc. and changed its name to Elutia Inc. in September 2023. Elutia Inc. was incorporated in 2015 and is headquartered in Silver Spring, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/7BskCEuj6s1B2TweKJVWkA/387XBTovQb-2niOMO27oEETVa335VMpIVfZmskYzrhYxFxTDIKpNYppsaXl9KcTrX3anr6qZv4D72a4uEXwREEm6OeCUgjap_w-2t85hIiXFpa_p1lshTrpGMjmQM41xoEt1ehNR6xU7aoC42TSW3xsHW1ovesm44PMSHYliTJ0/IDzPf5vivQI5ZDiyRLsyLJXXJ1hnxDMOAv72cBRFNn4",
    "price": 1.92,
    "prevClose": 2.15,
    "absReturn": -0.22999999999999998
  },
  {
    "fullTicker": "BTU:USA",
    "baseTicker": "BTU",
    "rank": 32.5848,
    "description": "Peabody Energy Corporation engages in coal mining business. It operates through Seaborne Thermal, Seaborne Metallurgical, Powder River Basin, Other U.S. Thermal, and Corporate and Other segments. The company is involved in the mining, preparation, and sale of thermal coal primarily to electric utilities; mining bituminous and sub-bituminous coal deposits; low sulfur and high British thermal unit thermal coal; and mining metallurgical coal, such as hard coking coal, semi-hard coking coal, semi-soft coking coal, and pulverized coal injection coal. It supplies coal primarily to electricity generators, industrial facilities, and steel manufacturers. In addition, the company engages in trading of coal and freight-related contracts, as well as provides transportation-related services. It operates in the United States, Japan, China, Australia, Taiwan, Indonesia, Brazil, Malaysia, Belgium, India, France, Vietnam, South Korea, Germany, and internationally. Peabody Energy Corporation was founded in 1883 and is headquartered in Saint Louis, Missouri.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/ZH04855ChhLYm_HpZnOIOQ/c5RQ3UhZWqdoeWemxbQA8LV-05VpYOyHiQpQ_Svcs1t5mLTncj2HAkH0xF2Sz0MjLdPZpN7dSOZc7lF8bm4mnFM7wH1ZtH1_wSBnCE4aUeBhlUDcecrfkd-xAaDpgEkrf4j16H2-4ueiwJj-M8FqJmpd3HSXyhmORZriPC44g50i6pgxUZwlxguxkj2_4gCV/jaE_6InbcblWilpGRKeez-_q7GGFMrpOj9Pfr2y839A",
    "price": 17.73,
    "prevClose": 17.97,
    "absReturn": -0.23999999999999844
  },
  {
    "fullTicker": "CATO:USA",
    "baseTicker": "CATO",
    "rank": 43.4464,
    "description": "The Cato Corporation, together with its subsidiaries, operates as a specialty retailer of fashion apparel and accessories primarily in the southeastern United States. It operates through two segments, Retail and Credit. The company's stores and e-commerce websites offer a range of apparel and accessories, including dressy, career, and casual sportswear; and dresses, coats, shoes, lingerie, costume jewelry, and handbags, as well as men's wear, and lines for kids and infants. It operates its stores and e-commerce websites under the Cato, Cato Fashions, Cato Plus, It's Fashion, It's Fashion Metro, and Versona names. It also provides credit card services to its customers, as well as layaway plans for customers. The Cato Corporation was incorporated in 1946 and is headquartered in Charlotte, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/seXVmG2o4U9TpEZriNhg0A/_LwYsGbELcbNKRbYYbwaEjS-yvvnDEq3jCjltAGg2wuSdPJ_1DgDfD3lES1VY79hPq31lLTadaqaI13fXWx4qchTJsBaEJEhvK7y8lSWFhbq1WhRkPksu2XueaBYYuraX4H8kFX0VFIDNdPxuJlfkW3HtOzbldRe6c4rPg2IFzA/67XD30D-bGyirdlt2Go7kEzqxpP4ykNAHvwsnQYy-zA",
    "price": 2.82,
    "prevClose": 2.84,
    "absReturn": -0.020000000000000018
  },
  {
    "fullTicker": "MTN:USA",
    "baseTicker": "MTN",
    "rank": 62.8077,
    "description": "Vail Resorts, Inc., through its subsidiaries, operates mountain resorts and regional ski areas in the United States and internationally. It operates through three segments: Mountain, Lodging, and Real Estate. The Mountain segment operates destination mountain resorts and regional ski areas. This segment is also involved in the ancillary activities, including ski school, dining, and retail/rental operations, as well as real estate brokerage activities. The Lodging segment owns and/or manages various luxury hotels and condominiums under the RockResorts brand; other lodging properties; various condominiums located in proximity to the company's mountain resorts; destination resorts; and golf courses, as well as offers resort ground transportation services. This segment operates owned and managed hotel and condominium units. The Real Estate segment owns, develops, and sells real estate properties. The company was founded in 1962 and is based in Broomfield, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/3MFJTd0rJUhFWD7KZ8_utw/Fra5OychxYH2fQKvmV5zKpxgnoiBknHDzhIZKoyT_a35xLr5pakwGnOppTkVlZMSufenHhSk499kmTnoY1doqNKsUlCapJQ7qdlNHwhiwZ37rpuBgXGQ6us9nBUZDG8x1Rz_VH4DOxWijG9qgaG1BGYpCkTl8X7zQzX0nvnsOxNCv2dB5BQ5-4xJeWDyuETS/6VNKK2hmC0t1_JIWmiBYohyY_-UHaiynKFitWfUC0KI",
    "price": 153.25,
    "prevClose": 152.45,
    "absReturn": 0.8000000000000114
  },
  {
    "fullTicker": "LEA:USA",
    "baseTicker": "LEA",
    "rank": 70.3925,
    "description": "Lear Corporation designs, develops, engineers, manufactures, assembles, and supplies automotive seating, and electrical distribution systems and related components for automotive original equipment manufacturers in North America, Europe, Africa, Asia, and South America. Its Seating segment offers seat systems, seat subsystems, keyseat components, seat trim covers, seat mechanisms, seat foams, and headrests, as well as surface materials, such as leather and fabric for automobiles and light trucks, compact cars, pick-up trucks, and sport utility vehicles. The company's E-Systems segment provides electrical distribution and connection systems that route electrical signals and networks; and manage electrical power within the vehicle for various powertrains. This segment's products comprise wire harnesses, terminals and connectors, engineered components, and junction boxes; electronic system products, including body domain control modules, smart and passive junction boxes, gateway and communication modules, integrated power modules, and high voltage switching and power control systems. It also offers software and connected services comprising Xevo Market, an in-vehicle commerce and service platform; and software and services for the cloud, vehicles, and mobile devices. In addition, this segment provides cybersecurity software; advanced vehicle positioning for automated and autonomous driving applications; and short-range communication and cellular protocols for vehicle connectivity. It offers its products and services under the XEVO, GUILFORD, EAGLE OTTAWA, ConfigurE+, INTUTM, LEAR CONNEXUSTM, EXO, JOURNEYWARE, ProTec, SMART JUNCTION BOX, STRUCSURE, AVENTINO, and TeXstyle brands. Lear Corporation was founded in 1917 and is headquartered in Southfield, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/6f9bBSs4ipJ_27Cw0_vbZg/_7GWBpl1r50Gz024WTQuPsSuiHm_Favi8y0j8DV6XCdo2kmGiGvqiFNqupIT3k_f_iDpZfGuEJEkMbQrjVrgC0v64I40rn_qp_rag7b7GN-oqzW9bPhEhZu4GedJ4ulGw8WwmO6v_J1bRntW8MbaTFkHv7BRrEA3lHyHzpMrNRJrCY_MVnLjTMMdOYSdhtNm/2lsRH9EQa1LqlLtkHZMa5OlqXy3XuBibpJjGYOP7lJo",
    "price": 102.895,
    "prevClose": 103.32,
    "absReturn": -0.42499999999999716
  },
  {
    "fullTicker": "QRVO:USA",
    "baseTicker": "QRVO",
    "rank": 84.3979,
    "description": "Qorvo, Inc. engages in development and commercialization of technologies and products for wireless, wired, and power markets worldwide. It operates through three segments: High Performance Analog (HPA), Connectivity and Sensors Group (CSG), and Advanced Cellular Group (ACG). The HPA segment supplies radio frequency and power management solutions for defense and aerospace, and 5G and 6G infrastructure markets. The CSG segment supplies connectivity and sensor solutions featuring various technologies, such as UWB, Matter, Bluetooth Low Energy, Zigbee, Thread, Wi-Fi, cellular IoT, and MEMS-based sensors. It serves smart home, industrial automation, automotive, smartphones, wearables, gaming, and industrial and enterprise access points markets. The ACG segment supplies cellular RF solutions for smartphones, wearables, laptops, tablets, and various other devices. It also offers foundry services for defense primes and other defense and aerospace customers. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/iBG-1ZNrsSSsO7ftNX4gqw/4tmgMem0lpbSBfULLqg1AXgNOcRaBxyFNeYbfqKoB66gT90lzyhNTr5PoOLp1TP9x-uGW6q0u1Wj_u-dynUQqRiiBGnOkn_CYP-s7Fey3oR03O7e40uK1kOGRWzFoJyEz6H8gBnIUWxbKgs93gbnVMM5MQXTKi_ZbKr-HHjx9_w/SGezPpJWXe1muL6EV2UhjRNV9oa4cba97UjQ2QOF_24",
    "price": 89.795,
    "prevClose": 90.66,
    "absReturn": -0.8649999999999949
  },
  {
    "fullTicker": "BMBL:USA",
    "baseTicker": "BMBL",
    "rank": 92.4651,
    "description": "Bumble Inc. provides online dating and social networking applications in North America, Europe, internationally. It owns and operates websites and applications that offers subscription and in-app purchases of products. The company operates apps, including Bumble, a dating app built with women at the center, where women make the first move; Badoo, the web and mobile free-to-use dating app; Bumble BFF and Bumble Bizz Modes that have a format similar to the date mode requiring users to set up profiles and matching users through yes and no votes, similar to the dating platform; and Bumble for Friends, a friendship app where people in all stages of life can meet people nearby and create meaningful platonic connections, as well as Geneva app where users can create and join chat, forum, audio, video, and broadcast rooms. The company was founded in 2020 in and is headquartered in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/44/44/1755280800000/9_0tbm6N3aWfr8yA2PGUnw/JDm5l73dPDkLFZ8lFbK76NCBTZUxUgEzD8fneRlIkQAP449FjifCiFuWAGTetNgRjLXTXQCTOZI-7L6i3Ge74hDTva4t5irxi7PsX9XlqX8Xpoj_bhwhxvRL8g1iYOek1PsmN61uQTazJfQkG84EIAiQOoA4MuEA_dxZyj5WTT0/kPcP7Tsw1QoPWns-IPMhO5FhZDHaDTEQE3W6Xy4VKoA",
    "price": 6.135,
    "prevClose": 6.07,
    "absReturn": 0.0649999999999995
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 643.915,
    "prevClose": 644.95,
    "absReturn": -1.0350000000000819
  }
]