[
  {
    "fullTicker": "SAIL:USA",
    "baseTicker": "SAIL",
    "rank": 4.3689,
    "description": "SailPoint, Inc. provides solutions to enable various identity security for the enterprise in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. Its solutions address various types of systems and identities, including data and applications, employee identities, non-employee identities, and machine identities, as well as enable smarter access decisions, improve business processes, and provide deeper understanding of identity and access. The company offers Identity Security Cloud, a SaaS-based cloud solution to manage and secure access to critical data and applications for enterprise identities; and IdentityIQ, a customer-hosted identity security solution. The company was founded in 2005 and is based in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/aQllENvdlCikF7AoZC13tg/AezmeqEyFJusmjDwCLX5vpdknw_diAGKIlBphc8DgbC4kQHW516Fc85H0vdmDJ2yq7su8lL4ksgzND9E9OrUc1QoNdtR0ky0sDt8H64mcjzslXIEtie0qt0HQnQpl0Qnu9iH9QX8ijsRHhyjRGslhUbR4_-HLoT8ME7r-8ZbaZ08ZJWOeUxrvepKCIF8VlgUE__nYf-r1mY6uWtiFsduYQ/an8hdCcYZIvEivLVc8s8TLb96E5NpeqsB-OXanbuKls",
    "price": 14.1,
    "prevClose": 14.37,
    "absReturn": -0.2699999999999996
  },
  {
    "fullTicker": "SXTP:USA",
    "baseTicker": "SXTP",
    "rank": 13.0906,
    "description": "60 Degrees Pharmaceuticals, Inc., a specialty pharmaceutical company, engages in the development and commercialization of therapies for the prevention and treatment of infectious diseases in the United States. The company offers Arakoda for malaria preventative treatment. It also engages in the development of Tafenoquine (Arakoda regimen) that is in Phase IIb clinical trial for COVID-19 indications; Tafenoquine, which is in phase IIA clinical trials for babesiosis, fungal pneumonias, and candidiasis disease; and Celgosivir for respiratory viruses and dengue. It also has patent license agreement with Tufts Medical Center to jointly advance the development and commercialization of tafenoquine for the treatment and prevention of babesiosis. The company was founded in 2010 and is headquartered in Washington, District Of Columbia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/qVHxa8380xbrc7kH8VmpAg/XiZ8xVRntSvCK5Kbx9uKefNkGXG2ZfVxPMhCU6WXAbnbcDASL7qg69NL2NsLlBgkLHjhoLONaq01q4LL3l9ROYjkXICZuzBeICa5IgzU3UfXFyOlb10k2hiAh3Efyx3HJCGCn-61d7V7fCG53T1DwZSK6nbww8bfWzXQNMP5_RV64q3ykH7tCV6rhxOJ_Ycls9LdMWpJ6nou53DbI0aMmw/L4uQZ4DkZ_dxWcYf8EuaosOk3IJ9YoGEBJUIh3-UzY0",
    "price": 3.11,
    "prevClose": 2.96,
    "absReturn": 0.1499999999999999
  },
  {
    "fullTicker": "SOPH:USA",
    "baseTicker": "SOPH",
    "rank": 17.6537,
    "description": "SOPHiA GENETICS SA operates as a cloud-native software technology company in the healthcare space. It offers SOPHiA DDM platform, a cloud-native software platform for analyzing data and generating insights from multimodal data sets and diagnostic modalities. Its SOPHiA DDM platform and related solutions, applications, products, and services are used by hospitals, laboratories, and biopharmaceutical companies through its own sales force as well as distributors and industry collaborators in Switzerland, France, Italy, rest of Europe, North America, the United States, Latin America, and the Asia-pacific. SOPHiA GENETICS SA was incorporated in 2011 and is based in Rolle, Switzerland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/6qu0OLBVJcSfmxLp7-Fe_g/09JY6XEPEeqrU5IwwIldV4FHFW0O_1O4dM6HgoSVUj3JUxMagPXW4L9s89di24dJsFcgGPIcPARCjo1wT6X1RPztYngAEIB6X1PpVMnQkOZbhTq5r090kBfAS7z_8rCMzc8nm4HPKP0PV2kN0EjLL6nqelBQpu9WlxiEEysVT7tjvoRymUrC-PrVR-rljbrs/KRo-zGcJKqsCLXbhSS5Rd7-AGdiWU20KJWUwIpxdZvI",
    "price": 4.5,
    "prevClose": 4.57,
    "absReturn": -0.07000000000000028
  },
  {
    "fullTicker": "DIN:USA",
    "baseTicker": "DIN",
    "rank": 31.068,
    "description": "Dine Brands Global, Inc., together with its subsidiaries, owns, franchises, and operates restaurants in the United States and internationally. The company operates through four segments: Franchise operations, Rental operations, Financing operations, and Company restaurant operations. The company franchises the restaurants operated by Applebee's franchisees, IHOP franchisees, and Fuzzy's franchisees in the United States. It owns, franchises, and operates restaurant concepts, including Applebee's Neighborhood Grill + Bar within the casual dining category; IHOP in the family dining category of the restaurant industry; and Fuzzy's Taco Shop within the fast-casual dining category. In addition, its Applebee's restaurants offer American fare with drinks and local draft beers; IHOP restaurants provided full table services and food and beverages; Fuzzy's Taco Shop offers baja-style mexican food, such as baja tacos, chips and queso, guacamole, and salsa made in house; and a full bar including margaritas, and cold draft beer. The company was formerly known as DineEquity, Inc. and changed its name to Dine Brands Global, Inc. in February 2018. Dine Brands Global, Inc. was founded in 1958 and is headquartered in Pasadena, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/A1ixLd_KFIqijYM3JEiKYQ/MkbNFF1NILEYW-ZZkudEt4FNNEvEPLAyPtW3a_8mfsod6NKBp1t4smS39yteS3gYC_b8D761mQIK8kTzwD1qlKp-LKej3bvvDhMbi0r2ehD1ob4HSYOr4TdmYMS5YhtfJCNKoHXaZpL2S-xfxsKP1xprGLA16yaRSRwP7gjbn-B81qQVKRsa8NWWTuXYJwlX/nyr8A30roNu5jI6af4Paxok5qGU2c6r7UNGPWwKSohw",
    "price": 30.96,
    "prevClose": 31.32,
    "absReturn": -0.35999999999999943
  },
  {
    "fullTicker": "ALCO:USA",
    "baseTicker": "ALCO",
    "rank": 33.3657,
    "description": "Alico, Inc., together with its subsidiaries, operates as an agribusiness and land management company in the United States. The company operates in two segments: Alico Citrus, and Land Management and Other Operations. The Alico Citrus segment engages in planting, owning, and cultivating or managing citrus groves to produce fruit for sale to fresh and processed citrus markets, as well as purchasing and reselling of fruit and value-added services, which includes contracting for the harvesting, marketing, and hauling of citrus. The Land Management and Other Operations segment engages in the grazing and hunting leasing, management, and/or conservation of unimproved native pastureland, and activities related to rock mining royalties and other business; and owning or leasing of improved farmland. The company was incorporated in 1960 and is based in Fort Myers, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/xwD3z1MdWA3a2Vj7XYGKcA/VYZ--PwnGp706pa118nnIS8EBSZ8LIhO2Nldv_jU6ANfQ175w94H1FH8jf8qvkRkp83d8OkDqqPNI1gY3dNVibF2W8glZpd7yYd75Nru-U3Ndej70v2O4QftkIacfsGAmypaJl9eCcQEPrSE4QWqVVpM6BoPGbC03DO23fBBtpg/lFQvCRJC0mpgORJ0vk8r3rvj45VtQDgiAi_DLxn8uTA",
    "price": 41.28,
    "prevClose": 41.49,
    "absReturn": -0.21000000000000085
  },
  {
    "fullTicker": "VTSI:USA",
    "baseTicker": "VTSI",
    "rank": 52.233,
    "description": "VirTra, Inc. provides use of force training and firearms training simulators for the law enforcement, military, and commercial markets worldwide. Its patented technologies, software, and scenarios provide intense training for de-escalation, judgmental use-of-force, marksmanship, and related training that mimics real-world situations. It offers V-300 simulator, a 300 degree wrap-around screen for simulation training; V-180 simulator, a 180 degree screen for smaller spaces or budgets; V-100, a single-screen based simulator system; V-100 MIL, a single-screen based simulator system; and V-ST PRO, a realistic single screen firearms shooting and skills training simulator. The company also provides Virtual Interactive Coursework Training Academy (V-VICTA), which enables law enforcement agencies to teach, train, test, and sustain departmental training requirements; and Subscription Training Equipment Partnership, a program that allows agencies to utilize its simulator products, accessories, and V-VICTA interactive coursework on a subscription basis. In addition, it offers V-Author software that allows users to create, edit, and train with content specific to agency's objectives and environments; Simulated Recoil Kits, a range of realistic and reliable simulated recoil kits/weapons; Threat-Fire, a device that applies real-world stress on the trainees during simulation training; and TASER, an OC spray and low-light training devices that interact with its simulators for training. The company sells its simulators and related products through a direct sales force and distribution partners. The company was founded in 1993 and is headquartered in Chandler, Arizona.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/u4WAbxZjrSVhsGCuv9i_Cg/eTbbT_ie2DQtaZoh5_y1-HxWNAgN4n7iFe23kuCUPE3aQd1Uuxb_2Tw-Ogk3z_trUsjKf_bUJ5aXlwvMwvjGM7eHEW-Gc__Dd22S3X07IszgyErS38lPgI-sWV9TRnoaI-Xflag4zAKdRbqUZ9wFulcwto_Qy-C4784agi1MxIc/vy4WcB7rlRsrbx-i6FpqiDPN44eo0DR2uIbhzFwQt14",
    "price": 4.36,
    "prevClose": 4.24,
    "absReturn": 0.1200000000000001
  },
  {
    "fullTicker": "LASR:USA",
    "baseTicker": "LASR",
    "rank": 56.1489,
    "description": "nLIGHT, Inc. designs, develops, manufactures, and sells semiconductor and fiber lasers for industrial, microfabrication, and aerospace and defense applications. The company operates through two segments, Laser Products and Advanced Development. It offers semiconductor lasers with various ranges of power levels, wavelengths, and output fiber sizes; and programmable and serviceable fiber lasers for use in industrial, aerospace, and defense applications. The company also provides fiber amplifiers, beam combination, and control systems for use in high-energy laser systems in directed energy applications. It sells its products through direct sales force in the United States, China, South Korea, and European countries, as well as through independent sales representatives and distributors in Asia, Australia, Europe, the Middle East, and South America. The company was formerly known as nLight Photonics Corporation and changed its name to nLIGHT, Inc. in January 2016. nLIGHT, Inc. was incorporated in 2000 and is headquartered in Camas, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/Eouajp5jbRkqsu4V3yU-mw/I_bHWZGUEGpDzyi0bFrjFnpVSYpwbipOtI7uYpqTAm5-D3c6KxcGvew-Re1GW58fL7SVUnnhLjf-MeWBtLg2yNwVBU7U4z1Emf83atiDM-4E7t1uRKloEWWL-2Pq0GcW3cT3AjO9bJArwixaIVU_TEQWEKEw7XczvgFBR9Rg7GI/UZ4zUmKJoRJ6eO0h9ngAIXMf7fFGzIwVPAHFc4ktBxQ",
    "price": 56.19,
    "prevClose": 62.95,
    "absReturn": -6.760000000000005
  },
  {
    "fullTicker": "TDOC:USA",
    "baseTicker": "TDOC",
    "rank": 72.2168,
    "description": "Teladoc Health, Inc. provides virtual healthcare services worldwide. It operates through Teladoc Health Integrated Care and BetterHelp segments. The Integrated Care segment offers virtual medical services, including general medical, expert medical, specialty medical, chronic condition management, and mental health, as well as enabling technologies and enterprise telehealth solutions for hospitals and health systems. The BetterHelp segment operates a mental health platform that provides online counseling and therapy services through website, mobile applications, phones, and text-based interactions by its licensed clinicians. The company offers its products and services under the Teladoc, Livongo, and BetterHelp brands. It serves employers, health plans, hospitals and health systems, and insurance and financial services companies, as well as individual members. The company was formerly known as Teladoc, Inc. and changed its name to Teladoc Health, Inc. in August 2018. Teladoc Health, Inc. was incorporated in 2002 and is headquartered in Purchase, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/Zzh5qHZsJ3YV5fHzjH7XoQ/SsgkwLz5SzJgiAzTixB7taypa8d5eMojT0zdsYhOGEPOV1-d26oMsD3jire7widPlbJCclOMZ7e_74XKDcCf4n5EyhZ8U4OnA1ATQpEwsmqebTmJ6Jgf-k61aPYtymD3qbxcb58ovLNKmCRbOVb8ro76NViLxbTZOrgTAj-Gts1dLXHN1s_eIpJEDWVupw6A/zCfiVW0D0zbTbKosGtv4P3TodhKJqMZ9wwyy-tramn0",
    "price": 5.26,
    "prevClose": 5.35,
    "absReturn": -0.08999999999999986
  },
  {
    "fullTicker": "CNMD:USA",
    "baseTicker": "CNMD",
    "rank": 81.0841,
    "description": "CONMED Corporation, a medical technology company, develops, manufactures, and sells devices and equipment for surgical procedures in the United States and internationally. The company offers orthopedic surgery products, including BioBrace, TruShot with Y-Knot All-In-One Soft Tissue Fixation System, Y-knot All-Suture Anchors, and Agro Knotless Suture Anchors, which provide clinical solutions to orthopedic surgeons for the augmentation and repair of soft tissue injuries, as well as provides supporting products that enable surgeons to perform minimally invasive sports medicine surgeries. It markets orthopedic surgery products under the Hall, CONMED Linvatec, Concept, and Shutt brands. It also provides battery-powered and autoclavable bone power tool systems for use in orthopedic, arthroscopic, oral/maxillofacial, podiatric, spinal, and cardiothoracic surgeries under Hall surgical brand name. In addition, the company offers general surgery products, including clinical insufflation systems under AirSeal brand; smoke removal devices under Buffalo Filter brand; endomechanical products, such as tissue retrieval bags, trocars, suction irrigation devices, graspers, scissors, and dissectors used in minimally invasive surgeries; and electrosurgical solution comprising monopolar and bipolar generators, argon beam coagulation generators, handpieces, smoke management systems and other accessories. Further, the company provides endoscopic technologies, including therapeutic and diagnostic products for use in gastroenterology procedures, and products for the treatment of diseases of the dilatation, hemostasis, biliary, structure management, and infection prevention; and patient monitoring, including ECG and EEG electrodes, and cardiac defibrillation pads. It markets its products directly to hospitals, surgery centers, and other healthcare institutions, as well as through medical specialty distributors. The company was incorporated in 1970 and is headquartered in Largo, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/tF3Ykkfj9Qu8go7p4JkS3g/ThS9Bfx2U5eSQ58QgdEqLXKly6hGf5L6MSj1EEp8e-S03Hw0r1IhsasMuSdL3T86Cc3Vzgsv5k7ER1GKnPBK0pkL5eLH2HTBCkbpss-lISVxkO_qb2CPdIEbJXWyVu9qLZTgVP76iWKv8YEx_ezIgUXtRWbPtv4v_7EdCmXtPYo/pdVlILuYLqAKyFlWgsVHLn5z5vgXmW8fODFo3nb9FW8",
    "price": 46,
    "prevClose": 45.87,
    "absReturn": 0.13000000000000256
  },
  {
    "fullTicker": "RSI:USA",
    "baseTicker": "RSI",
    "rank": 86.1812,
    "description": "Rush Street Interactive, Inc. operates as an online casino and sports betting company in the United States, Canada, and Latin America. The company offers real-money online casino, online and retail sports betting, and social gaming services. It also provides full suite of games comprising bricks-and-mortar casinos, such as table games, slot machines, and poker games. The company offers its products under BetRivers, PlaySugarHouse, and RushBet brands. Rush Street Interactive, Inc. was founded in 2012 and is headquartered in Chicago, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1772460000000/-Z8p26apoTSe2xwfM8B71g/QnVrySvRD8nOrMXIx9701pA6sldIpFeMeZN1kvdVd0k-Ltv2vGpF1o5Fw_uQvrbqKNtpAnLGf0aooKAVIGZAQNndudeOcfOCv-Gn1loSfHrp7kzZ9LCSH4rbGoBUKw5Y9NJpUm5mCur6aJclPwqFFQT3CsMmBMssHMHAPqP-5Hd9vdbKzvr_-m-dyUiXMmk3/TzaDfe3TsXtnLDhv0eQNf4TCwJZtCDeNaK46dkM_bbA",
    "price": 19.75,
    "prevClose": 19.75,
    "absReturn": 0
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 685.99,
    "prevClose": 689.3,
    "absReturn": -3.3099999999999454
  }
]