[
  {
    "fullTicker": "CRVO:USA",
    "baseTicker": "CRVO",
    "rank": 4.9959,
    "description": "CervoMed Inc., a biotechnology company, engages in the development and commercialization of treatments for age-related neurologic disorders. Its lead drug candidate is neflamapimod, an orally administered small molecule brain penetrant for the treatment of dementia with Lewy bodies (DLB), Alzheimer's diseases, frontotemporal dementia, and ischemic stroke recovery. The company develops EIP200 for central nervous system which is in preclinical trials. The company was founded in 2010 and is headquartered in Boston, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/zWsV9EJEknJagWt_-sOl8Q/ENT02aoJBp1CDj2l6cd9TJxtNrH1jRDlUIPH496rkkjLQZFTqxPpxOTbEJQMIkBYLk1hYvGqiAmtEUl6s-0a6feZnJ2PgpSw6Fg2SzLfolgqoUkyBOgWAu6JDKmwq3Z09Ay-OzhZI3MLL20hSI2U7q6q0BYE9umr0RFYmvar0CI/hDFRohZsdrb_18StoMM3TtpUiiED1WxOUAXpyVMeJsM",
    "price": 9.22,
    "prevClose": 9.94,
    "absReturn": -0.7199999999999989
  },
  {
    "fullTicker": "ALZN:USA",
    "baseTicker": "ALZN",
    "rank": 11.5378,
    "description": "Alzamend Neuro, Inc., a clinical-stage biopharmaceutical company, focuses on developing various products for the treatment of neurodegenerative and psychiatric disorders. Its pipeline includes AL001, which delivers a therapeutic combination of lithium, proline, and salicylate for the treatment of Alzheimer's, bi-polar disorder, post-traumatic stress disorder, major depressive disorder, other neurodegenerative diseases, and psychiatric disorders; and ALZN002 stage, which uses a method using a mutant-peptide sensitized cell as a cell-based therapeutic vaccine to restore the ability of a patient's immunological system to combat Alzheimer's disease. The company has partnership agreement with Massachusetts General Hospital for the Phase II clinical trial of AL001. Alzamend Neuro, Inc. was incorporated in 2016 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/nWDC9zXC6bigKMkD5w6yxg/SduMaxbAhzTD_B18HGbE5yw-Rh-8zcd0ToiaCOvuT1ao9jXCQrNjnVLgogIu9z8bO75sliDkRsoBghOKpPZjOLsSBL-ftK1qqqIJNzNT-OsTOClo9KRbSjDPPy93Wdg2kHWhjLcZ2hvWs4H6nTU6Q7qq9Yxh8rjvp0cadaDyWPhBVUHvXVDEvJPxNlCROc5J/swWP-K2E_AO7DotLXk4Qa9AmbJv23-dHIyECneGecn4",
    "price": 2.09,
    "prevClose": 2.19,
    "absReturn": -0.10000000000000009
  },
  {
    "fullTicker": "FRO:USA",
    "baseTicker": "FRO",
    "rank": 16.4687,
    "description": "Frontline plc, a shipping company, engages in the seaborne transportation of crude oil and oil products worldwide. It owns and operates oil and product tankers. As of December 31, 2023, the company operated a fleet of 76 vessels. It is also involved in the charter, purchase, and sale of vessels. The company was founded in 1985 and is based in Limassol, Cyprus.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/Qoa_c4Rpu1SC6korc6H9kA/h_Cqzbx4ejv9_NyjkV0bl7la7ApR0G5XNNh6i8h2bXOtazsUBa4uDnT76gwl7C1gnfGFFEGJLaoAy9Am0zn6Ck41mFSKJSozliE-k7G5z9qR5EhGnbrIYI0QntMamkxaUQIsQHRhiT4tIHMj2IaVjymHwy6wblkHHg2CzEFjqQk/_q3Hc4rEdlOeAWazX-2MAUew84-AeNJLf2kMLg4Gbxc",
    "price": 22.85,
    "prevClose": 23.52,
    "absReturn": -0.6699999999999982
  },
  {
    "fullTicker": "SXT:USA",
    "baseTicker": "SXT",
    "rank": 26.1839,
    "description": "Sensient Technologies Corporation, together with its subsidiaries, manufactures and markets colors, flavors, and other specialty ingredients worldwide. It operates in three segments: Flavors & Extracts, Color, and Asia Pacific. The Flavors & Extracts segment develops, manufactures, and supplies flavor systems under the Sensient Flavors and Sensient Natural Ingredients brands. This segment produces flavor, extract, and essential oil products; natural ingredients, such as dehydrated garlic, onion, and other natural ingredients for food processors; systems products, including flavor-delivery systems, and compounded and blended products; and selected ingredient products, such as natural and synthetic flavors, natural extracts, and essential oils. The Color segment develops, manufactures, and supplies colors. This segment provides natural and synthetic color systems for food, beverages, pharmaceuticals, and nutraceuticals sectors; colors and other ingredients for personal care, such as active ingredients, solubilizers, and surface treated pigments; pharmaceutical and nutraceutical excipients, such as colors, flavors, and coatings; and technical colors for industrial applications under the Sensient Food Colors, Sensient Pharmaceutical, Sensient Beauty, and Sensient Specialty Markets brand names. The Asia Pacific segment markets the company's product lines in the Pacific Rim under the Sensient name. Sensient Technologies Corporation was incorporated in 1882 and is headquartered in Milwaukee, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/FbBOEQ62JPCR5MKpSdTmIA/NzdLVgeiSvVMqZzxXtuyBnm4T_TpSmyACB5OY3coe6Uh08oGvt30foIdXvWSN0YObgt0rEVHr77Uw4Mju8-3Ut-vVyDHxYMFYFd8pqMVMjqlf9wm_dpslOsy9glQcKgtR7PWSQQUJu1gwN52z0GT36nVU_WpEvT72pMBwdBsQAhE_D_iMDxx2kNphQLTZPqF/XD1yfzFnHm_zamRuI2mhQ_HRl_Kmu4n9_cUFz-kIQW8",
    "price": 95.65,
    "prevClose": 97.49,
    "absReturn": -1.8399999999999892
  },
  {
    "fullTicker": "LEGH:USA",
    "baseTicker": "LEGH",
    "rank": 36.6151,
    "description": "Legacy Housing Corporation engages in the building, sale, and financing of manufactured homes and tiny houses primarily in the southern United States. The company manufactures and provides for the transport of mobile homes, including 1 to 5 bedrooms with 1 to 3 1/2 bathrooms; and provides wholesale financing to dealers and mobile home parks, as well as retail financing to consumers. It also offers inventory financing for its independent retailers; consumer financing for its products; and financing to manufactured housing community owners that buy or lease its products for use in their rental housing communities. The company is involved in financing and developing new manufactured home communities. It markets its homes under the Legacy brand through a network of independent retailers and company-owned stores; and directly to manufactured home communities. The company was founded in 2005 and is headquartered in Bedford, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/bT10qcZER5vnEFtDpXJEcw/qqIR_u6yOnFwNKGABrxb9FqP2doD3Eb_3Nvt_HmX8Vk2Eh2Q5kNi-LHwcBNkUZ4mhFZf3BRuMxeZN5jD-067k0KLRSb6p-lnHGAO-jMcc0JsLSG3BnzxHkSpCT4FctEdmyzKc8-EnlfkZeZAGZFtNP58fyhLMORlovKrSEhssz5zB3lFJ4PzMQEDeG_74Osp/X4l290qjBDl9m6LZZXx5S93LgMY9Nf1xOiDyCHQ1sbo",
    "price": 19.57,
    "prevClose": 19.93,
    "absReturn": -0.35999999999999943
  },
  {
    "fullTicker": "NFG:USA",
    "baseTicker": "NFG",
    "rank": 45.0448,
    "description": "National Fuel Gas Company operates as a diversified energy company. It operates through four segments: Exploration and Production, Pipeline and Storage, Gathering, and Utility. The Exploration and Production segment explores for, develops, and produces natural gas and oil. The Pipeline and Storage segment provides interstate natural gas transportation services through an integrated gas pipeline system in Pennsylvania and New York; and storage services through its underground natural gas storage fields. This segment also transports and stores natural gas for National Fuel Gas Distribution Corporation, as well as for utilities, industrial companies, and power producers in New York State. The Gathering segment builds, owns, and operates gathering facilities in the Appalachian region, as well as provides gathering services to Seneca. The Utility segment sells natural gas to retail customers; and provides natural gas utility services to various customers in Buffalo, Niagara Falls, and Jamestown, New York, as well as in Erie and Sharon, Pennsylvania. National Fuel Gas Company was incorporated in 1902 and is headquartered in Williamsville, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/zsNJ9wcnhS1WI_IDpPVOQw/8MVOG-1tmEcHcvcAcz8r760DToV-TTiRxOqyJl2DvQZ1lZ5aMonhBUpL_jclypwDsu1GeRZOaL_6cOQgXTg6phlXRSk5TfYqEPlCgkMt9CX4OXn7NbSZWBUPbQpI40MhKrScb5gtLHKY4U9Gj_o5wRsfbea6r9Gdjki5jYXO2pOyTnM8puGmdouHyvNTZ4-y/pfSkgbbmbXLZsIA81sP-eOkKkhiqfWNNnJt0WGf7HIk",
    "price": 82.21,
    "prevClose": 82.45,
    "absReturn": -0.2400000000000091
  },
  {
    "fullTicker": "ERIE:USA",
    "baseTicker": "ERIE",
    "rank": 61.2368,
    "description": "Erie Indemnity Company operates as a managing attorney-in-fact for the subscribers at the Erie Insurance Exchange in the United States. It provides issuance and renewal services; sales related services, including agent compensation, and sales and advertising support services; underwriting services comprise underwriting and policy processing; and other services consist of customer services and administrative support services, as well as information technology services. The company was incorporated in 1925 and is based in Erie, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/7tYFPaWWDdEQaq5ifyFzEg/O3sfYoVwtpXzIfWSoQ1-rW0DfXh35vGtHY_61-sTEv3an7467u93uel-xPCoQEoNX2rj62JO8S3vmaTV0hROc9KEaTXgUd5LRhGAkqcoTj849SF9vMK6l0OIZu3QVXMnAXKwxbVp18rdL-OZf6HYKA0Nwh7yUMrb7TmQCUsYWH93WQcKowm49GtoFzycK7CR/ElebDf9DWsnvmOLwAo_R56hKHGxXgXfS6BZdsqh1KBU",
    "price": 293.76,
    "prevClose": 295.49,
    "absReturn": -1.7300000000000182
  },
  {
    "fullTicker": "DAL:USA",
    "baseTicker": "DAL",
    "rank": 67.2742,
    "description": "Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Detroit, Minneapolis-St. Paul, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Santiago (Chile), Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; and acts as a reservations specialists. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,292 aircraft. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/hrJpXATTvVw020GPiPaOoQ/6QPfw42y0eG8qtNu1c27a7HYLLFpPggSfoY9Fxebn-wV01_Ns3pVbSEFLX_s5fdo5OtGeivHUEedJz86JLLVB54ffyLJkwAMCJgyIaKf_9xIl83CbwN9kDmiPeGb91J2Jbbx6Z0dQRykbqDbP1OZyELb2AOYv7MBMVyStUai-Hfl_H6erb2QOvBzG0sBQMAx/U_iHl6omCCJUqZwmgYJqvFWAql7E0y8yKvjVLW8Ourk",
    "price": 64.15,
    "prevClose": 64.1,
    "absReturn": 0.05000000000001137
  },
  {
    "fullTicker": "APH:USA",
    "baseTicker": "APH",
    "rank": 76.8267,
    "description": "Amphenol Corporation, together with its subsidiaries, designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and power interconnect products. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/hxf1q-pIOGyIFgqBdR_9IA/14fAgydwS2REkUSaEJgq5dqTsfn5nNXL0Cqpb-x0TJ8wnFLdlizX0-XY7lmEHOCCIQN0fzNVn7NoLCgSK_-ejZwhFIhuTMGc-hP3S1-lUfYvtiKdDKLkHGzx8XOFjGG0nQu70UBNpCH6cNwBkiBTRPt0cy0ZW_IpHYhYbsYxNjE/ArX4TyTvQN5T-Q7lfQ4ir4V0Zr-W2iJgM6OcYFQNhoU",
    "price": 139.22,
    "prevClose": 140.9,
    "absReturn": -1.6800000000000068
  },
  {
    "fullTicker": "CDNA:USA",
    "baseTicker": "CDNA",
    "rank": 92.856,
    "description": "CareDx, Inc. engages in the discovery, development, and commercialization of diagnostic solutions for transplant patients and caregivers in the United States and internationally. It provides AlloSure Kidney, a donor-derived cell-free DNA (dd-cfDNA) solution for kidney transplant patients; AlloMap Heart, a gene expression solution for heart transplant patients; AlloSure Heart, a dd-cfDNA solution for heart transplant patients; and AlloSure Lung, a dd-cfDNA solution for lung transplant patients. The company offers Olerup SSP, which is used to type human leukocyte antigen (HLA) alleles based on sequence specific primer technology; QTYPE that enables precision in HLA typing; and Ottr, a transplant patient management software. In addition, it provides AlloSeq Tx, a high-resolution HLA typing solution; AlloSeq cfDNA, a surveillance solution to measure dd-cfDNA in blood; AlloSeq HCT, a solution for chimerism testing for stem cell transplant recipients; Allocell, a surveillance solution that monitors the level of engraftment and persistence of allogeneic cells for patients who have received cell therapy transplants; and XynQAPI, a transplant quality tracking software, as well as AlloCare, a mobile app that offers a patient-centric resource for transplant recipients. The company offers its products directly to customers, as well as through third-party distributors and sub-distributors. It has a license agreement with Illumina, Inc. for the distribution, development, and commercialization of NGS products and technologies; and Cibiltech SAS to commercialize iBox, a software for the predictive analysis of post-transplantation kidney allograft loss. The company was formerly known as XDx, Inc. and changed its name to CareDx, Inc. in March 2014. The company was incorporated in 1998 and is headquartered in South San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/47/47/1764691200000/HjVKUh8ksvHjmjyhgCTQ5Q/TDZE5k67sNjrZhlwFrqcgPfrR1286HAICAP_GSQ_BPFjvik0Iz_ZhFicIDalNuuwH68y-Bpq-3s8U-vLk67HIfjufGCrwlhCI-N12kZ879-zWshLXLkTloLO6KknvYgBUNdvpLKEVlEvTZcYU0vmWBap5BLMAcQAZH0ZbMfQM7Y/h779-ldF-CjlL805Cwv6Qqoh8QIcZoaJwE8IZpcuoU0",
    "price": 17.18,
    "prevClose": 17.87,
    "absReturn": -0.6900000000000013
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 680.27,
    "prevClose": 683.39,
    "absReturn": -3.1200000000000045
  }
]