[
  {
    "fullTicker": "IREN:USA",
    "baseTicker": "IREN",
    "rank": 1.2806,
    "description": "IREN Limited owns and operates bitcoin mining data centers. It also provides high performance computing solutions, including Al cloud services. The company was formerly known as Iris Energy Limited and changed its name to IREN Limited in November 2024. IREN Limited was incorporated in 2018 and is headquartered in Sydney, Australia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/BwqOqOnrTD8fb7o4lgyyTg/HAuis0TkyDds6VHRO1Pa15ImEhPOgkyNnVlu1q4uxugtroyt-hpjSRdQiamy3jbi4L7vKgmbJRvtDjyYGN6SAAlkJWZK0_sJoLvrhuMQtaGQo6xE8qiBvn0g_irsImpN9R7z9Q263nadv1QKOATU8jq8g3gFGNIqsCzratApJeP21dwhvx-lwtOR6-zFz6rO/hRUspm2_W461OEG3itEBTqdz9GqRKvx5QXUwbgsmmmU",
    "price": 16.23,
    "prevClose": 17.03,
    "absReturn": -0.8000000000000007
  },
  {
    "fullTicker": "DATS:USA",
    "baseTicker": "DATS",
    "rank": 10.0449,
    "description": "DatChat, Inc. operates as a secure messaging, metaverse, and social media company that focuses on protecting privacy on personal devices and user information after it is shared with others. Its DatChat Messenger & Private Social Network presents technology that allows users to change how long messages can be viewed before or after users send them, prevents screenshots, and hides encrypted photos in plain sight on camera rolls. Its technology offers users a traditional texting experience while providing control and security for messages. The company through its DatChat Messenger, a user can decide how long messages last on a recipient's device, delete individual messages or entire message threads, making it like the conversation never happened. DatChat, Inc. was formerly known as Dat Chat, Inc. and changed its name to DatChat, Inc. in August 2016. The company was incorporated in 2014 and is based in New Brunswick, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/e3pMXKiYdgmD19_RCusQvA/dPu-Iv9mY_yGptTzK3OFBC7Y9Jm-X5XSjqJ5UbL6PE1GnvlE9va-z2tqV6E2qzntKNqdXxJZyPVWvWxjDIcO6YMttfmBy4m1TDxS4H5yRK-uLMZv9ZgdDbBmAKzZzhdtsUxe-3epclRvDaR_eIDGK5A00jY24VqvNSJdX6A1DtQ/NST15qXQo0NMYrrjIc0mK7nKh4mHTqeTeInBXjWqp3A",
    "price": 2.56,
    "prevClose": 2.63,
    "absReturn": -0.06999999999999984
  },
  {
    "fullTicker": "EDIT:USA",
    "baseTicker": "EDIT",
    "rank": 14.6682,
    "description": "Editas Medicine, Inc., a clinical stage genome editing company, focuses on developing transformative genomic medicines to treat a range of serious diseases. It develops a proprietary gene editing platform based on CRISPR technology. The company develops reni-cel, a clinical development gene-edited medicine to treat sickle cell disease and transfusion-dependent beta-thalassemia. In addition, the company is developing alpha-beta T-cell experimental medicines for the treatment of solid and liquid tumors in collaboration with Bristol Myers Squibb Company (BMS) through its wholly owned subsidiary, Juno Therapeutics, Inc. It also collaboration and licensing agreement with Immatics to combine gamma-delta T cell adoptive cell therapies and gene editing for the treatment of cancer. The company was formerly known as Gengine, Inc. and changed its name to Editas Medicine, Inc. in November 2013. Editas Medicine, Inc. was incorporated in 2013 and is based in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/j6lYJJHILzfH-IBunTOvbA/8ZtJFXuF209Me1kupHiN71h3vcsOlmMqJDL4seVgNJETSfKOy76e6l0_PWlY1KPaBAzuaMnbXSKVhQVCkCrT6fX09xQ6Kji2zbmKd-W_DZ5ZUQ1NfTX0XWzo1N2xK2Eii0I3FDtpwON0E9k1_Jk40yEDwZLH5iR27AEtH_ZiAqj3uQzPTNL-ZpCzShwtP1QD/0UEX4E0B_25Off6ptfcKpHA0l5mAt9iLHbmTjHtciQQ",
    "price": 2.88,
    "prevClose": 3.06,
    "absReturn": -0.18000000000000016
  },
  {
    "fullTicker": "TKO:USA",
    "baseTicker": "TKO",
    "rank": 30.9662,
    "description": "TKO Group Holdings, Inc. operates as a sports and entertainment company. The company owns and manages sports and entertainment intellectual property; produces and licenses live events, programing, and long-form and short-form content, reality series, and other filmed entertainment on digital and linear channels and via pay-per-view; and offers UFC FIGHT PASS, a direct-to-consumer streaming product that provides access to live and video-on-demand events, as well as original content. It is also involved in the merchandising of video games, apparel, equipment, trading cards, memorabilia, digital goods, and toys. In addition, the company engages in the sponsorships and advertising business, which offers sale of in-venue and in-broadcast advertising assets, content product integration, and digital impressions. The company was incorporated in 2023 and is based in New York, New York. TKO Group Holdings, Inc. is a subsidiary of Endeavor Group Holdings, Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/yjnC6ia5okdPbm5x-Yvwrw/H5qh_wV1y2d8vA20yabrzK0qYGtgEy4k6AL75HvqvSH4tkAF2cC76hnhWW-1lfciWR9JIlA3jT188ryZj8UDDgsmFTtB1-BTbRc4mQHFBNWSqUcqJX7S4dohrX7Qs7aoPTbbpBLSxJcVE03pdoxqEFzHlZ3z_QKK0kFvpjj9gdohdxQBVTcFVzH70qvptMKN/TiUCeegpaFbnhcA3fT1UL43k8dR72fOGQ14FBtwAAaI",
    "price": 172,
    "prevClose": 172.89,
    "absReturn": -0.8899999999999864
  },
  {
    "fullTicker": "ACTU:USA",
    "baseTicker": "ACTU",
    "rank": 37.685,
    "description": "Actuate Therapeutics, Inc., a clinical-stage biopharmaceutical company, focuses on developing therapies for the treatment of cancers. The company's lead product candidate is Elraglusib Injection, a novel glycogen synthase kinase-3 inhibitor to treat metastatic pancreatic ductal adenocarcinoma. It also develops Elraglusib for the treatment of Ewing sarcoma, metastatic melanoma, and colorectal cancer. The company was formerly known as Apotheca Therapeutics, Inc. and changed its name to Actuate Therapeutics, Inc. in October 2015. The company was incorporated in 2015 and is based in Fort Worth, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/PvxBbRo3VuGwdzyxea8Otw/R3AeQuo6ZyBOjAmApwJLdksRu_L3TFxQplL9MvpramVK0WlPTbOTovqjsamYx94enl7U3XXowqnLvcirvPM9dKImd089q11l2yGfS1_pF6lXcZAo2DSzHLTq3MU_Jq84B6swINcNFK2PU7e0midKNSVkMWQLR9xS7n4KYRe5kRgqdzvnXt3QdaegryfyhrqY/mRjBrkCW1PMkAuPuaN_5ONDriSBtRP6O7umt8hJ2xMk",
    "price": 6.14,
    "prevClose": 6.18,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "IESC:USA",
    "baseTicker": "IESC",
    "rank": 45.518,
    "description": "IES Holdings, Inc. designs and installs integrated electrical and technology systems, and provides infrastructure products and services in the United States. The Communications segment designs, builds, and maintains communications infrastructure within data centers for co-location and managed hosting customers; corporate, educational, financial, hospitality, and healthcare buildings; e-commerce distribution centers; and high-tech manufacturing facilities. This segment also designs and installs audio/visual, telephone, fire, and wireless access and intrusion alarm systems; and engages in designing/building, servicing, and maintaining data network systems. The Residential segment offers electrical installations to single-family housing and multi-family apartments; heating, ventilation and air conditioning and plumbing installation services; and cable television installations to residential and light commercial applications, as well as installs residential solar power for new construction and existing residences. The Infrastructure Solutions segment maintains and repairs alternating and direct current electric motors and generators, and power generating and distribution equipment; manufactures custom-engineered metal enclosed bus duct solutions used in power distribution; manufactures custom commercial and industrial generator enclosures; manufactures, re-manufactures, and repairs industrial lifting magnets; and maintains and repairs railroad main and auxiliary generators, main alternators, and traction motors. The Commercial & Industrial segment offers electrical and mechanical design, construction, and maintenance services for office buildings, manufacturing facilities, data centers, wind farms, solar facilities, municipal infrastructures, and health care facilities. The company was formerly known as Integrated Electrical Services, Inc. and changed its name to IES Holdings, Inc. in May 2016. The company was incorporated in 1997 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/IfVU-TOH1b0HmzFpqg4-Hw/mqp5autq6iqzerDyZ64AYpq7YN2tZJLtoUo7cRmWweVcK7o1qGe9D_I0ah4HwcJ5zKZ9aOclFtb2wKvYFj6TEs0kmY3uHDQ4pa9steFzfzJ24S5pyupyl9Yp404cdANlqdLKEsNnROnnoRZN4ZM6HVy1u0GKIaOjq2lOKL4Epa6J2v7G-fCexNIThTGYZLWR/io1TRXsXEC-MO0RTTtOjll8eAO7Wku1saIHucWvkbWI",
    "price": 309.16,
    "prevClose": 310.3,
    "absReturn": -1.1399999999999864
  },
  {
    "fullTicker": "SWX:USA",
    "baseTicker": "SWX",
    "rank": 51.1725,
    "description": "Southwest Gas Holdings, Inc., through its subsidiaries, purchases, distributes, and transports natural gas for residential, commercial, and industrial customers in Arizona, Nevada, and California. The company operates through two segments, Natural Gas Distribution and Utility Infrastructure Services. It offers tariff sales and transportation services. The company also provides installation, replacement, repair, and maintenance of energy distribution systems, as well as undertakes gas construction works in North America. Southwest Gas Holdings, Inc. was incorporated in 1931 and is headquartered in Las Vegas, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/xHTbDWcVLqgBgAA3lPFbpg/QY50KfMBUsnObAYsp1vvCTAk7RoSSAi2_X6pYofemscqpPEZAgDh39homY5Et-4WPK5ZTP4R6Hj_jnEJyvzfR_sB3iDiW6Vi1JI38nbHBj0gZQHmxWGI3CW7aLfC7C78Ibaz4BdI6IPbG9CQQudNsmuaeMm27qylAMwVFFUN6rk/UFjiVWVx0S2FFne7Yx1x5KB5Yx89B-qqfWTrkegzqF4",
    "price": 77.04,
    "prevClose": 76.53,
    "absReturn": 0.5100000000000051
  },
  {
    "fullTicker": "XPRO:USA",
    "baseTicker": "XPRO",
    "rank": 59.837,
    "description": "Expro Group Holdings N.V. provides energy services in North and Latin America, Europe and Sub-Saharan Africa, the Middle East and North Africa, and the Asia-Pacific. It provides well construction products and services, such as technology solutions in tubular running services, tubular products, cementing, drilling, and wellbore cleanup; and well management services, including well flow management, subsea well access, and well intervention and integrity solutions. The company serves exploration and production companies in onshore and offshore environments in approximately 50 countries. Expro Group Holdings N.V. was founded in 1938 and is based in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/XIMI2XVuvA6kYfZ45gZoRA/D58QvrptUs1PxoUNfRvmVrVdSs004ZgNXaPCk3NYSqBTaiF3RLSUZnba3FEmGJUgqg54-tQELUKVN_RqP8TAkTf7f7O1YQKLd5x_NT9GsdBS5Q-XdFsAZpJdKOnwB_dEkJ-R2gIJcBqaPH6rQdugrknqTdqCMZdY5ggjYYDbcJ6D2jOwKwGBclHDojnnXPbG/yP7nzsu6v-N0kuMH6tqcvGP1RDLxPPtA10-3fZJCB2w",
    "price": 9.49,
    "prevClose": 9.57,
    "absReturn": -0.08000000000000007
  },
  {
    "fullTicker": "JVA:USA",
    "baseTicker": "JVA",
    "rank": 67.088,
    "description": "Coffee Holding Co., Inc. engages in manufacturing, roasting, packaging, marketing, and distributing roasted and blended coffees in the United States, Australia, Canada, England, and China. The company offers wholesale green coffee products, including unroasted raw beans that are sold to large, medium, and small roasters, as well as coffee shop operators; and roasts, blends, packages, and sells coffee under private labels in cans, brick packages, and instants of various sizes. It also roasts and blends company label branded coffee to supermarkets, wholesalers, and individually-owned stores; and sells tabletop coffee roasting equipment and grinders, instant coffees, and tea products, as well as provides single cup coffee pods and food service. In addition, the company manufactures and sells coffee roasters. It serves its products under the Cafe Caribe, Don Manuel, S&W, Cafe Supremo, Via Roma, Premier Roasters, Harmony Bay, and Café Femenino Coffee brands. The company was formerly known as Transpacific International Group Corp and changed its name to Coffee Holding Co., Inc. in April 1998. Coffee Holding Co., Inc. was founded in 1971 and is headquartered in Staten Island, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/mnFALJrs7fpxGmXVBHst8Q/8DbEYSlLpptwJesKXc6HQTgEJz59IhlIeb1hwVdEEdPRPKIbuAcGDeBvqLFe9Iy-T9-7nsQbeKaE2o7Vx_QfGiTorplFEizcV9IT-O4OvC2-yzYqyhlJknl_JTZmK8TyRYpwOng-7KOuXsQzuA1xfeOOmIwjMXihqQyaUi86OUf9LeH8TuW0iiRZnWEQ3Pw4/q3QRd-uM0y78xxkbxOY4Ts5jtV4H3Fz7d2PwMeB66XI",
    "price": 4.46,
    "prevClose": 4.5,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "AIZ:USA",
    "baseTicker": "AIZ",
    "rank": 82.8871,
    "description": "Assurant, Inc. provides protection services to connected devices, homes, and automobiles in North America, Latin America, Europe, and the Asia Pacific. It operates in two segments, Global Lifestyle and Global Housing. The Global Lifestyle segment offers mobile device solutions, and extended service contracts and related services for consumer electronics and appliances, and financial services and other insurance products; and vehicle protection, commercial equipment, and other related services. The Global Housing segment provides lender-placed homeowners, manufactured housing, and flood insurance; renters insurance and related products; and voluntary manufactured housing, and condominium and homeowners insurance products. The company was formerly known as Fortis, Inc. and changed its name to Assurant, Inc. in February 2004. Assurant, Inc. was founded in 1892 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1752501600000/U9kGI4WOOs0UAn31Xe5YPg/NCi8tNuxybXlzF9IA6CDr7xeVfoaeSX9WJDJWIo0DLJd3L6un7MyQ7IoHAo3a52XWOg--1jctIConPd0gDEwG6NvFBMJPzYN4MfX9qZte_tdKKDTlJHxGeoIClhrEYWwCUV_tPxWUcsM6EILLevIfV8XDHfxuXCsoFd2oNvqPC4/Y90VqH-vfIiiLnvW8h6-ihKCJy2eBHO3kOFc8xfNTlg",
    "price": 187.56,
    "prevClose": 189.93,
    "absReturn": -2.3700000000000045
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 623.62,
    "prevClose": 625.82,
    "absReturn": -2.2000000000000455
  }
]