[
  {
    "fullTicker": "AKRO:USA",
    "baseTicker": "AKRO",
    "rank": 1.6594,
    "description": "Akero Therapeutics, Inc., together with its subsidiary, engages in the development of treatments for patients with serious metabolic diseases in the United States. The company's lead product candidate is efruxifermin (EFX), which is in Phase 3 clinical trials that protects against cellular stress and regulates the metabolism of lipids, carbohydrates, and proteins throughout the body for the treatment of biopsy-confirmed metabolic dysfunction-associated steatohepatitis (MASH) patients. It has a license agreement with Amgen Inc. to develop, manufacture, use, distribute, and sell EFX as a treatment for MASH and other metabolic diseases. The company was formerly known as Pippin Pharmaceuticals, Inc. and changed its name to Akero Therapeutics, Inc. in May 2018. Akero Therapeutics, Inc. was incorporated in 2017 and is headquartered in South San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/QznmAS__8qAdUs1timuBWA/h7qLHiQWKaJ4Her6Nf92_4QBHGEsC1OeSSw4TK-rdv_dMWLj2mLgsIJY4M9tDRq9ciJZFL4bNNjXm3Vh8_qxyqzWTIcoDXpz5uJMBw2i0SWAUTbCBGWwvlk3YLL5CyUMxjk-cKSyVqjy_GDwoBCwFUle65n3L8w9mCSuGnHURXWT53PSdWsfGLHcKin1wkPT/N7SPdBbLASntv4Js7mB4Ewsiuu0dKCNk27wpgRzYJBU",
    "price": 51.77,
    "prevClose": 51.88,
    "absReturn": -0.10999999999999943
  },
  {
    "fullTicker": "AEO:USA",
    "baseTicker": "AEO",
    "rank": 10.4257,
    "description": "American Eagle Outfitters, Inc. operates as a multi-brand specialty retailer in the United States and internationally. The company provides jeans, apparel and accessories, and personal care products for women and men under the American Eagle brand; and intimates, apparel, activewear, and swim collections under the Aerie and OFFLINE by Aerie brands. It also offers menswear products under the Todd Snyder New York brand; and fashion clothing and accessories under the Unsubscribed brand. The company sells its products through its own and licensed retail stores, concession-based shops-within-shops, wholesale markets, and online marketplaces; and digital channels, such as www.ae.com, www.aerie.com, www.toddsnyder.com, and www.unsubscribed.com. American Eagle Outfitters, Inc. was founded in 1977 and is headquartered in Pittsburgh, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/gjcc_Qy1KJL8FAEeTzFLgg/z3gv1WXfY4MK-LY-E67NdYS03ZMKUHgPsS0IC91IUOOYNNpYy1sp4nHLas2H1IkCaG9xoXdPxpZUkZqLBkrqM_1Ptfg2g6vYBRqiideoErLlkRyTYiX8lYcYgCSDa2JeIMmVVDgRkOrescDysmtQPpnj1VtJOfKcvI07EgOzurFQf2ne7pGtDiTZX2GHCprf/L2RX6DB_Cqx9erSKf4wcF1pe8NY2dFkAayCgFaMST9k",
    "price": 10.28,
    "prevClose": 10.31,
    "absReturn": -0.030000000000001137
  },
  {
    "fullTicker": "TAP:USA",
    "baseTicker": "TAP",
    "rank": 17.7673,
    "description": "Molson Coors Beverage Company manufactures, markets, and sells beer and other malt beverage products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers flavored malt beverages including hard seltzers, craft, spirits, and ready to drink beverages. It provides its products under Arnold Palmer Spiked, Aspall Cider, Blue Moon, Beck's, Blue Run Spirits, Cobra, Corona Extra, Coors Original, Five Trail, Heineken, Leinenkugel's, Madri, Miller Genuine Draft, Molson Ultra, Peroni Nastro Azurro, Pilsner Urquell, Redd's, Sharp's, Simply Spiked, Sol, Staropramen, Stella Artois, Topo Chico Hard Seltzer, ZOA Energy, and Vizzy Hard Seltzer above premium brands; Bergenbier, Borsodi, Burgasko, Caraiman, Carling, Coors Banquet, Coors Light, Jelen, Kamenitza, Miller Lite, Molson Canadian brands, Niksicko, and Oujsko under the premium brands; and Branik, Icehouse, Keystone, Lowenbrau, Miller High Life, Milwaukee's Best, and Steel Reserve under the economy brands. The company was formerly known as Molson Coors Brewing Company and changed its name to Molson Coors Beverage Company in January 2020. Molson Coors Beverage Company was founded in 1774 and is based in Golden, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/hi0R1LrsadHTm-vA51NP1g/J7Dkzly2LuF0qQt07Mpgl_QfOQDb4Iz72JRgWUBVTjg28l_e3Y183wZOcOuZ5GUT7KWHCkfXbUA6kwHbbc-XGKTJEDghlvLeGftrVb2Dmgj32otGz75hqXRV6QOd7vif2P5PAXEzZoUXxHZSE-J-ziYi2IeXb41iG50myRBJOX4CrjbxqYVq1lLf_B7BpB1_/_Sls8_fR_bVsINjuYIS6AeyNe8rUhqQm0ojCzGK4D9k",
    "price": 49.44,
    "prevClose": 49.54,
    "absReturn": -0.10000000000000142
  },
  {
    "fullTicker": "TRGP:USA",
    "baseTicker": "TRGP",
    "rank": 24.9749,
    "description": "Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of complementary domestic infrastructure assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company is involved in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, storing, terminaling, purchasing, and selling crude oil. It is also involved in the purchase and resale of NGL products; and sale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. As of December 31, 2024, it leased and managed approximately 531 railcars; 131 tractors; and 6 vacuum trucks and 2 pressurized NGL barges, as well as owns 8 tractors. Targa Resources Corp. was incorporated in 2005 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/hkSGgcxktR5dKTvghz7dzw/fbmXo8TLLOfc3Bnm00fV-7386x40aDdaIFIPiT9Ko3goD9tQzluBRn8MXCyaBgHWmYjq9L0tVWXyid4Gx4OtHFDeuw-9Tmn1XY0n3DQBYfaOVvjPzY0xZyUFDz0njta_R8cHdwdmdylVC_HsKWi5u6nnoAu7uVjQnEvrhK5p_EIa8hKY1mIj14fh2wp3kk38fQHuTfU5jcOWBBCGw2sW0Q/odpE3Jgjyn2r5A6YqGzn2TCD177KrO6CfSaVBqWf2sk",
    "price": 173.52,
    "prevClose": 173.78,
    "absReturn": -0.2599999999999909
  },
  {
    "fullTicker": "TRN:USA",
    "baseTicker": "TRN",
    "rank": 38.8703,
    "description": "Trinity Industries, Inc. provides railcar products and services under the TrinityRail trade name in North America. It operates in two segments, Railcar Leasing and Services Group, and Rail Products Group. The Railcar Leasing and Services Group segment leases freight and tank railcars; originates and manages railcar leases for third-party investors; and provides fleet leasing, management, and administrative services, as well as railcar maintenance and modification services, and other railcar logistics products and services. As of December 31, 2023, it had a fleet of 109,635 railcars. This segment serves industrial shipper and railroad companies operating in agriculture, construction and metals, consumer products, energy, and refined products and chemicals markets. The Rail Products Group segment manufactures freight and tank railcars for transporting various liquids, gases, and dry cargo; and manufactures and sells railcars and related parts and components. This segment serves railroads, leasing companies, and industrial shippers of products in the refined products and chemicals, energy, agriculture, construction and metals, and consumer products markets. It sells or leases products and services through its own sales personnel and independent sales representatives. The company was incorporated in 1933 and is headquartered in Dallas, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/w5GZl9cVgOJbyxhuRXPFPg/e_RQHhj4ptxyp5eAB64jdVlAIRRW9q7HSX71Y3Wbid3nNMjouyeNT7tyn0us08JmxPrIRz0CHeYX1p5SXAJNy8kMLGZX7vajS0Z1-9LMe-vsEKmmLRP_7S6tPDEh_U-CdFcudy-l8IQ1x4ssOoWfRbscTzev4uHIZYSzLpLhM2IXn4NGr6SDwEMRLep-Uh-e/ZAC2JmGNmvYwWOesY7iR2526ZEPuZ6EUbB4J7LaTEEI",
    "price": 29.03,
    "prevClose": 28.94,
    "absReturn": 0.08999999999999986
  },
  {
    "fullTicker": "CXW:USA",
    "baseTicker": "CXW",
    "rank": 45.9102,
    "description": "CoreCivic, Inc. owns and operates partnership correctional, detention, and residential reentry facilities in the United States. It operates through three segments: CoreCivic Safety, CoreCivic Community, and CoreCivic Properties. The company provides a range of solutions to government partners that serve the public good through corrections and detention management, a network of residential reentry centers to help address recidivism crisis, and government real estate solutions. Its correctional, detention, and residential reentry facilities offer rehabilitation and educational programs, including basic education, faith-based services, life skills and employment training, and substance abuse treatment; food services; and work and recreational programs as well as health care services, including medical, dental, and mental health services. CoreCivic, Inc. was founded in 1983 and is based in Brentwood, Tennessee.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/MLnO8htudq0lyQvcvNDzZQ/T8kDNGpndW_bmBun3sWqRTvzX-xITAmdgHaz_nWk7Wpb73k6HRDhR2rDHjn66_5X4tGGJ_poYmavgjXtJv0zNIP98ESf5ANyRl6oPE98uHCkzgpTUB2fMQWBW5JUtM2z0uxZ8tiyXZTkwgOfxActpYYk2ftDfXI1W7z_LzMSNmQ/13xZLzsFECckSsjFvcSQP0yHTyAxVpy84kJP31KH_m8",
    "price": 21.68,
    "prevClose": 21.04,
    "absReturn": 0.6400000000000006
  },
  {
    "fullTicker": "BLMN:USA",
    "baseTicker": "BLMN",
    "rank": 56.1348,
    "description": "Bloomin' Brands, Inc., through its subsidiaries, owns and operates casual, polished casual, and fine dining restaurants in the United States and internationally. The company operates through U.S. and International Franchise segments. Its restaurant portfolio has four concepts, including Outback Steakhouse, a casual steakhouse restaurant; Carrabba's Italian Grill that offers authentic Italian cuisine; Bonefish Grill; and Fleming's Prime Steakhouse & Wine Bar, a contemporary steakhouse. The company was founded in 1988 and is based in Tampa, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/V1Jwe1mj98rY9RuCgXj45g/p8BqIG-Y6P8xltNpEbLOJjw4DvjvgQT0zkF2okNpAZhcYT6PONeKkh1_9z7FEJ7MdYlfBcBgYA2uXus0rQUzeqTYIx0-QeKB3CSYoy0dvgxwnNqj7ABryGepLd2OCZC6HRfudsGADkE51f8_QELPOh9g1NgC_DyVGzzPXRutjYW0qWXle_k_zp7dZBS-g6FW/2T9Ebm3RkMN-YZEKsK7ZYaRcDcBdk-1QM8rBALEeWjQ",
    "price": 10.16,
    "prevClose": 10.2,
    "absReturn": -0.03999999999999915
  },
  {
    "fullTicker": "ILMN:USA",
    "baseTicker": "ILMN",
    "rank": 67.1304,
    "description": "Illumina, Inc. provides sequencing- and array-based solutions for genetic and genomic analysis in the Americas, Europe, Greater China, the Asia Pacific, the Middle East, and Africa. The company offers sequencing- and array-based instruments and consumables, which include reagents, flow cells, and library preparation; whole-genome sequencing kits, which sequence entire genomes of various size and complexity; and targeted resequencing kits, which sequence exomes, specific genes, and RNA or other genomic regions of interest. It also provides whole-genome sequencing, genotyping, noninvasive prenatal testing, and product support services. The company serves genomic research centers, academic institutions, government laboratories, and hospitals, as well as pharmaceutical, biotechnology, commercial molecular diagnostic laboratories, and consumer genomics companies. The company markets and distributes its products directly to customers, as well as through life-science distributors. Illumina, Inc. was incorporated in 1998 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/ZyT4QVqyWx6pi12sWIU8xA/x3h3zWTSYOiljZzL_aeCvnvUKj-GbLgidcCXTqp7g6XdcNJW_SWK3ondW1S4g_7TMr3-eAUZY2uSnXJhPzVzj4NEfp6akysnJhRjfry0_-PlsUidTQHl8RUQop_7Cu_8h-USJcBKqep5rEg3Pa0z80q4Kmza7AL4UCG_jTubAPE/Yz_s5R_povEsfYxducS_TKkx5z_BU_fwPEWQ9Hj5UMw",
    "price": 100.8,
    "prevClose": 100.34,
    "absReturn": 0.45999999999999375
  },
  {
    "fullTicker": "MRK:USA",
    "baseTicker": "MRK",
    "rank": 81.0258,
    "description": "Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The company offers human health pharmaceutical for various areas, including oncology, vaccines, hospital acute care, cardiovascular, virology, neuroscience, and diabetes under the Keytruda, Welireg, Gardasil, ProQuad, M-M-R II, Varivax, Vaxneuvance, RotaTeq, Pneumovax 23, Bridion, Dificid, Zerbaxa, Noxafil, Winrevair, Adempas, Verquvo, Lagevrio, Isentress/Isentress HD, Delstrigo, Pifeltro, Belsomra, Januvia, and Janumet brands. It also provides veterinary pharmaceuticals, vaccines and health management solutions and services, such as livestock products under the Nuflor, Bovilis/Vista, Bovilis Cryptium, Banamine, Estrumate, Matrix, Resflor, Zuprevo, Revalor, Safe-Guard, M+Pac, Porcilis, Circumvent, Nobilis/Innovax, Paracox and Coccivac, Exzolt, Slice, Imvixa, Clynav, Aquavac/Norvax, Aquaflor, Flexolt brands; Allflex Livestock Intelligence solutions for animal identification, monitoring and traceability; and companion animal products under the Bravecto One-Month, Bravecto Injectable/Quantum, Bravecto Plus, Sentinel Spectrum, Sentinel Flavor Tabs, Optimmune, Nobivac NXT, GilvetMab, Otomax, Mometamax, Mometamax Ultra, Posatex, Caninsulin/Vetsulin, Panacur, Regumate, Prestige, Scalibor/Exspot, Sure Petcare, and Home Again brands. The company has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates; AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications; licensed to develop, manufacture and commercialize LM-299, a novel investigational PD-1/VEGF bispecific antibody from LaNova; and collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/UQBbbd9435JOY8BaqmFELg/DUOXwe4-z1Yn3MhpKxXsGR1hYur_lPaCPybTUsgsLVD1xI9xeEz7MrbbhRzYTEG-wtD9FR04XYePV80FQ_dFG8eedDLxAdxMPlnp1XRXi0XRSc_W6ITXxIh3o8QFlbEwttN84Ccp9UnotsBvkzoFbDNNcvAKR09ixCLmgbl88C0/9g94go6Iu3BSIcAyzKD1lBJ6ZWcbTxpinEUKHslk-rE",
    "price": 80.93,
    "prevClose": 82.39,
    "absReturn": -1.4599999999999937
  },
  {
    "fullTicker": "KFY:USA",
    "baseTicker": "KFY",
    "rank": 93.0439,
    "description": "Korn Ferry, together with its subsidiaries, engages in the provision of organizational consulting services worldwide. The company offers consulting services for organizational structure, culture, performance, development, and people; and builds, sells, and delivers Digital talent technology products, including a talent suite that enables clients to make critical talent decisions in the flow of work across talent acquisition and talent development. It also provides executive search services that helps organizations to recruit board level, chief executive, and other C-suite/senior executive, as well as general management talent; enterprise talent acquisition solutions for permanent and interim placements at the professional level middle and upper management, as well as senior executives; and recruitment outsourcing and projects solutions for clients' recruitment requirements. The company operates cloud human resources platforms comprising Korn Ferry Architect, for providing organization and talent planning architecture for an agile and future-focused workforce; Korn Ferry Assess, for empowering leaders to take actions that lead to business success; Korn Ferry Listen, for deploying engagement surveys and benchmark employee engagement; Korn Ferry Sell, for developing and replicating sales strategies; and Korn Ferry Pay, a self-service pay solution, that provides global data and insights needed in real-time to make decisions on employee compensation programs. It serves public and private companies, middle-market and emerging growth companies, and government and non-profit organizations, as well as consumer markets, financial services, healthcare, life sciences, industrial, technology, and specialties sectors. The company was formerly known as Korn/Ferry International and changed its name to Korn Ferry in January 2019. Korn Ferry was founded in 1969 and is based in Los Angeles, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1751853600000/-hVuvHY-QIjsvKsGhoJ_Hg/NdHPcJ7QXspzOBjOOZB5_JecDrTkuUQ7Hl3uMrY4Cq_NzaELdt70LuBiehgQlg8DeK4dzRMmB8YfQ6qIamT6JxS5aHl-2_vnHR3DvEiA79vsFXq8gNz0_0YUNrLtnaLO3l29ZEl1fQ7gW7_YhXEeXcCQn4X0fpBIOnF9P_oUiDI/T3F5OdGKXPlbDxspXmBpK7t34lGmn9PGjo9Gr39gos4",
    "price": 73.98,
    "prevClose": 74.1588396454472,
    "absReturn": -0.17883964544719788
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 625.34,
    "prevClose": 620.45,
    "absReturn": 4.889999999999986
  }
]