[
  {
    "fullTicker": "LQDA:USA",
    "baseTicker": "LQDA",
    "rank": 2.5479,
    "description": "Liquidia Corporation, a biopharmaceutical company, develops, manufactures, and commercializes various products for unmet patient needs in the United States. Its lead product candidates include YUTREPIA, an inhaled dry powder formulation of treprostinil for the treatment of pulmonary arterial hypertension (PAH) and pulmonary hypertension associated with interstitial lung disease (PH-ILD). The company also offers Remodulin, a treprostinil administered through continuous intravenous and subcutaneous infusion. The company also a license agreement with Pharmosa Biopharm Inc to develop and commercialize L606, an inhaled sustained-release formulation of Treprostinil for the treatment of PAH and PH-ILD. Liquidia Corporation was founded in 2004 and is based in Morrisville, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/biNAuNSAIOjYhoJrH5ywjw/1VjeRRF5IzsHPBDSU2vp4fimJhRSFUyNY6fc2alq0BvjRZhp4jK70d13YrMEj8aKgdlvPf8U8KJK5nxUhuos7vDaSN0KRnX0hb1TtvPEw1XxMK3_Ho46-8_rzfb5QWv4KTrovwrx0BdLyJ7JvKpXtsajJUk-1uekvJSsoaYvoZk/Gj6U9bSS0blStrlT_3SU5-t99djc4q6fWnwuPjl0j3g",
    "price": 18.295,
    "prevClose": 18.02,
    "absReturn": 0.27500000000000213
  },
  {
    "fullTicker": "BYRN:USA",
    "baseTicker": "BYRN",
    "rank": 11.8179,
    "description": "Byrna Technologies Inc., a less-lethal self-defense technology company, develops, manufactures, and sells less-lethal personal security solutions in the United States, South Africa, Europe, South America, Asia, and Canada. The companys products include handheld personal security devices and shoulder-fired launchers designed for use by consumers and professional security customers without the need for a background check or firearms license; projectiles, such as chemical irritant, kinetic, and inert rounds; self-defense aerosol products comprising Byrna Bad Guy Repellent; and accessories and related safety products, such as Byrna Banshee, Byrna Shield, compressed carbon dioxide canisters, sighting systems, holsters, and Byrna-branded apparel. It sells its products to the consumer market through its Byrna e-commerce store and Amazon storefront, Side Hustle dealer program, premier dealers, and a network of outdoor and sporting goods stores either directly or through distributors; and to the professional security market through Train the trainer program. The company was formerly known as Security Devices International, Inc. and changed its name to Byrna Technologies Inc. in March 2020. Byrna Technologies Inc. was incorporated in 2005 and is headquartered in Andover, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/bVoD4ZwipVfOn_tFi6ddyw/8rfuj5xasWArn5ePWXKv5PLhacXAJwlYq2oP0AQybFnsOld59WQm0nfuszSUhW4edA3SEei8ejzXssBdaiBMZChHvnkKL7pQFb8jR2v9z4Bt7A2X2kL3A5KIqsDk3O8fKGXd32o4ndW3YMp1XsU_yw91T4zrD2YuzXzoYJ-TkOH9_HI7myJvcV626fbSJQsp/2PcUHg9sHmxx3pyNeQI3sLGpZ3v6qVyRuOIU6A-Vzos",
    "price": 32.09,
    "prevClose": 26.57,
    "absReturn": 5.520000000000003
  },
  {
    "fullTicker": "NRXS:USA",
    "baseTicker": "NRXS",
    "rank": 18.3773,
    "description": "NeurAxis, Inc., a medical technology company, focuses on developing neuromodulation therapies to address chronic and debilitating conditions in children and adults in the United States. It offers IB-Stim, a percutaneous electrical nerve field stimulation system intended to be used in patients 11-18 years of age with functional abdominal pain associated with irritable bowel syndrome. The company sells its products to healthcare companies, including hospitals and clinics. The company was formerly known as Innovative Health Solutions, Inc. and changed its name to NeurAxis, Inc. in March 2022. The company was founded in 2011 and is headquartered in Carmel, Indiana.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/s2lI_5DiB_r6323IJa1enA/c548CAskWn1ktaCO-r0BNMcXcL2uG1ewd_8Mw8L1SIV3CtqiutkURfUnmvIMHCQueXOZPR1wAHNZovnPMDYOLEFkocs05dQwzZ-ebQbwT_ZHHW7EAJa-rG3muMCnlwfhGmv52vP7PxgpBYfGjpnRno_I61_jq4wUNkJJ_gWhtK0/Kxj-vkX7sizRmhprgRIYaHOg5kHcqaxrgVtZ9j7za7s",
    "price": 2.655,
    "prevClose": 2.6,
    "absReturn": 0.054999999999999716
  },
  {
    "fullTicker": "TNON:USA",
    "baseTicker": "TNON",
    "rank": 27.7376,
    "description": "Tenon Medical, Inc., a medical device company, engages in the development of surgical implant systems to treat severe lower back pain in the United States and Puerto Rico. The company offers CATAMARAN SI-Joint Fusion System to fuse sacroiliac joints (SI-Joints) to treat SI-Joint dysfunction that often causes severe lower back pain; and features fixation device that passes through the axial and sagittal planes of the ilium and sacrum, as well as transfixes the SI joints. Tenon Medical, Inc. was incorporated in 2012 and is headquartered in Los Gatos, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/Js2vg_RdcZvd-W38QwMDdg/bELeIZWPs5GsMN4bRu0vnEhwLY6U80pdDr8DK2UklptgfAVhVOSyGqlf1HygBkH3qyM5Mmsel3o8NbCrNMeLkD8BwhNNcZOMkstZ0r10LBLkbFf_2Sh47SPbFxFRQa2td1Is8ubCkrthP0HEHlsleoHesXIzpCc-sVY7UKcCT7fub_oAy2bJYM73PQz3UpMU/YH8FyxGq2JmIrbyYAKILbUJgLgO5m_9A16cYbX1Pisk",
    "price": 1.005,
    "prevClose": 1.02,
    "absReturn": -0.015000000000000124
  },
  {
    "fullTicker": "HD:USA",
    "baseTicker": "HD",
    "rank": 36.5558,
    "description": "The Home Depot, Inc. operates as a home improvement retailer in the United States and internationally. It sells various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products. The company also offers installation services for flooring, water heaters, baths, garage doors, cabinets, cabinet makeovers, countertops, sheds, furnaces and central air systems, and windows. In addition, it provides tool and equipment rental services. The company serves consumers, such as do-it-yourself homeowners and do-it-for-me customers; and professional renovators/remodelers, general contractors, small to medium homebuilders, maintenance professionals, handymen, property managers, building service contractors and specialty tradespeople, such as electricians, landscapers, plumbers, painters, pool contractors, and roofers. It sells its products through websites and its mobile applications, including homedepot.com; homedepot.ca and homedepot.com.mx; blinds.com, justblinds.com, and americanblinds.com for custom window coverings; thecompanystore.com, an online site for textiles and décor products; hdsupply.com for maintenance, repair, and operations (MRO) products and related services; and srsdistribution.com, heritagelandscapesupplygroup.com, and heritagepoolsupplygroup.com for roofing and building materials, landscape, and pool products; and The Home Depot stores. The Home Depot, Inc. was incorporated in 1978 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/2qYLYIIIkFH3TQzK8Gmgnw/Al0LqfML5o7e2gghDrku7YnaYGv4eelxaA4Q0fxY8w555MxIhxSnC4RBLaiiW6vAJLJZ9Q3CX6EPDEvjgk8mCj6-9edk8eNBdJ0I_8iFkhgYCBfo8Lq5BWKI7kt_7WX0u0qfKeMoXCFPrLxV8WhvgAzL_NXUWnvekJA1KY4GylI/2_FrvDEAMFkd7I6bdFbyhEwFCnSmAGpEpYzSSyf2teM",
    "price": 367.525,
    "prevClose": 369.28,
    "absReturn": -1.7549999999999955
  },
  {
    "fullTicker": "BIVI:USA",
    "baseTicker": "BIVI",
    "rank": 43.0069,
    "description": "BioVie Inc., a clinical-stage biopharmaceutical company, develops drug therapies to treat neurological and neurodegenerative disorders, and advanced liver disease. The company develops BIV201 for the treatment of ascites due to chronic liver cirrhosis. It also develops NE3107 that is in Phase III clinical trial for the treatment of patients with mild to moderate Alzheimer's disease; and in Phase 2 clinical trial to treat Parkinson's disease, as well as for the long COVID program. The company was formerly known as NanoAntibiotics, Inc. and changed its name to BioVie Inc. in July 2016. BioVie Inc. was incorporated in 2013 and is headquartered in Carson City, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/aR89XZa9oKzUwIYy1QYalg/HN0e0R-OtPd46IDQkprTDj3J_ONU2vXt0bG9iZqMGXfx-VD59srqtbGHCQ-8UTOx5oSdki_bp4lQ9yY2lfmbElH0htEBDAxh37v4W6Rd5qbVj5aLIDTHA06pge-1RxSEwvNuRYE7iVmTVcUNkl6N1yvLo2pHKal25eiLfMumQ2Y/v9nDTEsnoLn03qdzmm6S_aajfpy_Gcv0Ra3HidIB7Sw",
    "price": 1.105,
    "prevClose": 1.09,
    "absReturn": 0.014999999999999902
  },
  {
    "fullTicker": "ATR:USA",
    "baseTicker": "ATR",
    "rank": 58.5652,
    "description": "AptarGroup, Inc. designs and manufactures a range of drug delivery, consumer product dispensing, and active material science solutions and services for the pharmaceutical, beauty, personal care, home care, and food and beverage markets. The company operates through Aptar Pharma, Aptar Beauty, and Aptar Closures segments. It also provides pumps for nasal allergy treatments; and metered dose inhaler valves for respiratory ailments, such as asthma and chronic obstructive pulmonary diseases; elastomer for injectable primary packaging components; and active material science solutions. In addition, the company offers dispensing pumps, closures, elastomeric components, aerosol valves, and digital health solutions. It primarily sells its products and services in Asia, Europe, Latin America, and North America. AptarGroup, Inc. was incorporated in 1992 and is headquartered in Crystal Lake, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/tkHEa1Tm2R1wP4Ap-lzAfA/pVSCIVZuca84e8cUfFgKi8X_FPzUSzXp7LSIvJFMiKJwUMYCjIl9M0EDfONo0_tpKzD1oRJQRgM3nCLUypr_QQINQtMTO5nEB5quSKPJdupXRZq2eHQWDBT7ucievxxrgLLP18FxUpDEr2HtfRVbQDAJ8HI8szjNKCFdq5yvL0pvjKQdCUWWvnC5G4Wq5DfB/nVjPfLcdk4BVzSwq6yr1NzRfAE92eoRzdKjTNnXdP2Y",
    "price": 152.52,
    "prevClose": 152.49,
    "absReturn": 0.030000000000001137
  },
  {
    "fullTicker": "ECPG:USA",
    "baseTicker": "ECPG",
    "rank": 63.6429,
    "description": "Encore Capital Group, Inc., a specialty finance company, provides debt recovery solutions and other related services for consumers across financial assets worldwide. The company purchases portfolios of defaulted consumer receivables at discounts to face value, as well as manages them by working with individuals as they repay their obligations and works toward financial recovery. It is also involved in the provision of early stage collection, business process outsourcing, and contingent collection services. In addition, the company engages in debt servicing and other portfolio management services to credit originator for non-performing loans. Further, it offers credit management services. Encore Capital Group, Inc. was incorporated in 1999 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/ucFOkuWni6npX8uIddPUxg/pg8z9786k5plHMv_wHOo6kDJIWvZxmlkjY9qDb_xzni5CjgCEpR2lOMd3cPg9gAu-ciwbWwUBvuSXipwMmEVHDadIdGr_mZLdO6bdXis3TaSEPnMF0F7_KQDCkpeBmmXnTu4PE1NGLQpa2zH5Br-L7ipp7f9fRAo25F1lx5tETmy0S0WE5OS4IAqc_HjhJcv/hUCECNkxT1tg0LxV24aOP2B08i3hCMsahfklU8wGf_0",
    "price": 37.7,
    "prevClose": 37.25,
    "absReturn": 0.45000000000000284
  },
  {
    "fullTicker": "MGEE:USA",
    "baseTicker": "MGEE",
    "rank": 77.5027,
    "description": "MGE Energy, Inc., through its subsidiaries, operates as a public utility holding company in the United States. It operates through Regulated Electric Utility Operations; Regulated Gas Utility Operations; Nonregulated Energy Operations; Transmission Investments; and All Other segments. The company generates, purchases, and distributes electricity; purchases and distributes natural gas; owns and leases electric generating capacity; and plans, constructs, operates, maintains, and expands transmission facilities to provide transmission power services. It also generates electricity from coal-fired, gas-fired, and renewable energy sources; and provides solar and wind generation, and battery storage services. As of December 31, 2024, the company owned and operated 825 miles of overhead electric distribution lines; 1,359 miles of underground electric distribution cables; 48 substations with an installed capacity of 1.2 million kVA; and gas facilities, including 3,092 miles of distribution mains, as well as supplied electric service to approximately 167,000 customers. MGE Energy, Inc. was incorporated in 2001 and is headquartered in Madison, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/jKOO8950q7zfnMjPHADlOA/BESDmGT2aVqxEdcMd3EfSvQ3afNFBKTfv-jgZILVzlNkxFycuk3Ftder1ylNvcVtifzDj1NPfJmltAcQFpEVU-gjlNPYuUQUXYaGdfqYBN07G3ALwVkAizo3co6hhgV8L-iChglXU9v2rLZo2__kRkbo7EmIrXlG71oNIJOSE6kgEd4Ne-AfWf-gXZjRoTIM/g-RObLZ5DYAQSIAB_q-qzW7HO9kcUAebJ3sWTXEvtqY",
    "price": 88.18,
    "prevClose": 88.22,
    "absReturn": -0.03999999999999204
  },
  {
    "fullTicker": "NYT:USA",
    "baseTicker": "NYT",
    "rank": 88.4171,
    "description": "The New York Times Company, together with its subsidiaries, creates, collects, and distributes news and information worldwide. The company operates through two segments, The New York Times Group and The Athletic. It offers The New York Times (The Times) through company's mobile application, website, printed newspaper, and associated content, such as podcast. The company offers The Athletic, a sports media product; Cooking, a recipe product; Games, a puzzle games product; and Audio, an audio product. In addition, it offers a portfolio of advertising products and services to advertisers, such as luxury goods, technology, and financial companies, to promote products, services or brands on digital platforms in the form of display ads, audio and video, in print in the form of column-inch ads, and at live events; and Wirecutter, a product review and recommendation product. Further, the company licenses content to digital aggregators in the business, professional, academic and library markets, and third-party digital platforms; articles, graphics, and photographs, including newspapers, magazines, and websites; and for use in television, films, and books, as well as provide rights to reprint articles, and create and sell new digests. Additionally, it engages in commercial printing and distribution for third parties; and operates the NYTimes.com website. The company was founded in 1851 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1749240000000/4Ivsj9gevMhIqeR_EW1yHw/twEALKWJrfqWWGnkExD0K48K5RyUqujuIxKBkDxeMwr8Ff57VUVAeK8z7LkaN_5j9vKJVeKfPA-iEAIfGnWbeXLZr2gK0WYngY29_kIe2E9AGCTRtePPlvfgnpvhFLeUCv0kgnluVSLGym6TM1HFUbBBvWtwWPvlajoitcTaRIwFSHaC72h04D1TJ5kweNLT/GxW8Cz6lrwpHBf0-PSrGmF7kaDwtvGeVHEuZGsauJ84",
    "price": 55.605,
    "prevClose": 55.75,
    "absReturn": -0.14500000000000313
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 598.82,
    "prevClose": 593.05,
    "absReturn": 5.7700000000000955
  }
]