[
  {
    "fullTicker": "SPRY:USA",
    "baseTicker": "SPRY",
    "rank": 1.7166,
    "description": "ARS Pharmaceuticals, Inc., a biopharmaceutical company, develops treatments for severe allergic reactions. The company is developing neffy, a needle-free and low-dose intranasal epinephrine nasal spray for rescue medication for people with Type I severe allergic reactions, including anaphylaxis. It serves healthcare professionals, patients, and caregivers. The company was founded in 2015 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/qLYA6r3SJGhj2PBB3UGVEA/4HjAzNO1qNq_5VID6smTXXG5jKIbdSH-sO0KQ6-KQT2ufSMIzqu76yuOKlsaM-lWOdKFx9ZeGhYtwtEC5ClJ65T355baiKxphyJaBcfQjlBHtYW5MNNGvD25PP-2nv7VvdXFmstbfwd8frqbcCPEWuBEGgjwJD2o8uXwYmDk9CZprR-kXQcqAbQ-Fe6hYxRC/B4pfUEWJDZlc7x5jGoluzmoZUVl3puRLEG43eAX-1J0",
    "price": 9.74,
    "prevClose": 10.14,
    "absReturn": -0.40000000000000036
  },
  {
    "fullTicker": "TNGX:USA",
    "baseTicker": "TNGX",
    "rank": 11.336,
    "description": "Tango Therapeutics, Inc., a biotechnology company, discovers and develops drugs for the treatment of cancer. The company develops methylthioadenosine -cooperative protein arginine methyltransferase 5 (PRMT5) inhibitors; TNG462, which is in Phase 1/2 clinical trial for non- central nervous system cancers including pancreatic and lung cancer; TNG456, a brain-penetrant PRMT5 inhibitor, for central nervous system cancers including glioblastoma; and TNG260, a co-repressor of repressor element-1 silencing transcription (CoREST) inhibitor to reverse the immune evasion effect of STK11 loss-of-function mutations. The company has a strategic collaboration with Gilead Sciences, Inc. for the discovery, development, and commercialization of a pipeline of therapies for patients with cancer. Tango Therapeutics, Inc. was founded in 2017 and is headquartered in Boston, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/iBBYCzG1QXLhXeft3hDqGw/BWbu1HMoJyvODWsAQ-0ImdacbYG-3b95Jc-_uuhLbdP8CH7sQXjuDEPX1SiCS3TIczrTdeQDAx5KcC15bh_hsGu3k6fUaSQplJ69zXYArmprx-knXdme0XPtRqjFEEEGxsGGbDhFD0xuC67CmHrbD4l--4ihpiy1yBseIa7Bo7X-50NUqfIjk4reewrgYylB/-CLfns6tm1hzMQtPdPfvuO_iDVrWXcDGiiShh4U_xc8",
    "price": 11.92,
    "prevClose": 12.32,
    "absReturn": -0.40000000000000036
  },
  {
    "fullTicker": "HNST:USA",
    "baseTicker": "HNST",
    "rank": 18.2834,
    "description": "The Honest Company, Inc. manufactures and sells diapers and wipes, skin and personal care, and household and wellness products. It offers baby care products, mama care products, baby clothing, and diaper bags; skin care products, including cleansers, moisturizers, serums and treatments, eye creams, and skincare kits; and face, eye, and lip makeup products, as well as makeup kits and brushes. The company also provides shower and bath products, hair care, face and body lotion, body care kits, and vitamins and supplements. In addition, it sells its products through digital and retail sales channels, such as its website and third-party ecommerce sites, as well as brick and mortar retailers. The Honest Company, Inc. was incorporated in 2011 and is headquartered in Los Angeles, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/5jYT48vk13IQ4OlKtsjEGg/anB2mn69OuG0scQJMMUc4pkEjjCxXfz3H2AQ-a-aBmqm-H4xxRkw8RXobj3Yv4lApLFy8I_nkgfr6OUa4G91VJen_gQJhS282M9EUFH5o4yd-h6B7Q3myoY04ZCZy4RqjrAfnkUiCEuyEWzlVJEpquwmn1GK6ZgI7FhtIyQ0GPqCw1NVPL4JnQKX4mC3eWjY/Yw2rOjyg-1dimhdou5dhI7f0Jv1fuiPqe16txEdpz5s",
    "price": 2.245,
    "prevClose": 2.36,
    "absReturn": -0.11499999999999977
  },
  {
    "fullTicker": "CELH:USA",
    "baseTicker": "CELH",
    "rank": 27.3198,
    "description": "Celsius Holdings, Inc. develops, processes, manufactures, markets, sells, and distributes functional energy drinks in the United States, North America, Europe, the Asia Pacific, and internationally. The company offers CELSIUS, a lifestyle and energy drink; CELSIUS Originals and Vibe, which are functional energy drinks in various flavors that is offered in carbonated and non-carbonated forms; CELSIUS ESSENTIALS, a functional energy drink formulated with aminos; CELSIUS On-the-Go Powder, a functional energy drink in powder form; and CELSIUS Hydration, a line of zero-sugar hydration powders infused electrolytes in various fruit-forward flavors, as well as CELSIUS ready-to-drink products. It distributes its products through direct-to-store delivery, independent distributors, supermarkets, convenience stores, drug stores, nutritional stores, food service providers, and mass merchants, as well as natural food stores, fitness centers, mass market retailers, vitamin specialty stores, club stores, gyms, and e-commerce platforms. The company was formerly known as Vector Ventures, Inc. and changed its name to Celsius Holdings, Inc. in January 2007. Celsius Holdings, Inc. was founded in 2004 and is headquartered in Boca Raton, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/SFDRFKh_PMiROLZT2nXH_w/uGJ6wxNqMswkMe8Bjptsap1odKe_IiCSdayk_8HppSHBdlkg0O8yVR62oNS6s2yco426FJJZz1t7TtRXiOzpoQiqUQb3zwvtMg_sxA-WF5qIzP1DtOyA0KNC9S3DLKJgctjuDLHOcI7KQYeQIYZVNrjWw4dyulJpAGToXj8KRTfG0pmOwCY5OC52Sr8vL6QP/QBn7X8_kQRdg2Srh6Rik2p6YfWZGrl4iQBuX18HowLU",
    "price": 48.21,
    "prevClose": 49.3,
    "absReturn": -1.0899999999999963
  },
  {
    "fullTicker": "STKL:USA",
    "baseTicker": "STKL",
    "rank": 39.1903,
    "description": "SunOpta Inc. engages in the manufacture and sale of plant and fruit-based food and beverage products in the United States, Canada, and internationally. It provides plant-based beverage products, including oat, almond, soy, coconut, rice, hemp, and other bases under the Dream and West Life brands names; oat-based creamers under the SOWN brand name; ready-to-drink protein shakes; packaged teas and concentrates; meat and vegetable broths and stocks; and nut, grain, seed, and legume-based beverages. The company also offers plant-based ingredients, such as oatbase, soybase, oatgold, hempbase, and soy powders and okara; ready-to-eat fruit snacks made from apple purée and juice concentrate in bar, bit, twist, strip and sandwich formats; cold pressed fruit bars; ready-to-eat fruit smoothie and chia bowls topped with frozen fruit; and liquid and dry ingredients for internal use and for sale to other food and beverage manufacturers. It sells its products through various distribution channels, including foodservice operators, grocery retailers and club stores, branded food companies, and food manufacturers, as well as e-commerce channels. The company was formerly known as Stake Technology Ltd. and changed its name to SunOpta Inc. in October 2003. SunOpta Inc. was incorporated in 1973 and is headquartered in Eden Prairie, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/RKRDHPJoLHlR7ikUOilsdQ/oVD06k0PIa8WLGDK7q-l3kPt41sUBq-oKak4DxYP1t7pDubzI60OYPekI3MkWKO_DraQRg85LVWg3URHX3g3CZ7byx72ivHeOPL1Oji2ZS8M-zjgzAXOHBGnxOWgVqAXGCjCAOeroAURsQ-RamSNUtIGQQMzYIItRlExI_ADxIM/ybG1-uX2dOk1TA6by0_r0QQtyEfC0U6P-OqvRVWl9z0",
    "price": 4.875,
    "prevClose": 4.92,
    "absReturn": -0.04499999999999993
  },
  {
    "fullTicker": "NRG:USA",
    "baseTicker": "NRG",
    "rank": 52.0972,
    "description": "NRG Energy, Inc., together with its subsidiaries, operates as an energy and home services company in the United States and Canada. It operates through Texas; East; West/Services/Other; Vivint Smart Home; and Corporate Activities segments. The company produces and sells electricity generated using coal, oil, solar, and battery storage; natural gas; and a cloud-based home platform, including hardware, software, sales, installation, customer service, technical support, and professional monitoring solutions. It offers retail electricity and energy management, line and surge protection products, HVAC installation, repair and maintenance, home protection products, repair and maintenance, and carbon offsets; retail services comprising demand response, commodity sales, energy efficiency, and energy management solutions; and system power, distributed generation, renewable and low-carbon products, carbon management and specialty services, backup generation, storage and distributed solar, and energy advisory services. In addition, the company trades in power, natural gas, and related commodities; environmental products; weather products; and financial products, including forwards, futures, options, and swaps. It offers its products and services under the NRG, Reliant, Direct Energy, Green Mountain Energy, and Vivint. It serves residential, commercial, government, industrial, and wholesale customers. NRG Energy, Inc. was founded in 1989 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/5MofMfX2HWEYz-TtMOoEFQ/SzGzrMQF79HkVdvIK9DLjxdiTKxjqes83wPJ6SKVMXaOOlm7UUsR7w9zEHsbQFx_yBWG0bMlWjJi-sdNtcK6Nm7KJYSsUt3wJy8j_uZyAbO47P_065WgLawJYUffM87qZHbOWtKrGk_TyVAPO52O2gKb42qC_cWbnRtODppeWQH2s-lRvww4WvMSUfglbbYS/E6pNNPYDQbREE1cuiMBs2-TdYkwEaKeGJMGWYtn-Xko",
    "price": 143.92,
    "prevClose": 143.99,
    "absReturn": -0.0700000000000216
  },
  {
    "fullTicker": "AGEN:USA",
    "baseTicker": "AGEN",
    "rank": 58.7206,
    "description": "Agenus Inc., a clinical-stage biotechnology company, discovers and develops therapies to activate the body's immune system against cancer and infections in the United States and internationally. It offers Retrocyte Display, an antibody expression platform for the identification of fully human and humanized monoclonal antibodies; and display technologies. It develops QS-21 Stimulon adjuvant, a saponin-based vaccine adjuvant. The company also develops Balstilimab, a programmed death receptor-1 (PD-1) blocking antibody; AGEN1181, a human Fc-enhanced cytotoxic T-lymphocyte antigen 4 (CTLA-4) blocking antibody that is in Phase 2 trials in metastatic colorectal cancer (mCRC), pancreatic cancer, and melanoma; AGEN2373, a CD137 monospecific antibody that is in Phase 1b clinical trial; AGEN1423, a CD73/TGFß TRAP antibody; AGEN1571, an ILT2 monospecific antibody that is in clinical development; and BMS-986442, a TIGIT bispecific antibodies. In addition, it develops INCAGN1876, a GITR agonist; INCAGN2390, a TIM-3 monoclonal antibodies; INCAGN2385, a LAG-3 monospecific antibody; MK-4830, a monospecific antibody targeting ILT4 that is in Phase 2 clinical trial; UGN-301, a zalifrelimab intravesical solution for the treatment of cancers of the urinary tract t; and AGEN1884. The company operates under the Agenus, MiNK, Prophage, Retrocyte Display, and STIMULON trademarks. It has collaborations with Bristol-Myers Squibb Company, Betta Pharmaceuticals Co., Ltd., UroGen Pharma Ltd., Gilead Sciences, Inc., Incyte Corporation, and Merck Sharp & Dohme. The company was formerly known as Antigenics Inc. and changed its name to Agenus Inc. in January 2011. Agenus Inc. was founded in 1994 and is headquartered in Lexington, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/yjeNfazvgtCYtqx2IJiRqQ/oS64fFfWEcxr_sjyJBox-k4zcK5osDaIBfccFzVlzZ2ngrJ65bdfxtc5DsYNXJa2HtejH3SaTmYvM67G4bINHF6HNMeTtZY0VSNxpg6WZwc7w0KgBlmpYGOLcqmgXkCZZTterP5VFPrKfpvL6rleJZLM9kzWixm4BDlnnc1tfbk/mnAiNwgYvkuOicbmmMazjdZ_LkyVApDdZuip2DW1f9I",
    "price": 2.8,
    "prevClose": 2.89,
    "absReturn": -0.0900000000000003
  },
  {
    "fullTicker": "CTRN:USA",
    "baseTicker": "CTRN",
    "rank": 68.5668,
    "description": "Citi Trends, Inc. operates as a value retailer of fashion apparel, accessories, and home goods. The company offers apparel, such as fashion sportswear and footwear for men and ladies, as well as apparel for kids, including newborns, infants, toddlers, boys, and girls; sleepwear, lingerie, and scrubs for ladies; and kids uniforms and accessories. It also provides accessories and beauty products that include handbags, luggage, hats, belts, sunglasses, jewelry, and watches, as well as offers outerwear for men and women. In addition, the company offers home and lifestyle products comprising home products for the bedroom, bathroom, kitchen, and decorative accessories; and food, tech, team sports, health and products, as well as seasonal items, books, and toys. Citi Trends, Inc. provides its products primarily to African American and multicultural families in the United States. The company was formerly known as Allied Fashion, Inc. and changed its name to Citi Trends, Inc. in 2001. Citi Trends, Inc. was founded in 1946 and is headquartered in Savannah, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/f4GMcnhtRA7-SBPYy_LHHQ/O2MLR4lHXZpaO8z1GiX-0vdq8S4pZB3c6XjfxAMbWOhwKcar9IbdhVHuuhqDkY8SfGRkSXNB_2Lhc7snx_gzoIzDOHC2wG-l7ogcGRNq0Mgq6bRCCpntXbdqmDPkqPX-AE--WYkbmiqvN326LED1_FDu46ArOBfL6Z6LMNPKFKjirvIuYMg9Qj0PS9hz3ivH/bJeIhD7ma6t1kdYln3y1pISNAVtPz4f7wC7Us65hOis",
    "price": 45.065,
    "prevClose": 45.61,
    "absReturn": -0.5450000000000017
  },
  {
    "fullTicker": "LOCO:USA",
    "baseTicker": "LOCO",
    "rank": 76.3887,
    "description": "El Pollo Loco Holdings, Inc., through its subsidiary, El Pollo Loco, Inc., develops, franchises, licenses, and operates quick-service restaurants under the El Pollo Loco name. The company operates and franchises restaurants located in California, Nevada, Arizona, Texas, Colorado, Utah, and Louisiana. It also licenses its brand to restaurants in the Philippines. The company was formerly known as Chicken Acquisition Corp. and changed its name to El Pollo Loco Holdings, Inc. in April 2014. El Pollo Loco Holdings, Inc. was founded in 1975 and is headquartered in Costa Mesa, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/ar8UNo2MaR435JQB2JAa0A/UsFZHNrGH28JLqxiro2iy4fCG_66rcM-vFX4EQsKjFXt4CXfybmT3Zcon3gRNT7_O1ALPTL516ZW8gGXEwDAHu41dHMpCC7n4bTLaWXTAWnJKu2U2MX4GnRNSpvtFMNduWhX1-wrO3HqJq-1ysy9ZU4u_nPk8IbSUzHA3LHyXUz3zq80tl_VcHmGFADan4cN/qVdwlurtDfFXMcqj_MCUjQNYPGqkzdQdNf-0wj5g170",
    "price": 10.655,
    "prevClose": 10.74,
    "absReturn": -0.08500000000000085
  },
  {
    "fullTicker": "THR:USA",
    "baseTicker": "THR",
    "rank": 88.0162,
    "description": "Thermon Group Holdings, Inc. provides engineered industrial process heating solutions for process industries in the United States and Latin America, Canada, Europe, the Middle East, Africa, and the Asia-Pacific. It offers heat tracing products, such as electric heat tracing cables, steam heating solutions, controls, monitoring and software, instrumentation, project services, industrial heating and filtration solutions, temporary electrical power distribution and lighting, and other products and services. The company also provides controls, monitoring, and software systems for the control and management of a heat trace system; environmental heating solutions under the Ruffneck, Norsemen, and Catadyne brands; process heating solutions under the Caloritech brand name; filtration solutions under the 3L Filters brand; rail and transit solutions under the Hellfire, Velocity, ArcticSense, and other brand names; and boilers under the Vapor Power, Precision Boilers, and Caloritech brands. In addition, it offers project services; transportation heating products, including track and switch heaters, accessories, control panels, rail heaters, gas blower accessories, and air curtains; transit heaters; and velocity heat products. Further, the company offers temporary power solutions; heating systems, such as engineered electric heat, explosion proof gas catalytic heaters, heaters for harshest environments, methane abatement, and engineered filtration system; electrically, steam, and fluid heated tubing bundles; and pre-insulated tubing and system accessories tubing bundles. It serves chemical and petrochemical, oil and gas, power generation, rail and transit, commercial, energy transition/decarbonization, mining and mineral processing, maritime/shipbuilding, semiconductors, pharmaceutical and biotechnology, food and beverage, data centers, and renewables industries through a network of sales and service professionals, and distributors. Thermon Group Holdings, Inc. was founded in 1954 and is headquartered in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770336000000/zjypGF49ZcANCMJ_ip7DcQ/FQnH5478nvHr2t2oR9liksZi__2938e9dIJQ7etD1MqfoQ8w06OO5LAQw0zt_z2oJLo5v8P1Ou_DNWBlRo8KKSkPNDqM0YIsT0xTwJKOt_evms7pChcIxOZ1bz2QUixBwrmibMQBrbSk-ycEVkDuRHlfgDGgfB0O8jpegDITUhZog3thx06Y56eyJI1MaAyE/7g005mI0YqshcI3kNow3BnuThzxf1HarWVgswZ8obrc",
    "price": 48.07,
    "prevClose": 46.19,
    "absReturn": 1.8800000000000026
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 679.15,
    "prevClose": 686.19,
    "absReturn": -7.040000000000077
  }
]