[
  {
    "fullTicker": "LTBR:USA",
    "baseTicker": "LTBR",
    "rank": 2.2284,
    "description": "Lightbridge Corporation, together with its subsidiaries, engages in research, developing, and commercializing nuclear fuel. It develops nuclear fuel for water-cooled reactors; and metallic fuels under the Lightbridge Fuel. Lightbridge Corporation is headquartered in Reston, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/HR8PZyC1K0eGfa0izePmyA/pLSec3r1bBdYqGbFlMSHMnkiF66U-UP_b4hOC5LbjoBWZAvMsgNbKx7KHEwZFYxhKzXmw5BDz8Op17eYREohegHGzuY9OlHvQA5jYirlFDMoaWKmb-1hRfIKdbAfMtjdKhq12QhaRwcMJJRR0FTZNFtvQYt8Jl0QGjztYGD5kXMRLEFd_JOPW2OaV3fTwkri/-UxwpzaI8OpssUH2SbUhASS7uT1AbW5m7Bwjf6Wy6XY",
    "price": 12.75,
    "prevClose": 13.07,
    "absReturn": -0.3200000000000003
  },
  {
    "fullTicker": "ADGM:USA",
    "baseTicker": "ADGM",
    "rank": 10.9466,
    "description": "Adagio Medical Holdings, Inc., a developmental stage medical device company, focuses on the development and commercialization of ablation technologies for the treatment of cardiac arrhythmias. It offers treatment for cardiac arrhythmias, including atrial fibrillation, atrial flutter, and ventricular tachycardia. The company's product portfolio includes iCLAS atrial ultra-low temperature cryoablation (ULTC) catheter and accessories; vCLAS ventricular ULTC catheter; and Cryopulse atrial pulsed-field cryoablation catheter and accessories. Adagio Medical Holdings, Inc. was founded in 2011 and is headquartered in Laguna Hills, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/8JRhYdzSIZi0gACSaNApAw/xr1VdR4KXI20lTkT_z9QZMSm_P8pXq1iQHWMET9PR0NTbQu5pC-34DrFHwaiJQHY54QkRWPpuzFNWHDi8qR_tv0dnd0qCjno00T6VoGEvvHutTrCz8xcueuu668FU-kpBOT-1GpSkIIbynBwOL08Wn96WSkYhWa3YYH9W2jJS2QQp41osr8FBXVUV4FCQjly/cB8XhlMdLxSjjFNrVyPW9MRwR3PPSR2KxQ0qtg6z1Sw",
    "price": 0.9832,
    "prevClose": 1.01,
    "absReturn": -0.026800000000000046
  },
  {
    "fullTicker": "AMPL:USA",
    "baseTicker": "AMPL",
    "rank": 20.8523,
    "description": "Amplitude, Inc., together with its subsidiaries, provides a digital analytics platform that analyzes customer behavior in the United States and internationally. It offers Amplitude Analytics, which provides real-time insights into user behavior; Amplitude Session Replay, a tool that offers a qualitative perspective by reconstructing user journeys; Amplitude Feature Experimentation, which enables product, data, and engineering teams to build experiments; Amplitude Web Experimentation, a solution that reduces the need for engineering support and accelerates testing; Amplitude Activation, which resolves identity conflicts, streamlines data integration, and facilitates organizations to personalize and activate campaigns and experiences to segments of users in a few simple clicks; and Amplitude Guides and Surveys that helps companies to deploy in-product guides, tours, and surveys using the power of behavioral insights to fuel great results. The company also provides customer support related to initial implementation setup, ongoing support services, and application training. It delivers its application over the Internet as a subscription service using a software-as-a-service model. The company was formerly known as Sonalight, Inc. and changed its name to Amplitude, Inc. in December 2014. Amplitude, Inc. was incorporated in 2011 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/eI0VogmVxqN3iSvG3MtpOQ/E2I-j7nBOLKji26lu1V7PilzIHK92kN9E_zPHCuRTuQ1cGrM0aW50nGCdfNyLLXCEh3UzWGSWm-f4enx8OkvTPzkLoY-7DFxF7dpQGv61IbCQs1mlj1-cxFhQDh034JRjCqAlmtN18WWnsI8HYhcautYXM9nZ1WK8aOMB7t6MDo/H3UGL3t8js3iCQC-sfF_c_3lcnNOkw1pIPD8YYH9FEE",
    "price": 11.73,
    "prevClose": 11.83,
    "absReturn": -0.09999999999999964
  },
  {
    "fullTicker": "CCO:USA",
    "baseTicker": "CCO",
    "rank": 31.1321,
    "description": "Clear Channel Outdoor Holdings, Inc. operates as an out-of-home advertising company in the United States and Singapore. The company operates in two segments, America and Airports. It provides advertising services through billboards, including bulletins and posters, as well as spectaculars, which are customized display structures with videos, three-dimensional elements and moving parts; street furniture displays, such as advertising surfaces on bus shelters, kiosks, news racks, and other public structures; transit displays in rail stations and on buses, trains, and trams; and wallscapes, as well as advertising solutions to commercial and private airports. The company offers solutions, such as RADARView, an audience and campaign planning tool, which uses historical mobile location data; RADARConnect, a campaign amplification solution that delivers supportive advertisements across mobile and other devices; RADARProof, a campaign measurement and attribution solutions, which analyzes anonymized and/or aggregated data; and RADARSync, a data integration platform designed to enable customized application of the RADAR tools and privacy-compliant sharing of RADAR insights with analytics platforms. The company was formerly known as Eller Media Company and changed its name to Clear Channel Outdoor Holdings, Inc. in August 2005. Clear Channel Outdoor Holdings, Inc. was incorporated in 1995 and is headquartered in San Antonio, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/3k2Vc4eVmovnnyHEaXN0yw/WyU9eLOQKUkeWLTZrAjHLYbKy-8bA2RJXoK4Onzsi4vVQyVxDl6VasYDJboUTpaCjtLWR6DCPuwcUJRZXQz0CypCkfECxDuTUQ1fmBxs4WU89jnX-cyyguOqSll3nEYEkjLsQBJaQgaq7KRd6NkprSfsGJLiIO48Vnjc-226MDt08Sxqrf4hhh6pZsyumPjy16Fd1U-soKwOR1woPdkrPw/w1h_U7MjUw2krx62dooqEkQxVfuJOauBCSA_lNaLadA",
    "price": 2.145,
    "prevClose": 2.15,
    "absReturn": -0.004999999999999893
  },
  {
    "fullTicker": "INTA:USA",
    "baseTicker": "INTA",
    "rank": 32.8725,
    "description": "Intapp, Inc., through its subsidiary, Integration Appliance, Inc., provides AI-powered solutions in the United States, the United Kingdom, and internationally. Its solutions include DealCloud, a deal and relationship management solution that manages client relationships, prospective clients and investments, current engagements and deal processes, and operations and compliance activities; compliance solutions, that help firms thoroughly evaluate new business, onboard clients quickly, and monitor relationships for risk throughout their business lifecycle; time solutions provides AI-enabled software solutions includes time management software that accelerates billing, enhances realization, and experience for the firm's clients; collaboration solutions offers intelligent client-centric collaboration, seamless content governance, and client experiences leveraging Microsoft 365, Teams, and SharePoint; integration solutions that connects firm data into a single platform, tailored to the needs of professional, and financial services firms, as well as solutions that extend the value of our platform with third-party data; and Assist, that leverages the unique client data in the Intapp intelligent cloud and applies generative AI to power business development, reduce manual work, and help professionals make better-informed and faster decisions. The company also operates technology platforms , such as cloud-based architecture, low-code configurability and personalized UX, applied AI, and industry-specific data architecture. It serves private capital, investment banking, legal, accounting, and consulting firms. The company sells its software on a subscription basis through a direct enterprise sales model. The company was formerly known as LegalApp Holdings, Inc. and changed its name to Intapp, Inc. in February 2021. Intapp, Inc. was founded in 2000 and is headquartered in Palo Alto, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/jGG8mYty-TX7q_Hm1tNHjg/T_wpj1JzXeqXo6m_WO0BQ9uXHrLx0QbwQmC06dWha_iW8Uz_EDZ0glHjrlALorj9yzM5B784M1i_uJHgdOCTE_L_YYjVq0X5A2OmWaQHh3Q0FwqetXrFyyVRJoracamS4GJdCIuz1r41CZ3pzQVrUC3o-sZaBR3a22Hg2Tv_Syg/qD2x-GU-56L_nT0VM6lZegHIDEZSKMB9yFeFbrQ_RWc",
    "price": 46.5,
    "prevClose": 47.52,
    "absReturn": -1.0200000000000031
  },
  {
    "fullTicker": "PRCH:USA",
    "baseTicker": "PRCH",
    "rank": 47.3975,
    "description": "Porch Group, Inc., together with its subsidiaries, operates a vertical software and insurance platform in the United States. The company operates in home-related product and service industries, including insurance, mortgage software, title insurance software, warranty, moving services, inspection software, home repair, and marketing, financial, and other software for home services companies. It also provides insurance and warranty products to protect their homes; and property-related insurance, whole-home, 90-day, service line, and extended labor warranties under the Porch Warranty, American Home Protect, and Residential Warranty Services brands. In addition, the company offers software and services to inspection, mortgage, and title companies on a subscription and transactional basis, as well as move and post-move services. Further, it provides inspection software and services, mortgage software, moving services, mover and homeowner marketing, and measurement software for roofers. The company was founded in 2011 and is headquartered in Seattle, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/NrStXNRS909_R97ec0jLLQ/BKb1MUFzA42E6QY-Xgw-lEhdZp4znqzvF9JYYjCPHozwNjWKGkNedbfcCIf1w6qDZtwAO2hU_kvM7Uy2wVACb2V7ogt-2fjuUnDTGnOICYwvrUJuZPEsBOBSqX7WTXBU18SjNbH8lxHf6W0iXGVr4DUfZ-6yIYonpIK7ROkXunpGWMYQqYlhUfhMgmZs8l3T/nBSo1pNK-J1jZdhj6t-NU8DYYrxA6FPeZ1mLWSS2pC0",
    "price": 9.015,
    "prevClose": 9.12,
    "absReturn": -0.10499999999999865
  },
  {
    "fullTicker": "TRUP:USA",
    "baseTicker": "TRUP",
    "rank": 65.6636,
    "description": "Trupanion, Inc., together with its subsidiaries, provides medical insurance for cats and dogs on subscription basis in the United States, Canada, Continental Europe, and Australia. The company operates in two segments, Subscription Business and Other Business. It serves pet owners and veterinarians. The company was formerly known as Vetinsurance International, Inc. changed its name to Trupanion, Inc. in 2013. The company was founded in 2000 and is headquartered in Seattle, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/8c_aYDGCJUej6-cAvcxKRg/txiJ5RNU2PKZo6Uyg8tdCryP2AQQEvWWqfhm2zc00-XM4Y_Blyr23z8ui1xWP3rMNLMy_B4g_ecCq-DzjQs3Akk6ELaJviVQBl-zpVKXpuFaNDUllcY_hlFBhUi-fC5RKqiqUIZpNBOcqRpEjFzDjTpCBUDCpm2Gr0IAQ41KAfI/4F3z1094QKlbNk3jDei66s61W99UzcvQ72Ms5HgzMuM",
    "price": 38.235,
    "prevClose": 37.74,
    "absReturn": 0.49499999999999744
  },
  {
    "fullTicker": "GGG:USA",
    "baseTicker": "GGG",
    "rank": 69.1119,
    "description": "Graco Inc. designs, manufactures, and markets systems and equipment used to move, measure, mix, control, dispense, and spray fluid and powder materials in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The Contractor segment provides sprayers to apply paint to walls and other structures; two-component proportioning systems to spray polyurethane foam and polyurea coatings; viscous coatings to roofs, markings on roads, parking lots, athletic fields, and floors; and high-performance volumetric and gravimetric dispense, mixing, and shaking equipment. The Industrial segment offers paint circulating and supply pumps, paint circulating advanced control systems, and plural component coating proportioners; various accessories to filter, transport, agitate, and regulate fluid; spare parts, including spray tips, seals and filter screens; equipment for industrial customers that pumps, meters, mixes, and dispenses sealant, adhesive, and composite materials; gel-coat equipment, chop and wet-out systems, resin transfer molding systems and applicators, and precision dispensing solutions; and powder finishing products and systems that coat powder on metals under the Gema and SAT brands. The Process segment provides pumps, valves, meters, and accessories to move and dispense chemicals, oil and natural gas, water, wastewater, petroleum, food, lubricants, and other fluids; and systems, components, and accessories for the automatic lubrication of bearings, gears, and generators. This segment also offers pumps, hose reels, meters, valves and accessories for use by fast oil change facilities, service garages, fleet service centers, automobile dealerships, auto parts stores, truck builders, and heavy equipment service centers; high pressure and ultra-high pressure valves; and chemical injection pumping solutions for precise injection of chemicals. Graco Inc. was incorporated in 1926 and is headquartered in Minneapolis, Minnesota.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/ROezAlJN7J24mxLHZ0lyZA/sSCofQESmbRzRdh-hbp5iSkPM4BcmcqHx39kVbh6_avHbwoPJcVE43_OvmoP9fXa9cXDIQmplmlFZYPnN79dA37PuN_LRgLfh-brQP5JhE31OV7zfp2tW0L_FvDnOCHYMRX7uAY0A14Bku-sP7SjUQAFTcuGjtDwaibVaPtv5Kc/ycqbUG8eUyw37BYj4ggvfMwMBURkH65Brw5BOamN1KE",
    "price": 83.055,
    "prevClose": 83.26,
    "absReturn": -0.2049999999999983
  },
  {
    "fullTicker": "DBI:USA",
    "baseTicker": "DBI",
    "rank": 81.6038,
    "description": "Designer Brands Inc., together with its subsidiaries, engages in the design, production, and retailing of footwear and accessories in the United States and Canada. It operates through three segments: U.S. Retail, Canada Retail, and Brand Portfolio. The company offers dress, casual, and athletic footwear and accessories, as well as handbags for women, men, and kids. It sells its products under the Vince Camuto, Keds, Topo, as well as Jessica Simpson, Lucky Brand, Le Tigre, and Hush Puppies brands. The company offers its products through its direct-to-consumer stores and e-commerce sites; and a portfolio of banners, including DSW Designer Shoe Warehouse, The Shoe Co, and Rubino; and mobiles applications. The company was founded in 1991 and is based in Columbus, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/-SkCfI0q2mLoQygwZVS0rg/mg34szw5Omh8fgl9RC7EWREAXMu4QagEUVbP4tBnJoSd5SXVzdjpFv_ft3jCDfuLhy3Qo5Y03nj19-ZtHhPN9cB9jqsQHz44LL4NArVDo6AyLAEwGs1LPt1rD-Dsr9rkd8EaiAUxqEIsgHi9yGVeGH9z7RDneHV1vkKF3OHAnlybAcgFamlN1h9D2Y98mZ9f/jo93mI_PSk8hYv0iSIm5ednVtcOhdFVoOgipH7x3GFo",
    "price": 7.99,
    "prevClose": 7.82,
    "absReturn": 0.16999999999999993
  },
  {
    "fullTicker": "ALNT:USA",
    "baseTicker": "ALNT",
    "rank": 91.054,
    "description": "Allient Inc., together with its subsidiaries, designs, manufactures, and sells precision and specialty-controlled motion components and systems for various industries in the United States, Canada, South America, Europe, and the Asia-Pacific. The company offers brushed and brushless DC motors, brushless servo and torque motors, coreless DC motors, integrated brushless motor-drives, gearmotors, gearing, modular digital servo drives, motion controllers, optical encoders, active and passive filters, input/output modules, industrial communications gateways, light-weighting technologies, and other controlled motion-related products, as well as nano precision positioning systems, servo control systems, and digital servo amplifiers and drives. It sells its products to end customers and original equipment manufacturers in vehicle, medical, aerospace and defense, and industrial markets through direct sales force, authorized manufacturers' representatives, and distributors. The company was formerly known as Allied Motion Technologies Inc. and changed its name to Allient Inc. in August 2023. Allient Inc. was founded in 1939 and is headquartered in Amherst, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1767139200000/M82hQZIWFSXgDoQRgTEgCA/OADFxYiDPpP61LY_tXjpilXyJ3f21yK-4LEfZtlbxYxbaTh_gph8zt04n3PhiPTxFEBYfbU9d9SzNFrcWbRBHl-nv_C7-HUhsZCPCld78nJOHn9lyM_mpYJQLhwhgQO5uIcJd0ZqR9qfv9FSRdz0x65JM5ntc5xlmjhtJtO6AaU/tLCxUd7RpHVU-w1VVYBzjokehfdF5KslyYfi58IxDzk",
    "price": 53.96,
    "prevClose": 55.45,
    "absReturn": -1.490000000000002
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 686.95,
    "prevClose": 687.85,
    "absReturn": -0.8999999999999773
  }
]