[
  {
    "fullTicker": "IRIX:USA",
    "baseTicker": "IRIX",
    "rank": 76.4647,
    "description": "IRIDEX Corporation, an ophthalmic medical technology company, provides therapeutic based laser systems, delivery devices, and consumable instrumentation to treat sight-threatening eye diseases in ophthalmology. It offers laser consoles, such as Cyclo G6 laser system for use in the treatment of glaucoma; IQ 532 and IQ 577 laser systems, which are used for the treatment of retinal disorders; and OcuLight TX, OcuLight SL, OcuLight SLx, OcuLight GL, and OcuLight GLx laser photocoagulation systems that are used to treat proliferative diabetic retinopathy, macular holes, retinal tears, and detachments. The company also provides delivery devices, including TxCell scanning laser delivery system that allows the physician to perform multi-spot pattern scanning; slit lamp adapter, which allows the physician to utilize a standard slit lamp in diagnosis and treatment procedures; and laser indirect ophthalmoscope for use in procedures to treat peripheral retinal disorders. It offers MicroPulse P3 Probe, which is used with its Cylco G6 laser system to perform MicroPulse transscleral laser therapy; G-Probe, which is used in procedures to treat uncontrolled glaucoma; G-Probe and G-Probe Illuminate, which are used in procedures to treat refractory glaucoma; and EndoProbe family of products for use in vitrectomy procedures. The company serves ophthalmologists, research and teaching hospitals, government installations, surgical centers, hospitals, veterinary practices, and office clinics. It markets its products through direct and independent sales force in the United States, as well as through independent distributors internationally. The company was formerly known as IRIS Medical Instruments, Inc. and changed its name to IRIDEX Corporation in November 1995. IRIDEX Corporation was incorporated in 1989 and is headquartered in Mountain View, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/xovHAKoWkIa4x232KP0mmg/rER2r7OVF9ODwPqzVxGI4wjO_4KsjdMgvzvnoLlaR4BVSkG3HVcGibu5n_gy2iaploJrgbOZG1YRkChsUhaYP0tWSP6tGTWyv0aVj068qpYXOEpeV9pq_jSUd-8ORMU7TStIkpvozgUur4PPCxhuTB3oPVoMgX383LlqmwnmrOI/3NGtFTc_geZOMxRpn1ySZJXJRhyI2jF_jqg8sM8eMTo",
    "price": 1.28,
    "prevClose": 1.32,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "UNF:USA",
    "baseTicker": "UNF",
    "rank": 78.512,
    "description": "UniFirst Corporation provides workplace uniforms and protective work wear clothing in the United States, Europe, and Canada. The company operates through United States and Canadian Rental and Cleaning; Manufacturing; Specialty Garments Rental and Cleaning; and First Aid segments. It designs, manufactures, personalizes, rents, cleans, delivers, and sells various uniforms and protective clothing, including shirts, pants, jackets, coveralls, lab coats, smocks, and aprons; and specialized protective wear, such as flame resistant and high visibility garments. The company also rents and sells industrial wiping products, floor mats, facility management and service products, and dry and wet mops; restroom and cleaning supplies comprising air fresheners, paper products, gloves, masks, sanitizers, and hand soaps; and other textile products. In addition, it provides first aid cabinet services and other safety supplies; decontaminates and cleans work clothes, and other items that is exposed to radioactive materials; and services special cleanroom protective wear and facilities. Further, it offers a garment service options, including full-service rental programs, lease programs, and purchase programs; and safety training to a various manufacturers, retailers and service companies. The company serves automobile service centers and dealers, delivery services, food and general merchandise retailers, manufacturers, maintenance facilities, restaurants and food-related businesses, business service providers, soft and durable goods wholesalers, transportation and warehousing companies, healthcare providers, energy production, and transmission operations, government agencies, research and development laboratories, high technology companies, cleanroom operators, and utilities operating nuclear reactors, as well as other employee clothing for image, identification, protection, or utility purposes. The company was founded in 1936 and is headquartered in Wilmington, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/cXvps2CZHQErSls-lR1p6Q/kO7ZMIjMXvywl8-twa-FdDZn7mD9OYo6vAokYasm27W6CAa9cJGwFkweu9v-KVE_8Lokb2fHqbm_dqnNDNRmNRpiWSJOH5SIBiAaq-DYxZsRDU5VjcVy43pGp31hi5usaTRrkEPhcMHYx6tCbHyLxkAovXrqIIk_4MZhFJ-d6Ec/pKh9Ym0xEl2XxBsqralq_ywd5xer9yEF89Q-BoRmKLk",
    "price": 169.98,
    "prevClose": 171.03,
    "absReturn": -1.0500000000000114
  },
  {
    "fullTicker": "BHC:USA",
    "baseTicker": "BHC",
    "rank": 80.9254,
    "description": "Bausch Health Companies Inc. operates as a diversified specialty pharmaceutical and medical device company, develops, manufactures, and markets a range of products primarily in gastroenterology, hepatology, neurology, dermatology, generic pharmaceuticals, over-the-counter (OTC) products, aesthetic medical devices, and eye health in the United States and internationally. The company operates through five segments: Salix, International, Solta Medical, Diversified, and Bausch + Lomb. The Salix segment provides gastroenterology products. The International segment sells aesthetic medical devices, branded pharmaceuticals, generic pharmaceuticals, and OTC products. The Solta Medical segment engages in the sale of aesthetic medical devices. The Diversified segment offers pharmaceutical products in the areas of neurology and certain other therapeutic classes; dermatology products; generic pharmaceutical products; and dentistry products. The Bausch + Lomb segment offers products in the areas of vision care, surgical, and ophthalmic pharmaceuticals products. The company was formerly known as Valeant Pharmaceuticals International, Inc. and changed its name to Bausch Health Companies Inc. in July 2018. Bausch Health Companies Inc. is headquartered in Laval, Canada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/P6MU8oNI8HAO40rm4Gysbg/5j1Z7OZVzMVo-YHy_rZNmkMRX3QPqE93NZICQs-QCE6fGFYtSwi0PdKY964Qc33rfT9sdkjOGYfbfoYzxEbXBmb39TmNIm2d3bV8smjSE2nnufs3DAAdyGMOeCXU_bJIKvv1OiZ37NA3DS8kDD3HJbnCdWOu3ylAPoXudra-nYNFYh-7vaFzw4vJsI7_nOSh/JWYEXjnjyEoj7ggIjiXgfIycMBNpW1UVlh4XVXc7k-4",
    "price": 5.71,
    "prevClose": 5.89,
    "absReturn": -0.17999999999999972
  },
  {
    "fullTicker": "EML:USA",
    "baseTicker": "EML",
    "rank": 83.6052,
    "description": "The Eastern Company designs, manufactures, and sells engineered solutions to industrial markets in the United States and internationally. The company offers turnkey returnable packaging solutions, which are used in the assembly processes of vehicles, aircraft, and durable goods, as well as in production processes of plastic packaging products, packaged consumer goods, and pharmaceuticals; designs and manufactures blow mold tools and injection blow mold tooling products, and 2-step stretch blow molds and related components for the stretch blow molding industry; and supplies blow molds and change parts to the food, beverage, healthcare, and chemical industries. It also provides rotary latches, compression latches, draw latches, hinges, camlocks, key switches, padlocks, and handles; and development and program management services for custom electromechanical and mechanical systems for original equipment manufacturers (OEM) and customer applications. In addition, the company designs and manufactures proprietary vision technology for OEMs and aftermarket applications, as well as offers aftermarket components to the heavy- and medium-duty truck, motorhome, and bus markets. The Eastern Company was founded in 1858 and is based in Shelton, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/rDdQSno5VsqSFn6OZqy6Hg/NAwhyTZU4YT5RQByqTDNE_o6Xj8A91Xf9G_EvWkfCSXfjJGaHksQOjGSorfT78Zy927z26adatDekLAf6emOcqOKck0h0BjMY1Mj0e3Ol6EKKcuE6wD-NBujwPZisPboNfmML3oRGcVK3ie0RDUq0FnD2YMnuK1oEatuimKl-iEVUtVISqbgZEAkHt3KRVaf/J27pDwshOA03V5OjV58c28N-oGxdcUq-SFc6psvLMJU",
    "price": 22.03,
    "prevClose": 23.05,
    "absReturn": -1.0199999999999996
  },
  {
    "fullTicker": "CURI:USA",
    "baseTicker": "CURI",
    "rank": 85.3695,
    "description": "CuriosityStream Inc. operates as a factual content streaming service and media company. The company provides premium video and audio programming services in various categories of factual entertainment, including science, history, society, nature, lifestyle, and technology through direct subscription video on-demand (SVoD) platforms accessible by internet connected devices, or indirectly via distribution partners who deliver CuriosityStream content via distributor's platform or system, as well as through bundled content licenses for SVoD and linear offerings, talks and courses, and partner bulk sales. It offers streaming content through devices, including televisions, set-top boxes, computers, streaming media players, game consoles, and mobile devices. The company was founded in 2015 and is based in Silver Spring, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/wNBLhoogsTF5dXcMNsnaKA/Yh-pZbJ_MXc7oHi3S3Cy9UrS1RECTCXkqvknTNyyildbw-xAtsIdtClo60JVlNq48cBLsoIzu64oST0TLcbr0VgCE327vyLHlLk76wSNxr1NlkhhdJqI9PZlrnwGyGj2LphlK9w_MVT_tOURABN4kaPZG81VSln0RZ7m0Qa6fGwLi8vBvCd7A7QIUZG1CBDF/PlTNvIAfWp501xecIe6nfeD37wzoBj_AS6LaTU27LFI",
    "price": 4.7,
    "prevClose": 4.85,
    "absReturn": -0.14999999999999947
  },
  {
    "fullTicker": "RELL:USA",
    "baseTicker": "RELL",
    "rank": 87.1172,
    "description": "Richardson Electronics, Ltd. engages in the provision of engineered solutions, power grid and microwave tube, and related consumables worldwide. The Power and Microwave Technologies segment manufactures electron tubes and radio frequency (RF), microwave and power components used in semiconductor manufacturing equipment, RF, and wireless and industrial power applications, as well as various applications including broadcast transmission, CO2 laser cutting, diagnostic imaging, dielectric and induction heating, energy transfer, high voltage switching, plasma, power conversion, radar, and radiation oncology. This segment also provides thyratrons and rectifiers, power tubes, ignitrons, magnetrons, phototubes, microwave generators, ultracapacitor modules, and liquid crystal display monitors under the Amperex, Cetron, and National brands. The Green Energy Solutions segment offers design-in support, systems integration, prototype design and manufacturing, testing, logistics and aftermarket, and technical service and repair services for various applications, such as wind, solar, hydrogen, and electric vehicles; and other power management applications that support green solutions including synthetic diamond manufacturing. The Canvys segment provides custom display solutions, which includes touch screens, protective panels, custom enclosures, All-In-One computers, specialized cabinet finishes and application specific software packages, and certification services. The Healthcare segment provides diagnostic imaging replacement parts for CT and MRI systems, replacement CT and MRI tubes, CT service training, MRI and RF amplifiers, hydrogen thyratrons, klystrons, magnetrons, flat panel detector upgrades, pre-owned CT systems, and additional replacement solutions. It serves energy, healthcare, aviation, broadcast, communications, industrial, marine, medical, military, scientific, and semiconductor markets. The company was founded in 1947 and is headquartered in LaFox, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/1d99bXr4waOQ6q5DWQ4gog/05_5UznvfTvjGfCgCIflwhz3l0O-73V0iSRBrXLhvgNS4BHdLf3FlL0k3ouxwebauK2HtcWn8pOGQ2j4vUyRs2TJFEsLJcO_JPf_9Mx52ZM3soOIcxWnO-ddG4ziKzG9fUgb7rqh8nsUEIlInYP1Xs-hs3KNGXe3Q1Gjklxdh0Hv9yvRmK2km8BqEuEPgjgi/JVXj4ZgJAf7nUVk9d2U8Tj2VX4McoHYbdfRu5VAN-Tg",
    "price": 9.66,
    "prevClose": 10.08,
    "absReturn": -0.41999999999999993
  },
  {
    "fullTicker": "QCOM:USA",
    "baseTicker": "QCOM",
    "rank": 89.8635,
    "description": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/m-UDSIhs4GlQ4C7AYcYBZw/yAOcusXOct7PHLa8hYFOobTDQWfnLw9-Uxc71NRGTiQQXtHeEvLE_39v6El1qP4x6SE74Q5QXg3WjuubZmKlS67bg_drxFQG_CQdwPy-oFvenrY5yWGlnReq3NIsp_DUJclluPT_SMJwuEdNzA9WVHjDgZkLI4qLYv2cc_xZjvrHqrmY5p9dqnP4VfzL_l0i/pXf7QDEoja7ukFGVROPJUkpEVZsNqI8-douw5-HpoCA",
    "price": 148.19,
    "prevClose": 146.76,
    "absReturn": 1.4300000000000068
  },
  {
    "fullTicker": "AVAH:USA",
    "baseTicker": "AVAH",
    "rank": 91.8775,
    "description": "Aveanna Healthcare Holdings Inc., a diversified home care platform company, provides pediatric and adult healthcare services in the United States. Its patient-centered care delivery platform allows patients to remain in their homes and minimizes the overutilization of high-cost care settings, such as hospitals or skilled nursing facilities. The company operates through three segments: Private Duty Services (PDS), Home Health & Hospice (HHH), and Medical Solutions (MS). The PDS segment offers private duty nursing (PDN) services, which include in-home skilled nursing services to medically fragile children and adults; nursing services in school settings in which its caregivers accompany patients to school; services to patients in its pediatric day healthcare centers; and non-clinical care, including support services and personal care services; and in-clinic and home-based therapy services, such as physical, occupational, and speech services. The HHH segment provides home health services, including in-home skilled nursing services; physical, occupational, and speech therapy services; and medical social and aide services, as well as hospice services for patients and their families when a life-limiting illness no longer responds to cure-oriented treatments. The MS segment offers enteral nutrition supplies and other products, including formulas, supplies, and pumps to adults and children delivered on a periodic or as-needed basis. The company was incorporated in 2016 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/iZCVoT8FYgXjKPMPkJFakQ/n_HOOZPO4qbuh1akvsbN_kys9EEebeNjsf04CRsf0GCBvQ_2oTYzGseJ1RjVDDmGgcALflXp5kKZI52mWfqusmR6eMPr4ReRvARKr-GljmhUm9G_mN4qa6UBsfcqFdNIMLIoYk5og956-dbca3qjmL2jLt13SY31xT2TyidryDgHCB_DJavqIh6wRPtPsUHw/c7BQf-dhri-UH_kwPlb3k4T0dK2b_0eM-ylTX5dmcsA",
    "price": 3.74,
    "prevClose": 3.97,
    "absReturn": -0.22999999999999998
  },
  {
    "fullTicker": "THG:USA",
    "baseTicker": "THG",
    "rank": 95.8056,
    "description": "The Hanover Insurance Group, Inc., through its subsidiaries, provides various property and casualty insurance products and services in the United States. The company operates through four segments: Core Commercial, Specialty, Personal Lines, and Other. It offers commercial multiple peril, workers' compensation, commercial automobile, and other commercial lines coverage; and professional and executive lines, marine, and surety and other, as well as specialty property and casualty comprising Hanover program business, excess and surplus business, Hanover specialty industrial, and specialty general liability business coverage. The company also provides personal automobile; and homeowners and other personal lines, including residences and personal property, liability claims, personal umbrella, inland marine, fire, personal watercraft, personal cyber, and other miscellaneous coverages. It markets its products and services through independent agents and brokers. The company was formerly known as Allmerica Financial Corp. and changed its name to The Hanover Insurance Group, Inc. in December 2005. The Hanover Insurance Group, Inc. was founded in 1852 and is headquartered in Worcester, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/lD2PONRvG4KQ7aJfik4tag/Oc9CJZI4OWNJBY0Y2RGdrIxyL3XZmqymF4-HttADVHfSzu87tDaR7R-6imXHxDbdQ96nncNPJhNHvDU_1Y0MZkaBwwksWZn_YtH62fBCNhYJHxTKWxIcKm5Hg5gn2BCj8gGdJoSMfV0gjR7RfsH9y1CKXspBjlXK4x2mp283sYx8C_ZEbgQEQsvN7ZQRg2ZcUNkgP09pkOM953OFegFF5w/tnJGwOvQl4nskEWtQIizOjRI5Wug4aXJDksyROf8rZ4",
    "price": 168.83,
    "prevClose": 171.63,
    "absReturn": -2.799999999999983
  },
  {
    "fullTicker": "BKTI:USA",
    "baseTicker": "BKTI",
    "rank": 96.6212,
    "description": "BK Technologies Corporation, through its subsidiary, BK Technologies, Inc., engages in design, manufacture, and markets wireless communications products in the United States and internationally. The company offers two-way land mobile radios (LMR) that are hand-held (portable) or installed in vehicles (mobile). It offers KNG Series and BKR Series radios that operate in both the P25 digital and analog modes which are used primarily in government, public safety, and military applications; and BK radio products for intellectual property applications. The company's KNG and BKR-branded products serves government markets, including emergency response, public safety, homeland security and military customers of federal, and state and municipal government agencies, as well as various industrial and commercial enterprises. In addition, it provides InteropONE, a Push-to-Talk-Over-Cellular (PTTOC) SaaS service, that provides emergency incident commanders to establish group PTTOC between smartphone users directly from their smartphone. The company was incorporated in 1997 and is based in West Melbourne, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/43/43/1754316000000/dzWR0UY_WEOB-ko7-u1qmA/MtShj4pF_7pvcaZeeRMXSK8U_J0uojwwilgZbqsDhpK0VvEki_t5_VDAeKxj41E2rYBlhWw8Bm525FM4c11A1cyZzLOhybuXmMEYEUgeRPN0rVJO8bWPEEO-krRQzpBt8eg15G-Y1T5UpNpXG5NtsgEnIe6cvXzt1TKeJ_5GoVPNmI7ju_GaItQ_hIRDzkBN/e7k2WEQQIDpz_mv-Qu1vBXrc4IAIKCEwXPL8lY0cayM",
    "price": 37.62,
    "prevClose": 38.84,
    "absReturn": -1.220000000000006
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 621.72,
    "prevClose": 632.08,
    "absReturn": -10.360000000000014
  }
]