[
  {
    "fullTicker": "HSDT:USA",
    "baseTicker": "HSDT",
    "rank": 4.5322,
    "description": "Helius Medical Technologies, Inc., a neurotechnology company, focuses on developing, licensing, and acquiring non-implantable technologies for the treatment of symptoms caused by neurological disease or trauma. The company's product is Portable Neuromodulation Stimulator, a non-surgical medical device intended for use as a short term treatment of gait deficit due to symptoms from multiple sclerosis and balance deficit due to mild-to-moderate traumatic brain injury, as well as to be used in conjunction with supervised therapeutic exercise. Helius Medical Technologies, Inc. was incorporated in 2014 and is headquartered in Newtown, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/JyXdiMEdBUdD7IwDCu-8qg/P273AKms-rPOF4fAYxNViLRXG0gliZUo98vkByRsWeVg7xciCsnJoOIyw-RNSx6rhrVgGwIDsRzFQcz2n3SjRC72FPovvJPF_gpYNbezKi66STYdYCOhrYAHeKo62cqWt-uC-EFG2C1RApco_9fEx4lRMRLFOdb4XOuGdlSEiL-dEtr_DiHB4wXSpVgVvJQyI0H1Ry2GFOdeUBRNp-CK_w/QiV62LjgWSY4_9V3aOg5KK6mnjNx4pUUtbfSJXrRz3E",
    "price": 2.07,
    "prevClose": 2.21,
    "absReturn": -0.14000000000000012
  },
  {
    "fullTicker": "HIMS:USA",
    "baseTicker": "HIMS",
    "rank": 12.1507,
    "description": "Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, cosmetics, and supplement products primarily focusing on general wellness, sexual health and wellness, skincare, and hair care. In addition, the company's curated non-prescription products include melatonin and biotin in the wellness specialty category; moisturizers, creams, sunscreen, serum, face oil, and face wash in the skincare specialty; condoms, climax delay spray and wipes, vibrators, and lubricants in the sexual health and wellness specialty; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care specialty category. Further, it offers medical consultation and post-consultation support services, as well as health and wellness products through wholesale partners. Hims & Hers Health, Inc. is based in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/BkARA7f8kjZc1G763gpAJg/7wgSPa4OFV3dhZSxxe8bdnbY2d8kmZGLLQxpPPbwrHcUq7GYiLYZewy08Jr0yKRfqQ6aHQix6rEHvNSmpVGs7HQvam9OOH2acFv_iFX0xaqqxeoHIgTY-41gCOiwnvTfGAJWTR1i5GJtVA-raVEUxZcEcx4SJjANQzn506yj9rW7RTnQ37FGYiTVY0_nEayO/xdBhlWX0v4sv6SeLaukzqshVz9n8UCdl7lLN0QlnIdA",
    "price": 16.04,
    "prevClose": 16.3,
    "absReturn": -0.26000000000000156
  },
  {
    "fullTicker": "IMNN:USA",
    "baseTicker": "IMNN",
    "rank": 21.1826,
    "description": "Imunon, Inc., a clinical-stage biotechnology company, develops immunotherapies and next-generation vaccines. The company's lead clinical program IMNN-001, a DNA-based immunotherapy for the localized treatment of ovarian cancer that is in Phase II clinical development. Its preclinical stage products include IMNN-101, a COVID-19 booster vaccine; IMNN-102 for the treatment of Lassa virus; and IMNN-201, a Trp2 tumor associated antigen cancer vaccine in melanoma. In addition, the company develops non-viral DNA technology across four modalities, such as TheraPlas for the coding of proteins and cytokines in the treatment of solid tumors; and PlaCCine for the coding of viral antigens that can elicit a strong immunological response. Imunon, Inc. was formerly known as Celsion Corporation and changed its name to Imunon, Inc. in September 2022. The company was founded in 1982 and is headquartered in Lawrenceville, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/xM-1joj7cc6GUwbTj_MY-Q/k32B4xSfDxTcBt2wX78Hlal5yhD-GFq8kCu5qBHIB6Rm1JdbE-qssm8PpvQ8NPaq6nD3E8YQOZX7tXxJoBbMR5wnCHWuL4-3oUpD3GLINhMFYiLTJByFzE4pOjmrKD3JcDb3iNKrIxUcfdemhN9xNaG9gd1M2rdt04cl6GzfIMI/qJtZv_Zidfs8zDpO0tZi4sSJGFPgipVzUqyqj8eUppQ",
    "price": 3.25,
    "prevClose": 3.27,
    "absReturn": -0.020000000000000018
  },
  {
    "fullTicker": "ADPT:USA",
    "baseTicker": "ADPT",
    "rank": 23.603,
    "description": "Adaptive Biotechnologies Corporation, a commercial-stage company, develops an immune medicine platform for the diagnosis and treatment of various diseases. The company offers immunosequencing platform which combines a suite of proprietary chemistry, computational biology, and machine learning to generate clinical immunomics data to decode the adaptive immune system. It also provides clonoSEQ diagnostic test which detects and monitors the remaining number of cancer cells that are present in a patient's body during and after treatment, known as Minimal Residual Disease (MRD). The company offers products and services for life sciences research, clinical diagnostics, and drug discovery applications. It has strategic collaborations with Genentech, Inc. for the development, manufacture, and commercialization of neoantigen directed T cell therapies for the treatment of a range of cancers. The company was formerly known as Adaptive TCR Corporation and changed its name to Adaptive Biotechnologies Corporation in December 2011. Adaptive Biotechnologies Corporation was incorporated in 2009 and is headquartered in Seattle, Washington.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/eM5UBArk7vVN-jMdLWre9w/djpUC7VzOozGknqR2pzqPR_4GsEp95siC7mDB9QL7ue8Vbrthj85tug_fnlPfFcs6IzM_DU9c9MI_0iiXDMt6gtl1kvA7308E1m60lVh5Js1VxdSY4GbGD6DzezDVMWYd0adX600BzzpVvOdH7DhrePDJ0V_NKoSVFjYkACocH8HtjsRXAozgSFrYkjWyxLc/YDjZt2j1EAPIlnqNyYNB6njv7-nMfquo8ddDDOidQYY",
    "price": 15.985,
    "prevClose": 16.04,
    "absReturn": -0.054999999999999716
  },
  {
    "fullTicker": "TARS:USA",
    "baseTicker": "TARS",
    "rank": 36.6309,
    "description": "Tarsus Pharmaceuticals, Inc., a commercial stage biopharmaceutical company, focuses on the development and commercialization of therapeutic candidates for eye care in the United States. The company's lead product candidate is XDEMVY, a novel therapeutic for the treatment of blepharitis caused by the infestation of Demodex mites, as well as to treat meibomian gland disease. It is also developing TP-04 for the treatment of Ocular Rosacea; TP-05 for potential Lyme disease prophylaxis; and community malaria reduction. In addition, the company develops lotilaner active pharmaceutical ingredient (API) to address diseases in human medicine, including eye care and infectious disease prevention. Tarsus Pharmaceuticals, Inc. was incorporated in 2016 and is headquartered in Irvine, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/pRzPuAP5q-rg4QIh8IchWg/CDHfSktMiSANPHY9dWWuPlPEDTnjxzZqtjpswMVomorTDAtbG8U0jFygM5-ii3Qcey5c9wDft_lrJUktHVyhqGaYLebsy18j4wqbFvBmkrwyuC0xQHHQKAbJOq515jfWKAXxGap6IRyauVMn1nHVnck1BhiFbIuCAhHPBfJevbvLlWqDEam5_NeDQ4Y9dsmx/hhsJ_gw4wyVCPIZ-HK92tKb4AmqUcxQNb9jOqfmojAg",
    "price": 61.99,
    "prevClose": 60.78,
    "absReturn": 1.2100000000000009
  },
  {
    "fullTicker": "FC:USA",
    "baseTicker": "FC",
    "rank": 44.3957,
    "description": "Franklin Covey Co. provides training and consulting services in the areas of execution, sales performance, productivity, customer loyalty, leadership, and educational improvement for organizations and individuals worldwide. The company operates through Direct Offices, International Licensees, and Education Practice segments. It also provides a suite of individual-effectiveness and leadership-development training and products. In addition, the company operates internet-based platforms, including All Access Pass and Leader in Me that offers training days and training course materials. Further, it offers individual-effectiveness and leadership-development training content solutions, such as The 7 Habits of Highly Effective People, The Speed of Trust, Multipliers, The 4 Disciplines of Execution, and Trust & Inspire. Franklin Covey Co. was incorporated in 1983 and is headquartered in Salt Lake City, Utah.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/Uumuw5LU37JAOlFafB2OUw/uDLv-XBE-1Q_2c42JLddN0BUrxDzd9RJkTweCBG0Fj0W_kuhS7gaz-T8EnYPf8dSHhyFiAqLsYIKBBMEQa1BYqSf8qLL1ESg3E4DUEL8Pw5LPvQjTPEawSkEp17D5JRXiUquu1hQRDgN1y4xGSV_d6V2n6Jo-KRDP-TmntjLVI3C-VhOqOIOTj71Y0k3Z8Yp/UArv-M_S7ZU_B9SP-JeZYODHxTVe5QvoBBJaY1ZNdFI",
    "price": 17.59,
    "prevClose": 17.76,
    "absReturn": -0.1700000000000017
  },
  {
    "fullTicker": "DLHC:USA",
    "baseTicker": "DLHC",
    "rank": 64.9123,
    "description": "DLH Holdings Corp. provides technology-enabled business process outsourcing, program management solutions, and public health research and analytics services in the United States. It offers digital transformation and cyber security solutions, including artificial intelligence and machine learning, cloud enablement, cybersecurity ecosystem, big data analytics, and modeling and simulation to the National Institutes of Health (NIH), the Defense Health Agency, Tele-medicine and Advanced Technology Research Center, and US Navy Naval Information Warfare Center (NIWC). The company also provides science research and development services and solutions, such as data analytics, testing and evaluation, clinical trials research services, and epidemiology studies to support multiple operating divisions, including NIH and the Center for Disease Control and Prevention, as well as the Military Health System. In addition, it offers system engineering and integration solutions in the areas of pharmaceutical delivery logistics, fire protection engineering, biomedical equipment, and technology engineering on behalf of the Department of Veterans Affairs, NIWC, Health and Human Services, and other federal customers. The company also provides business process management services under the trademarks, e-PRAT and SPOT-m, as well as the registered trademark, Infinibyte for cloud-based solutions. The company was formerly known as TeamStaff, Inc. and changed its name to DLH Holdings Corp. in June 2012. DLH Holdings Corp. was incorporated in 1969 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/cT8zRWqW6j53h61mDQNBkQ/G-g-hr4Z8YNqJL9qF7279XSYd-FVHIST8Pza5aHDyXVtRY2Wv45PFsq9Um51x-uyuEjn75IsDUW1RlAzkAXTzwf230opLTTiw9mwuSy9ZBpm58LRDu4OJswTlmQsgV_bxU40MGddnVh85hhIQAPy6bEUq36T0uiWcgy1ixgNNKb9e91PZvE0yaOaLmIIRoJE/41fJmqE0LVAm7rX9_LkSWJ87W8fwpfSM0oe5w90i5M4",
    "price": 5.58,
    "prevClose": 5.56,
    "absReturn": 0.020000000000000462
  },
  {
    "fullTicker": "MBIO:USA",
    "baseTicker": "MBIO",
    "rank": 68.0149,
    "description": "Mustang Bio, Inc., a clinical-stage biopharmaceutical company, focuses on translating medical breakthroughs in cell and gene therapies into potential cures for hematologic cancers, solid tumors, and rare genetic diseases. Its pipeline focuses on gene therapy programs for rare genetic disorders, chimeric antigen receptor (CAR) engineered T cell (CAR T) therapies for hematologic malignancies, and CAR T therapies for solid tumors. The company develops MB-117 and MB-217, a gene therapy program for X-linked severe combined immunodeficiency, a rare genetic immune system condition in which affected patients do not live beyond infancy without treatment. The company also develops MB-106 CAR T cell program for B cell non-hodgkin lymphoma and chronic lymphocytic leukemia; MB-101 CAR T cell program for glioblastoma; MB-108, a next-generation oncolytic herpes simplex virus. It has license agreements with Nationwide Children's Hospital, CSL Behring; Mayo Clinic; Leiden University Medical Centre; SIRION Biotech GmbH. The company was incorporated in 2015 and is headquartered in Waltham, Massachusetts. Avenue  Mustang Bio, Inc. is a subsidiary of Fortress Biotech, Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/E_yUS7zv9qmjA2BsNpNhpg/1POGakrB-r4XURa7Ssi6VSgRhmVO1yKJFwZbyogEeNTPwThqEgcDoq5m_fvGRXwm3tTl6gZf6HzzzRkGYjYj1hsrr28BKeFtvEIbKxu2Ben7YEMQ9u3z8qsnPVs9atKs8r4zgLWL2bMW6-gV7Sb4zdPoAEH5b3yhZ7Fz6-QCnYQ/Wsm3TBDUkICGQxNWJgkXGHgRFoGFKp7On3r_eS7JK6w",
    "price": 0.83,
    "prevClose": 0.8741,
    "absReturn": -0.04410000000000003
  },
  {
    "fullTicker": "TNL:USA",
    "baseTicker": "TNL",
    "rank": 81.4977,
    "description": "Travel + Leisure Co., together with its subsidiaries, provides hospitality services and travel products in the United States and internationally. The company operates in two segments, Vacation Ownership; and Travel and Membership. The Vacation Ownership segment develops, markets, and sells vacation ownership interests (VOIs) to individual consumers, as well as offers consumer financing in connection with the sale of VOIs; and property management services at resorts. The Travel and Membership segment operates various travel businesses, including three vacation exchange brands, travel technology platforms, travel memberships, and direct-to-consumer rentals. This segment also offers private-label travel booking technology solutions. The company was formerly known as Wyndham Destinations, Inc. and changed its name to Travel + Leisure Co. in February 2021. Travel + Leisure Co. was founded in 1990 and is headquartered in Orlando, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/rsFOnL8OMP6NjAeFFN9wQw/QYiWu5JEcS81I85PjL4x_lXmc5fRv-suDFgD7Xw9X25_C6ZM50dCYxr7j2TYgFSKwIwK27NAMhBZBdX_h_7sIwXlyDzA16uGRV7t25dR2uQuS6ipO0eB5DbhiNWrpR1vVZd0k8p-3R0qzTdKU1_Ax744vOmfPrBp6nJ89jpxiSITNcmttvLtxxcnEn6ymHol/STtHdAF1x3C8VeVWW3Zg3J6LMubWp7h3983quds3If0",
    "price": 72.04,
    "prevClose": 70.84,
    "absReturn": 1.2000000000000028
  },
  {
    "fullTicker": "LZ:USA",
    "baseTicker": "LZ",
    "rank": 86.6797,
    "description": "LegalZoom.com, Inc. together with its subsidiaries, operates an online platform that supports the legal, compliance, and business management needs of small businesses and consumers in the United States. The company's platform offers business formation products, such as limited liability company, incorporation of C and S corporations, nonprofit formations, doing-business-as, corporate changes and filings, business licenses, legal forms, and beneficial ownership information reports; and intellectual property products consisting of trademark and patent applications, and copyright registrations. It also provides consumer, estate planning, and other services comprising last will and testament, living will, living trust, power of attorney, and name change. In addition, the company offers subscriptions services, including registered agent, compliance, attorney advice, tax advice and preparation, eSignature, virtual mail and check deposit services, trademark monitoring, and estate planning bundle. The company was incorporated in 1999 and is headquartered in Mountain View, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1771358400000/dILuToO7C0n-z9XGNqM7rQ/B0rz7CjC0rGtsVY4buMNATQYOrpOKz7Z73OAfqGn-KewF9AOykaG6aKKx0mIp9jZrDfIuXCb-ejh-Ijv7SVec571JDQwtd0V9vImzYPAujGFG8KRHaItN6hroB5n7AS8-4b2FtIHnL1BAdywBz0ABsMkg-hX-kKU9MUoh5gJNGXj5nrpLTvMjkvqIe0zVdrN/vnEP5K53SNDt_bK2QX2pzaMy7Ftbqr-Y26jTSWb47Ro",
    "price": 6.835,
    "prevClose": 6.87,
    "absReturn": -0.03500000000000014
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 681.26,
    "prevClose": 681.75,
    "absReturn": -0.4900000000000091
  }
]