[
  {
    "fullTicker": "ELDN:USA",
    "baseTicker": "ELDN",
    "rank": 3.7056,
    "description": "Eledon Pharmaceuticals, Inc. operates as a clinical stage biotechnology company. The company uses its immunology expertise in targeting the CD40 Ligand (CD40L, also called CD154) pathway to develop therapies to protect transplanted organs and prevent rejection, and to treat amyotrophic lateral sclerosis (ALS). The company's lead compound in development is tegoprubart, an IgG1 and anti-CD40L antibody with high affinity for CD40 Ligand, a biological target with therapeutic potential. It is also developing its products for kidney transplantation, xenotransplantation, and liver transplantation. The company has a collaboration agreement with eGenesis, Inc. The company was formerly known as Novus Therapeutics, Inc. and changed its name to Eledon Pharmaceuticals, Inc. in January 2021. Eledon Pharmaceuticals, Inc. is headquartered in Irvine, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/9OXSGIfN0aEQK2inhg86Zw/og1-uRMhTnJVOgzEBmEhWap0f5MSUI9ptS2q7CtHO0smDzqPnF5sj-WWvfI-BsniXdUmaJOIC-28aVOxv30ARFf24RLjf6mqWVKR92D-8dbsp78TZlnPOHZ-UK2qKmzt9zXggArm3kvGjADgou0RXp7la6rvZtTG4VFE2YCJltcz_nAboCb9qrzje_NRv6Qj/13ndhIszLe1W37EJlhfj4Ze283iozD5kkf4TilRx_G4",
    "price": 3.535,
    "prevClose": 3.29,
    "absReturn": 0.2450000000000001
  },
  {
    "fullTicker": "SHPH:USA",
    "baseTicker": "SHPH",
    "rank": 14.0065,
    "description": "Shuttle Pharmaceuticals Holdings, Inc., a clinical stage pharmaceutical company, develops novel therapies to cure cancers. The company is developing Ropidoxuridine, an oral halogenated pyrimidine to treat patients with brain tumors and sarcomas; and SP-2-225, a pre-clinical class IIb product candidate that effects on the regulation of the immune system. It is also developing SP-1-303, a pre-clinical selective Class I HDAC for use in the treatment of ER positive breast cancers; and SP-1-161, a HDAC inhibitor that initiates the mutated in ataxia-telangiectasia response pathway. The company was founded in 2012 and is headquartered in Gaithersburg, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/nc-RLhkcUA3PyxU9TSbR5Q/yskwQlqCqqYWvm5AKAtwpYT09NPe_jlb2iQmTl8apiho9gl9BLO5CDwv7W6VkkPOGTH6wp3HQa9YNJKPlqo205WEXxiP5bmgkD5yTuuxkyWKv4PnnD8nviwQog8o7HjRr-s6cKCPyYelWtj-R-NIMKTsQRUgK-jnl1FKck9y5G9h-1GEkuT4fCXqWfEBsW6Vqmth5-xcfWak09tsQipRmg/MprDqoHpwgFWWnF8vh1RFHVhGa-XoRZfr4EES2nUMew",
    "price": 3.09,
    "prevClose": 3.22,
    "absReturn": -0.13000000000000034
  },
  {
    "fullTicker": "AVTX:USA",
    "baseTicker": "AVTX",
    "rank": 15.5533,
    "description": "Avalo Therapeutics, Inc., a clinical stage biotechnology company, focuses on the development of therapies for the treatment of immune dysregulation in the Unites States. The company's drug candidates include AVTX-009, an Anti-IL-1ß monoclonal antibody which is under Phase I targeting inflammatory diseases; and AVTX-008, a fully human B and T lymphocyte attenuator agonist fusion protein for the treatment of immune dysregulation disorders. It also develops Quisovalimab (AVTX-002), an Anti-LIGHT mAb which is in phase II for immune-inflammatory diseases. The company was formerly known as Cerecor Inc. and changed its name to Avalo Therapeutics, Inc. in August 2021. Avalo Therapeutics, Inc. was incorporated in 2011 and is headquartered in Rockville, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/NIib4B3Z-CxjP6uOzrGiaQ/1Xt7bP5SIgJ7v3UP3D5diV6zzY7hmEwYxLV2WtPsdYEeVDRyjc1eK3SrRjwto1xRUOrDpyvvM2JH-xARH60XhtNKg2H_UQ0N8anfqU2jjTrPhi7GSYcLbKoxeoA_S6pb0ENjnS1qucV2wMRotugBeuRaFnenlJwu21SBiRQM7Qro0AvRM7y9LvFZfjwAVyYf/seDTTZ2a2Vje40memcasmzPiasAlwQ-3HRCY7WkcwJM",
    "price": 17.585,
    "prevClose": 17.92,
    "absReturn": -0.33500000000000085
  },
  {
    "fullTicker": "GROY:USA",
    "baseTicker": "GROY",
    "rank": 28.8968,
    "description": "Gold Royalty Corp., a precious metals-focused royalty company, provides financing solutions to the metals and mining industry. It focuses on acquiring royalties, streams, and similar interests at varying stages of the mine life cycle to build a portfolio offering near, medium, and longer-term returns for its investors. Gold Royalty Corp. was incorporated in 2020 and is headquartered in Vancouver, Canada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/_29uCC3bvqxQYE6vAesAXg/TFX0IdqgKyjxF5VtMRRG_7BqRBfUdW2UK-FYyw11jje4bCA8S6Nk1Maenty0dxyOmspqWQxWOq2iQ0BYA1g3DF4TbuXj2SVSDiYsBujTAtAdO0EjjEYChQGdBOw5gBHZEVtllXlPVX9aQMbVvuLj7bINexQu3GSppG2oS2QCBOb4w9K1KPBdy5tGokM3c5nD/EpKMATnDnJDbTquQfBF2SjatYDrOz4990PaoJX4BAgA",
    "price": 3.66,
    "prevClose": 3.6,
    "absReturn": 0.06000000000000005
  },
  {
    "fullTicker": "CNR:USA",
    "baseTicker": "CNR",
    "rank": 34.9312,
    "description": "Core Natural Resources, Inc., together with its subsidiaries, produces, sells, and exports metallurgical and thermal coals in the United States and internationally. It operates through two segments, Pennsylvania Mining Complex (PAMC) and CONSOL Marine Terminal. The PAMC segment engages in the mining, preparing, and marketing of bituminous coal to power generators, industrial end-users, and metallurgical end-users. The CONSOL Marine Terminal segment provides coal export terminal services through the Port of Baltimore. The company was formerly known as CONSOL Energy Inc. and changed its name to Core Natural Resources, Inc. in January 2025. Core Natural Resources, Inc. was founded in 1864 and is headquartered in Canonsburg, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/ZQiHmR-RlZbuR7eiJTU-rw/WI8gY886JXPsTocRmDB41L-BTm4T8FqxnJ5BzQbhgCeRljBTEc8vaPEA_GPlXi5KrAwphWq98l9Py2Y4YO1NlvMQUvxa8UnTblU01QYeO6JMd4JVfifDSCr3HAYixQJC3Tvrr4rHrYuMOlBWDXQYp9fKQamtWgzh3vFEw_NdkwO8N_6LmPyRXdAAsOvBEZE7/NqkDGB4JsGrF8UYOzN5mcGajU5jarJHdLKpLlhfjqxE",
    "price": 83.35,
    "prevClose": 83.53,
    "absReturn": -0.18000000000000682
  },
  {
    "fullTicker": "MRVL:USA",
    "baseTicker": "MRVL",
    "rank": 52.5582,
    "description": "Marvell Technology, Inc., together with its subsidiaries, provides data infrastructure semiconductor solutions, spanning the data center core to network edge. The company develops and scales system-on-a-chip architectures, integrating analog, mixed-signal, and digital signal processing functionality. It offers a portfolio of ethernet solutions, including spanning controllers, network adapters, physical transceivers, and switches; single or multiple core processors; and custom application specific integrated circuits. The company also provides interconnect products, including pulse amplitude modulation, coherent and coherent-lite digital signal processors (DSPs), laser drivers, trans-impedance amplifiers, silicon photonics, co-packaged optics, linear pluggable optics chipsets, data center interconnect, active electrical cable DSPs and peripheral component interconnect express retimer solutions; fibre channel products comprising host bus adapters and controllers; storage controllers for hard disk drives and solid-state-drives; host system interfaces, including serial advanced technology attachment and serial attached SCSI, peripheral component interconnect express, non-volatile memory express (NVMe), and NVMe over fabrics. It operates in the United States, Argentina, China, India, Israel, Japan, Singapore, South Korea, Taiwan, and Vietnam. Marvell Technology, Inc. was incorporated in 1995 and is headquartered in Wilmington, Delaware.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/LGCCtvrv5IQCF2nxgvjl7w/fzSZlelmfmT5ryvT6pXledqyLdbiWoD_JPFUl-vcmNDWS_0MoDgQmj1_uxBNAyC1WSB-NpvU4J--7bev1ZA564EvB4b3vZRB1OhRh1I0oId4e9sXOH5GRVg18ChwJqxXkP2_KSQJ0LfraDhu7Nqhzw-Jc5ZhmOgwsaSTQ699zTuBSKVQ41ShmeOYOZFfML02/FauPibl2M7FvkbfH6k0Gsriq8ogcaSDAonMP0dJVyjI",
    "price": 85.455,
    "prevClose": 82.77,
    "absReturn": 2.6850000000000023
  },
  {
    "fullTicker": "CVU:USA",
    "baseTicker": "CVU",
    "rank": 58.5076,
    "description": "CPI Aerostructures, Inc. engages in the contract production of structural aircraft parts for fixed wing aircraft and helicopters in the commercial and defense markets. The company offers aerostructure and aerosystem assemblies, including new production and repair/overhaul of fielded wing structures and other control surfaces, rudder island, engine inlets/nacelles, engine exhaust manifolds, aircraft doors and windows, aircraft steps and racks, other aircraft secondary structures, airborne pod structures and integration of internal systems, radar housing structures, panel assemblies, and mechanical door locking and canopy lifting systems. It provides diameter tube bending, such as complex ducts and tubes in steel, aluminum, titanium, and nickel alloys; fusion welded fluid tanks, and resistance welding for spot and seam; wire harnesses; and power control, fuel management, power distribution, and fully integrated electrical control systems, as well as enclosures. In addition, the company offers engineering, program and supply chain management services, kitting contracts, and maintenance repair and overhaul services. The company was formerly known as Consortium of Precision Industries, Inc. and changed its name to CPI Aerostructures, Inc. in July 1992. CPI Aerostructures, Inc. was incorporated in 1980 and is headquartered in Edgewood, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/0qUVDHw8EIGbFueKE63vjw/KEXgdBr3ktvhO-FHy7jAS9tZ_Ij7lYcbyhLu7lsziz2wGH7Cb0ICZWM9ixy6oqN1ZB9_B9sm1bKf0_yHlMrkoXgqQZ77ZbHQKZBV3OlUEdxuTBJksdDzoJ2U5EjdcpV-LQ-oMBF7RFVoykhgp1D8Z5aSfSPvLREOl8rX0bME4nVJH0ZQ5d6hlBiNd-_sAMEx/sEJZu3yFTD7B_HMaWrH7vW7wfxdXoVv03XDCyIjHkIc",
    "price": 2.55,
    "prevClose": 2.5,
    "absReturn": 0.04999999999999982
  },
  {
    "fullTicker": "VTS:USA",
    "baseTicker": "VTS",
    "rank": 69.9473,
    "description": "Vitesse Energy, Inc., together with its subsidiaries, engages in the acquisition, development, and production of non-operated oil and natural gas properties in the United States. The company owns and acquires non-operated working interest and royalty interest ownership in the Williston Basin properties that covers 47,840 net acres located in the North Dakota and Montana. It also owns non-operated interests in the Central Rockies properties located in Colorado and Wyoming. The company was founded in 2014 and is based in Greenwood Village, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/NzXZPTvMH3JbYIfZkI5UxQ/I38iVyrKUMsPciJ8VhRKY-HWfkJalQ-PjhxKgllZC87docsYuxuOgM4SNHrfXhUmdYNDuemgOBo90CNvE4Om8PS9h_DmcYx_ziDYYTJZtYaun2wYoEXIWyVhgzksir8VxwhCnbPcERx_Ks4W5gOQDuCnURt73r4DCbpnqC42Q-n0Ayj_tQOdEwtQVoT08uVt/nYp9l2-YNX8fpsO3gnnka5Y2S9j2XHT-65eeSHx7euk",
    "price": 21.945,
    "prevClose": 21.9,
    "absReturn": 0.045000000000001705
  },
  {
    "fullTicker": "VC:USA",
    "baseTicker": "VC",
    "rank": 85.9595,
    "description": "Visteon Corporation, an automotive technology company, designs, manufactures, and sells automotive electronics and connected car solutions for vehicle manufacturers. The company provides instrument clusters, including analog gauge clusters for 2-D and 3-D display-based devices; information displays that integrate a range of user interface technologies and graphics management capabilities, such as active privacy, TrueColor enhancement, local dimming, cameras, optics, haptic feedback, and light effects; and infotainment and connected car solutions, including scalable Android infotainment for seamless connectivity, as well as onboard artificial intelligence-based voice assistants with natural language understanding. It offers display audio and embedded infotainment platform that enables third-party developers to create apps through a software development kit and software simulation of the target hardware system; and wired and wireless battery management systems; and power electronics units. In addition, the company provides SmartCore, an automotive-grade, integrated domain controller; SmartCore Runtime, a middleware enabling communication between domains and apps to be shown on any display; and SmartCore Studio, a PC-based configuration tool to generate hypervisor configurations. It operates in the United States, Mexico, Portugal, Slovakia, Tunisia, rest of Europe, China, India, Japan, rest of the Asia Pacific, and South America. Visteon Corporation was incorporated in 2000 and is headquartered in Van Buren, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/LTIkK72a1xS3nYWBsghCZA/oZXT2SgfL1WALXMmxl58vOw1pHz0hS4DcdhXoUtlROQR9F48cqvbc2GpuxbeHtz5DaEbD7shqoP-VxlrwF96UQ-uci8GGXf-c1j8FrdDMFtl1bE2jZKFauoko72FeiEL39WnNdQLuVzq6JXQTMRuToggVnrDKql7hZd-CvO5e2E/46Wzo4nolu_BEwHP3W3q-t_BMGwuR9tBz5CJ9_oV_nA",
    "price": 108.86,
    "prevClose": 110.22,
    "absReturn": -1.3599999999999994
  },
  {
    "fullTicker": "CPRX:USA",
    "baseTicker": "CPRX",
    "rank": 88.6113,
    "description": "Catalyst Pharmaceuticals, Inc., a commercial-stage biopharmaceutical company, focuses on developing and commercializing medicines for patients living with rare diseases in the United States. It offers Firdapse for the treatment of patients with lambert-eaton myasthenic syndrome (LEMS); Fycompa, a novel non-competitive selective antagonist at the postsynaptic ionotropic alpha-amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid glutamate receptor that is used to treat focal onset seizures, as well as tonic-clonic seizures; Ruzurgi for the treatment of pediatric LEMS patients; and AGAMREE, a corticosteroid for the treatment of duchenne muscular dystrophy. The company has license agreements with BioMarin Pharmaceutical Inc.; and a collaboration and license agreement with Endo Ventures Limited for the development and commercialization of generic Sabril tablets. Catalyst Pharmaceuticals, Inc. was founded in 2002 and is based in Coral Gables, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761336000000/nncvn9Q_F09TT3Qrq4bInQ/v98_ssuOHPZkSDSsXr4RNIosvbhBfCq50dv94SBJvKSuLtL2Ol76cqrDrhs_ybhr_x0Df6ILAUGn7qHEQl8YGUPZ5eJBfFjconu5J48l115aMHDFpJodk0UKkhS7pYbkFy8VtG6D44CCfdk0gwBfmpezlve-0GNaWMXjlhEC_DZnxLVkkNSavIG5yb-bfEU4/qV5Dz-1uRvB3BvE0lNfNI7-vOy_qHbLfg1mFUkzVm_g",
    "price": 21.055,
    "prevClose": 20.73,
    "absReturn": 0.3249999999999993
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 677.83,
    "prevClose": 671.76,
    "absReturn": 6.07000000000005
  }
]