[
  {
    "fullTicker": "ASTS:USA",
    "baseTicker": "ASTS",
    "rank": 0.0542,
    "description": "AST SpaceMobile, Inc., together with its subsidiaries, designs and develops the constellation of BlueBird satellites in the United States. The company provides a cellular broadband network in space to be accessible directly by smartphones for commercial use and other applications, as well as for government use. Its SpaceMobile service provides cellular broadband services to end-users who are out of terrestrial cellular coverage. The company was founded in 2017 and is headquartered in Midland, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/onmjUA9U05_vaVUhFwZkRQ/Z0XaVziFZGVMbN6uy7pdSC-EEhn6PzatnN70YTAsVK42hPVg6y_bX3cW5RQK2FmAZaLsZvtBm53KW1WkgIzhE8-UyT1UgakTHYY0wmahRGBsvkN2XpazkFkPE-0NObet8RqD-4n9e4mdwKmswG0GEwiLI02oAIBX5Kx_XTVb9lg9iWRbhIX13yvrrj2FBUno/Gda2AkUtndBK1beCvbuxAa8yHa_zSAUwTJxfygbRN9A",
    "price": 26.66,
    "prevClose": 26.24,
    "absReturn": 0.4200000000000017
  },
  {
    "fullTicker": "PHUN:USA",
    "baseTicker": "PHUN",
    "rank": 12.1678,
    "description": "Phunware, Inc., together with its subsidiaries, provides integrated software platform that equips companies with the products, solutions, and services to engage, manage, and monetize their mobile application portfolios in the United States and internationally. The company's products and services include mobile software and application transaction solutions comprise integration of software development kit (SDK) licenses, which consists of analytics that offers data related to application use and engagement; content management that allows application administrators to create and manage app content in a cloud-based portal; alerts, notifications, and messaging, which enables brands to send messages; marketing automation that enables location-triggered messages and workflow; advertising; and location-based services, such as mapping, navigation, wayfinding, workflow, asset management, and policy enforcement. It is also involved in the integration of its SDK licenses into existing applications maintained by its customers, as well as custom application development and support services; and provision of cloud-based vertical solutions for healthcare, retail, sports, aviation, real estate, hospitality, education, and other applications, as well as application transactions, including re-occurring and one-time transactional media purchases for application discovery, user acquisition and audience building, audience engagement, and audience monetization. Phunware, Inc. was founded in 2009 and is headquartered in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/YVqDHmFTdFkaOgcsa-jIsA/I-zA-SrYQkRmMBob3vpBcbPqkCngjxbETr9oCcBvPod89qWJtBHaHZkKcBy-6O2IOZZrnIjLGz7usy7GGQmZZBlffLf-8mJQcoMlKB7baLBlB3zjEEKrkMxkwvqyMZaWxT09ZHYoNdHXqvsHHIbbtHC91h3Pwtrw45XrgO6KPGk/zKpH1N7EI7FI6K2rv2_HKffry3BTFHnlTQuydTLD638",
    "price": 3.13,
    "prevClose": 3.03,
    "absReturn": 0.10000000000000009
  },
  {
    "fullTicker": "GEOS:USA",
    "baseTicker": "GEOS",
    "rank": 16.3081,
    "description": "Geospace Technologies Corporation designs and manufactures instruments and equipment used in the oil and gas industry to acquire seismic data in order to locate, characterize, and monitor hydrocarbon producing reservoirs. The company operates through three segments: Oil and Gas Markets, Adjacent Markets, and Emerging Markets. The Oil and Gas Markets segment offers wireless seismic data acquisition systems and reservoir characterization products and services, as well as traditional seismic exploration products, such as geophones, hydrophones, leader wires, connectors, cables, marine streamer retrieval and steering devices, and other seismic products. The Adjacent Markets segment provides industrial products, including imaging equipment, water meter products, remote shut-off valves, and Internet of Things platform, as well as seismic sensors for vibration monitoring and geotechnical applications, such as mine safety and earthquake detection applications; and electronic pre-press products that employ direct thermal imaging, direct-to-screen printing systems, and digital inkjet printing technologies targeted at the commercial and industrial graphics, textile, and flexographic printing industries. The Emerging Markets segment designs and sells products used for border and perimeter security surveillance, cross-border tunneling detection, and other products targeted at movement monitoring, intrusion detection, and situational awareness. This segment serves various agencies of the United States government, including the Department of Defense, Department of Energy, Department of Homeland Security, and other agencies, as well as energy companies. The company operates in Asia, Canada, Europe, Mexico, South America, the United States, and internationally. Geospace Technologies Corporation was founded in 1980 and is headquartered in Houston, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/gF0R1cw6os-L7izg7aDiwA/-8CgjcVlNzrCHF3n3Tn3mmHlh7GFiG2Cf-W6RpAqGaU5gcfE3Sx5Gi_JC-82uYJbMpunGX0sJIfx6YyGc5kfbFN_AaVhQEl6IHAjcpA2a0XBZa3-PlQQ2mnIXj_hCRMkVnjV3bTUJ9spkUJ17i1EiJXwS6ThyHLX6F3FzENIosIoD1FNaigvs1PMQ9gcg_BD/_JpQferGL0f2SBozJPiEk1cm74aDSotX9ycwKMnEj_0",
    "price": 6.18,
    "prevClose": 6.16,
    "absReturn": 0.019999999999999574
  },
  {
    "fullTicker": "ADSE:USA",
    "baseTicker": "ADSE",
    "rank": 26.2159,
    "description": "ADS-TEC Energy PLC engages in the provision of intelligent and decentralized energy storage systems in Europe and North America. Its portfolio of ecosystem platforms provides DC-based ultra-fast chargers for Electric Vehicles (EVs) on power limited grids; and energy storage and management solutions for commercial and industrial, and residential sector coupling applications. The company offers ChargeBox, which contains the battery and power inverters; ChargePost, a semi-mobile ultra-high-power charger; and ChargeTrailer, a mobile high power charging system in the form of a standard truck trailer, that has various integrated inverters, air-conditioners, an energy management unit, and security firewall, as well as a communication unit through mobile radio and DC-charging technology. It also provides PowerBooster, a battery energy system with an integrated inverter, security, and communication unit, that boosts capacity for the charging process; Container-Systems, a custom battery system for large-scale applications as 20- or 40-foot container solutions; and Storage Rack Systems, that offers power and storage capacities, as well as digital services. In addition, the company is developing MyPowerplant platform for residential applications. Its products are used in private homes, public buildings, commercial enterprises, industrial and infrastructure solutions, and self-sufficient energy supply systems. The company was founded in 2008 and is based in Dublin, Ireland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/mqPtLDYxJbxPZ54lB_lfiw/bMg7Wa406jMY-BYZ2Pgbsc0-mRVot5hvxGmXD2wkUk0vHxJAk023Q2yGdmYGTNLXu3RFwKbAf8A0BLoUcjMRtD12edJcA-4kw3Rnz8BI2ou6NDeVauNZxdNpMnj6Q9fxrg62SKK1PBFR8BRwQO09quQnFdSwMvf_awV8pdprkRp1cdah-x3oiW-doDR7BOtR/v1BZeNCPjg8MHE7hWoD5ubGJ0O_TCEEUJgpz8lHVbkA",
    "price": 12.29,
    "prevClose": 12.08,
    "absReturn": 0.20999999999999908
  },
  {
    "fullTicker": "MNRO:USA",
    "baseTicker": "MNRO",
    "rank": 38.5283,
    "description": "Monro, Inc. engages in the operation of retail tire and automotive repair stores in the United States. It offers replacement tires and tire related services, automotive undercar repair services, and routine maintenance services primarily to passenger cars, light trucks, and vans. The company also provides other products and services for brakes; mufflers and exhaust systems; and steering, drive train, suspension, and wheel alignment. In addition, it operates its stores under the Monro Auto Service and Tire Centers, Tire Choice Auto Service Centers, Mr. Tire Auto Service Centers, Car-X Tire & Auto, Tire Warehouse Tires for Less, Ken Towery's Tire & Auto Care, Mountain View Tire & Auto Service, and Tire Barn Warehouse brand names. The company was founded in 1957 and is headquartered in Rochester, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/65ddqiV_p9vU-FfvpwwuqA/TMgOmAqJ_hUibcJA3PrZrA1QqvPcGEmND4GbXa3J5gfEd5YFyssxcjvc6hk71sIa3RtiJ2inoglfXoUx61SjUDfZGP0I-VXFDjgGGlpDVEVoeeMp6LOtnEgn2WdXcyl_0R3x0qFFHleT7N95I4dVCHOoVixcVhL2eJoTK_NwKzw/CqGGV14IzViKkvlrXwO3ACUvZZhDQvP0bsrMWGD7TSo",
    "price": 13.58,
    "prevClose": 12.95,
    "absReturn": 0.6300000000000008
  },
  {
    "fullTicker": "MVST:USA",
    "baseTicker": "MVST",
    "rank": 49.0689,
    "description": "Microvast Holdings, Inc. provides battery technologies for electric vehicles and energy storage solutions. The company offers a range of cell chemistries, such as lithium titanate oxide, lithium iron phosphate, and nickel manganese cobalt version 1 and 2. It also designs, develops, and manufactures battery components, such as cathode, anode, electrolyte, and separator. In addition, the company offers battery solutions for commercial vehicles and energy storage systems. Its commercial vehicle markets cover buses, trains, mining trucks, marine and port vehicles, and automated guided and specialty vehicles, as well as light, medium, heavy-duty trucks. It operates China, rest of the Asia Pacific, Europe, and the United States. Microvast Holdings, Inc. was incorporated in 2006 and is headquartered in Stafford, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/ZYYMQ7bVzROzNcthuIwfOQ/TWNjhe1scXLC0xfZ9j1veejvRsb2HSy0LwkIoQEQ2wf4OLALEHkXmgY862F65ahd3qv3SdyaCgyC0zDhJ2Xd2g4cheLqMW0X9wP4K-0tybF96chFk_xeurBYHCHvpBTzVgNQqXhnc184VDDW5PgRmbE2s8Oo2B1-JLW_A10RwOWLWR9lXze8kCQAmyfDpygU/H1ugUr6biMpHv4D-dGO8LS1Qs1ZlMlKomJcGcbpuTAE",
    "price": 3.38,
    "prevClose": 3.3,
    "absReturn": 0.08000000000000007
  },
  {
    "fullTicker": "MHH:USA",
    "baseTicker": "MHH",
    "rank": 52.6306,
    "description": "Mastech Digital, Inc., together with its subsidiaries, provides digital transformation IT services to large, medium-sized, and small companies in the United States. The company operates through Data and Analytics Services and IT Staffing Services segments. It offers data management and analytics services, including project-based consulting services in the areas of master data management, enterprise data integration, big data and analytics, and digital transformation by using onsite and offshore resources. In addition, the company provides a range of IT staffing services in the areas of data management and analytics, cloud, mobility, social, automation, business intelligence/data warehousing, web services, enterprise resource planning and customer resource management, and e-business solutions. Further, it offers digital transformation services, including digital learning services; and cloud-based enterprise application across sales, marketing, and customer service organizations. The company provides its services across various industry verticals, such as financial services, retail, healthcare, manufacturing, government, telecommunications, and transportation. The company was formerly known as Mastech Holdings, Inc. and changed its name to Mastech Digital, Inc. in September 2016. Mastech Digital, Inc. was founded in 1986 and is headquartered in Pittsburgh, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/FAjQj0GLVZ6LJDrLn5UICA/fjWjrLJQJ4RoZnMQeFEPB7mBPfbWVKz299xKLfu5nu_mLB0N4Uz0hEk0KQgS47wxtzXuHNkcS_CDngUgpMqnup31oPWZQEu3x0tHIDcJ3jN-EFv3zI_aYSU1TS0yNBrSqg3iS3zKxzLAZPFq9wHF5atsEHQHb8jcD0og61z_bZmo4O71cqo7Z0oeBuq4RSij/lVUSJzcKBHig5-0LWMYavgYfWvV9RmKEW_4sJmaLJHE",
    "price": 8.1,
    "prevClose": 8.51,
    "absReturn": -0.41000000000000014
  },
  {
    "fullTicker": "VSCO:USA",
    "baseTicker": "VSCO",
    "rank": 60.6943,
    "description": "Victoria's Secret & Co. operates as a specialty retailer of women's intimate, and other apparel and beauty products worldwide. The company offers bras, panties, lingerie, casual sleepwear, apparel, sport and swim, as well as prestige fragrances and body care; and loungewear, activewear, and accessories and beauty under the Victoria's Secret, PINK, and Adore Me brand names. It provides its products through its retail stores; websites, such as VictoriasSecret.com, PINK.com, AdoreMe.com, and DailyLook.com; and other digital channels. The company also operates stores under the franchise, license, and wholesale arrangements. Victoria's Secret & Co. was incorporated in 2021 and is headquartered in Reynoldsburg, Ohio.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/RDN8HSpNCFQuzDqy_hiycw/sbZsP_sYCrRbvf0MSIRMIxYKwKjo-JFN_AV9wrtLkx2kpSwWqbPG2vYvFIv1CTNxbGbdfwixiz11w7bjeWYFQjQ0djX1BR_4uePw6DuvpKl2YWFbsmJJFxnrhALI5m5mDeTutpyMBkhfU1geTsE4MEZ4ePOcwx2sKewg3ZnvdJGyIp1NxIgk8dmnYItViaV0/s1Cf99cueh4Om6CIfDSWgd0U1mQnDmJMLdvvbh9eVsg",
    "price": 23.57,
    "prevClose": 23.2,
    "absReturn": 0.370000000000001
  },
  {
    "fullTicker": "TNL:USA",
    "baseTicker": "TNL",
    "rank": 83.6919,
    "description": "Travel + Leisure Co., together with its subsidiaries, provides hospitality services and travel products in the United States and internationally. The company operates in two segments, Vacation Ownership; and Travel and Membership. The Vacation Ownership segment develops, markets, and sells vacation ownership interests (VOIs) to individual consumers, as well as offers consumer financing in connection with the sale of VOIs; and property management services at resorts. The Travel and Membership segment operates various travel businesses, including three vacation exchange brands, travel technology platforms, travel memberships, and direct-to-consumer rentals. This segment also offers private-label travel booking technology solutions. The company was formerly known as Wyndham Destinations, Inc. and changed its name to Travel + Leisure Co. in February 2021. Travel + Leisure Co. was founded in 1990 and is headquartered in Orlando, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/xba_LgWzyX7JClIv2rm3Yw/M--hZt2Lck0gWvOFIERxzto7HXNB-ruz6VFRtFqJcUmGLfit3f0PyE9JC4qwlw4xjgALsOrXHPQAdJP-U3A-HFVEUWC8YhSGCVQKnXchoOrVqvT_n3RGohqQfkjBEded5k6SqJk4yhZpDjqVJWpmF8nSpoH4Nb4Y4BbVplmDB_y8W2x-LXXMrOgHm4XNUod2/iwBKD95BiYdpE2PEqQMczvJG8-lsS1Yx4c2TXYLh0ho",
    "price": 51.11,
    "prevClose": 50.71,
    "absReturn": 0.3999999999999986
  },
  {
    "fullTicker": "CRC:USA",
    "baseTicker": "CRC",
    "rank": 86.205,
    "description": "California Resources Corporation operates as an independent energy and carbon management company in the United States. It operates in two segments, Oil and Natural Gas, and Carbon Management. The company explores, develops, and produces crude oil, oil condensate, natural gas liquids and natural gas to california refineries, marketers, and other purchasers. It also provides Carbon TerraVault which build, install, operate, and maintain CO2 capture equipment, transportation assets, and storage facilities. In addition, the company owns and operates power generation facilities, as well as smaller gas-fired power plants used to generate power for oil and natural gas operations. The company was incorporated in 2014 and is based in Long Beach, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747663200000/rsONuEMOyxVqtunYkEklEg/LGVGLXE2D8eKIb8apf-lGnVTgSM3luZsswfKuimNMLLZgufaS4_itJZxLmdTNs8TANBuuLJvyEcsZUO3YgfO4PXnMD4r74mDjDGMSPUcuRr_8a4c_0TVgoO-cuKu74p2KGkiV8uV4v-flGeD9NPI1ow6231xUMyb1UtW0AOcM-9u4m4Sc9l0kJ48FT1a0yYP/_WnxAbVVE7u0to6rZmFigYwH4R9vqdX5mN40ax2ofxk",
    "price": 42.6,
    "prevClose": 43.16,
    "absReturn": -0.5599999999999952
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 594.2,
    "prevClose": 590.46,
    "absReturn": 3.740000000000009
  }
]