[
  {
    "fullTicker": "PHUN:USA",
    "baseTicker": "PHUN",
    "rank": 4.362,
    "description": "Phunware, Inc., together with its subsidiaries, provides integrated software platform that equips companies with the products, solutions, and services to engage, manage, and monetize their mobile application portfolios in the United States and internationally. The company's products and services include mobile software and application transaction solutions comprise integration of software development kit (SDK) licenses, which consists of analytics that offers data related to application use and engagement; content management that allows application administrators to create and manage app content in a cloud-based portal; alerts, notifications, and messaging, which enables brands to send messages; marketing automation that enables location-triggered messages and workflow; advertising; and location-based services, such as mapping, navigation, wayfinding, workflow, asset management, and policy enforcement. It is also involved in the integration of its SDK licenses into existing applications maintained by its customers, as well as custom application development and support services; and provision of cloud-based vertical solutions for healthcare, retail, sports, aviation, real estate, hospitality, education, and other applications, as well as application transactions, including re-occurring and one-time transactional media purchases for application discovery, user acquisition and audience building, audience engagement, and audience monetization. Phunware, Inc. was founded in 2009 and is headquartered in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/KYowdssKMhOqLq5lVeHTWQ/DcMVcbWNGX63ew_hrKMr_AOxQq2dykQOjuag77sQclvvOXrE9M71nZ-LIN2q9Kmyu5BqMyGkT-oxlUGl1b8-q1NBKpqz1YlRVkVz0kAvqNRoONtR53rRpZArPyubj_AabfKI9YnuzdfBU8P2OfdEod6daYrsS0GVkyL9QFGSGP8/JbnM-hAa5cS3Ko5CanD08sh6EG_3vr0DCvkFff2P0u8",
    "price": 2.72,
    "prevClose": 2.75,
    "absReturn": -0.029999999999999805
  },
  {
    "fullTicker": "KITT:USA",
    "baseTicker": "KITT",
    "rank": 7.4752,
    "description": "Nauticus Robotics, Inc. develops ocean robots, cloud software, and services to the ocean industry. The company offers Aquanaut, an autonomous underwater vehicle with sensor suite, which provides capability to observe and inspect subsea assets or other subsea features; Olympic Arm, an all-electric manipulator designed for a variety of intervention tasks on work class remotely operated vehicles; and ToolKITT, a software platform, which consists of interrelated products for ocean sensing, manipulation, autonomous behaviors, survey, search and recovery, and manual intervention. The company has strategic alliance with Leidos Holdings, Inc. to develop next-generation autonomous underwater systems for tackling complex missions. Nauticus Robotics, Inc. was founded in 2014 and is headquartered in Webster, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/P7b1xbV-HK3bjAJZrZ1lpQ/0h5OhCiZtUuOotQqMoi5zKN5vg-oC-b1RzWfbNMc4Rr1ycVebj7hSTMxrKXwDYPImiJqetYssD1fMUbkwxVWMNTHRP9BOLXIagocevOwEGg3gjbYZa4MTb10MKq-hllwwHcE7RVsMNkr-Tg4K72earzGOBRmMQNxxgx66V8BDc3hXcnY9-Mxm25QDJLWQ9ko/gZWNYSWtIIZuBg1l3sO4k1g-8JArGhL7Nx1bnKXrVXE",
    "price": 2.965,
    "prevClose": 2.88,
    "absReturn": 0.08499999999999996
  },
  {
    "fullTicker": "COTY:USA",
    "baseTicker": "COTY",
    "rank": 17.5847,
    "description": "Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. It operates through Prestige and Consumer Beauty segments. The company provides fragrance, color cosmetics, and skin and body care products. It offers Prestige segment products primarily through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Burberry, Calvin Klein, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Infiniment Coty Paris, Jil Sander, Joop!, Kylie Jenner, Lancaster, Marc Jacobs, Miu Miu, Orveda, philosophy, SKKN BY KIM, and Tiffany & Co. brands. The company provides Consumer Beauty segment products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Bozzano, Bourjois, Bruno Banani, CoverGirl, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, LeGer by Lena Gercke, Rimmel, Risque, Vera Wang, and Sally Hansen brands. It also sells its products through third-party distributors. The company was founded in 1904 and is headquartered in New York, New York. Coty Inc. is a subsidiary of JAB Beauty B.V.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/LdlQoOFC8V-iVVre7oCB_w/YEKvsS8QBan1FnNnw_eLWlZ64g-i612fd9yhDRGBXRWBKGTIT-bP1J0onPRLEMiPY3PXwkpeC0FwTYdJ7m7JYBDGLUCsdaAmQuAFWqr9blDdDKZ_p_xBGfQS8bVnOSUMeqiJpYHenpv8KTXvawC9OuWl3CYTH9BNS5ER3so4aTg/WhMkCTg_INi5nAWG4B--6Bz9gNovPcl4aUJqhdW4L6g",
    "price": 3.925,
    "prevClose": 4.04,
    "absReturn": -0.11500000000000021
  },
  {
    "fullTicker": "INBS:USA",
    "baseTicker": "INBS",
    "rank": 23.4006,
    "description": "Intelligent Bio Solutions Inc., a medical technology company, developing rapid, non-invasive testing, and screening solutions. The company operates intelligent fingerprinting drug screening system, a platform to analyze fingerprint sweat analysis to detect drugs abuse. It also operates biosensor platform for clinical chemistry, immunology, tumor markers, hormones, and nucleic acid diagnostic modalities. The company was formerly known as GBS Inc. and changed its name to Intelligent Bio Solutions Inc. in October 2022. Intelligent Bio Solutions Inc. was incorporated in 2016 and is headquartered in New York, New York. The company operates as a subsidiary of Life Science Biosensor Diagnostics Pty Ltd.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/zwJLryMMWfNZ3GBywJm9kw/Xu05bOSVN7Qb4FImnpcNaYm1X9T2f8haOb7MbmvcVJwQoeinEFZuLSle6QOA_HosL_5tM049UKW_4JdGppPWsJ9WdLHhUMNaExssNPudLZ5wmpqEHspypQAD2prSJCj-pdezZO5CVXv2VlmaCDtJK_VDuaXTEGE_O61_XUayBgc0nGvZHRVjUzTnU3RwZban/n2qFdmcijmHVyGJ2KD-Bw2dCwom0aRxrmc_o60H102A",
    "price": 1.05,
    "prevClose": 1.02,
    "absReturn": 0.030000000000000027
  },
  {
    "fullTicker": "DHI:USA",
    "baseTicker": "DHI",
    "rank": 33.7496,
    "description": "D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/xLePbb1K1f2vX4mKAS_Efw/AITDAPTzauEaLq5Q4gpUR3Bd5kqn59Fx7xkw7ErzJLHis8l5iVlGmO06B53cPNxFsIEIt19YPdHqTIl6wLj91KFe1oBwr39ak9uwbMmXm12CK5m_XM5QwJbQWIYu0ISbe27UhvpwY4k6Ao14Mg0PbItdlFBWA8l-zxvnXV6bm38/ORlOC8i5WbrJnJCmOAcHdLxdNUeEcA4nQCAsmraQtUg",
    "price": 170.48,
    "prevClose": 169.47,
    "absReturn": 1.009999999999991
  },
  {
    "fullTicker": "ZGN:USA",
    "baseTicker": "ZGN",
    "rank": 42.6274,
    "description": "Ermenegildo Zegna N.V., together with its subsidiaries, designs, manufactures, markets, and distributes luxury menswear, footwear, leather goods, and other accessories under the Zegna and the Thom Browne brands. It provides luxury leisurewear for men; formal suits, tuxedos, shirts, blazers, formal overcoats, and accessories; leather accessories comprising shoes, bags, belts, and small leather accessories; and fragrances. The company also offers luxury womenswear and childrenswear under the Thom Browne brand, as well as provides eyewear, cufflinks and jewelry, watches, underwear, and beachwear manufactured by third parties under licenses. It serves customers through its retail stores and online channels in Europe, the Middle East, Africa, North America, Latin America, the Asia Pacific, and internationally. The company was founded in 1910 and is based in Trivero, Italy. Ermenegildo Zegna N.V. operates as a subsidiary of Monterubello Societa' Semplice.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/B8e4rCrDgXTA9gP9vfwkGA/lOCVhLoMzKXrLwg5V8DvkD3x1LyfeQjBJRiqnelud3fCDMHf1b-pLQfXpAEQG7i7CewbWmJhnzablrxO2PDtbAOXcgiDm20k7IBY7NHKS7lUHLpD5CBJ2NIqsybZTA7HdsAfr5wjWHYbjgKRzIO1Xj9a1REy3morzX4sMYxgmsT6PtXBfVRiqhDq8qSYKV81/Qp6PYULDOFDkHxsXhrV7X8WQqc1KXm2RRqMmSG0W-Fs",
    "price": 9.515,
    "prevClose": 9.45,
    "absReturn": 0.06500000000000128
  },
  {
    "fullTicker": "VPG:USA",
    "baseTicker": "VPG",
    "rank": 58.5186,
    "description": "Vishay Precision Group, Inc. operates in the precision measurement and sensing technologies in the United States, Europe, Israel, Asia, and Canada. It operates through three segments: Sensors, Weighing Solutions, and Measurement Systems. Its product portfolio includes precision resistors, strain gages, load cells and force measurement transducers, on-board weighing systems, and control process weighing products; rolling force measuring load cell systems and pressure transmitters; web tension measurement load cells and systems; and optical strip width gages; and laser velocimeters for speed and length measurements and closed-loop crop optimization control systems for optimal strip cuts. The company also offers data acquisition systems and sensors for product safety testing; thermal-mechanical simulation systems for metallurgical research; and conditioning, data acquisition and control systems, as well as electronic displays, signal processors, microelectromechanical system sensors, cabling, system software, and communications software/hardware. Its products are used in industrial comprising waste management, bulk hauling, logging, scales manufacturing, engineering systems, pharmaceutical, oil, chemical, steel, paper, and food industries, as well as test and measurement, steel, medical, construction, agricultural, and consumer markets. The company offers its products under the Alpha Electronics, Powertron, Vishay Foil Resistors, Micro-Measurements, APR, Celtron, Revere, Sensortronics, Tedea-Huntleigh, Stress-tek, Vulcan, BLH Nobel, KELK, and DTS brands. Vishay Precision Group, Inc. was incorporated in 2009 and is headquartered in Malvern, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/KMScPTnlWCljP1HYETetHg/_7F8GvwRBreKOFJj9tCA9xNTnWgVowF2jv6ywN6b5iqs3TPSGJswJ4aUKTejfE2THfX_QRmGC67q8sQWFUHSLHeF6rB06UGLwFOqPTdRsHMlpiqnL5AilLf8oWN0c-O1xAVq6zhmblN48oXKfUmGHF5gVvKNNk_N8EhxZr2BLYmHc45g8JmweUwtfAYvPyHz/XRgOTpxLhVFMo4uuAavqWLqhyoK8z6vX_xMXc2EwVUs",
    "price": 32.39,
    "prevClose": 32.05,
    "absReturn": 0.3400000000000034
  },
  {
    "fullTicker": "CLH:USA",
    "baseTicker": "CLH",
    "rank": 72.3058,
    "description": "Clean Harbors, Inc. provides environmental and industrial services in the United States and Canada. It operates through two segments: Environmental Services and Safety-Kleen Sustainability Solutions. The Environmental Services segment collects, transports, treats, and disposes hazardous and non-hazardous waste, such as resource recovery, physical treatment, incineration, landfill disposal, wastewater treatment, lab chemicals disposal, and explosives management services; and offers CleanPack services, including collection, identification, categorization, specialized packaging, transportation, and disposal of laboratory chemicals and household hazardous waste. This segment also provides industrial maintenance and specialty industrial services; and utilizes specialty equipment and resources that performs field services. The Safety-Kleen Sustainability Solutions segment provides containerized waste, parts-washer, and vacuum services for automobile repair shops, car and truck dealers, metal fabricators, machine manufacturers, fleet maintenance shops, and other automotive, industrial, and retail customers; collects and transports for hazardous and non-hazardous containerized waste for recycling or disposal; machine cleaning and maintenance, and disposal and replenishment of clean solvent or aqueous fluids; and vacuum services to remove solids, residual oily water, and sludge and other fluids from customers' oil/water separators, sumps, and collection tanks, as well as removes and collects waste fluids found at large and small industrial locations, including metal fabricators, auto maintenance providers, and general manufacturers. This segment also manufactures, formulates, and packages lubricants and other products. Clean Harbors, Inc. was incorporated in 1980 and is headquartered in Norwell, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/NsGaIR2G9yc6HrZfVJVmGA/kFvU6j4Ds7keNyfQfkUvb7IXCj9Zgbmo1UkST6gAniP8I5WupnIlkPsr754bvAYvl7aYkDsgYjkqNRQ8XGRX5K7rhOKWH_P-Tq4AWLtUkzf65cCwq5JFGbed10ddgaHRqIrkSvAWAQuNdYKNXQRNRDWDqCdxhmqXaBgON09SrEayfeJW-IwPXNc-8EPmIkMY/CoXhl_vfQyRpKzeN3iI5cBl1z76SMukv8ch2C9te0gs",
    "price": 230.185,
    "prevClose": 232.22,
    "absReturn": -2.0349999999999966
  },
  {
    "fullTicker": "INMD:USA",
    "baseTicker": "INMD",
    "rank": 86.4523,
    "description": "InMode Ltd. designs, develops, manufactures, and markets minimally invasive aesthetic medical products based on its proprietary radio frequency assisted lipolysis and deep subdermal fractional radiofrequency technologies in the United States, Europe, Asia, and internationally. The company offers minimally invasive aesthetic medical products for various procedures, such as liposuction with simultaneous skin tightening, body and face contouring, and ablative skin rejuvenation treatments, as well as for use in women's health conditions and procedures. It also designs, develops, manufactures, and markets non-invasive medical aesthetic products that target an array of procedures, including permanent hair reduction, facial skin rejuvenation, wrinkle reduction, cellulite treatment, skin appearance and texture, and superficial benign vascular and pigmented lesions, as well as hands-free medical aesthetic products that target a range of procedures, such as skin tightening, fat reduction, and muscle stimulation. The company sells and markets its products in the United States, Canada, the United Kingdom, Ireland, Spain, Portugal, France, Belgium, Luxemburg, Italy, Germany, Austria, Japan, Australia, and India through distributors. The company was formerly known as Invasix Ltd. and changed its name to InMode Ltd. in November 2017. InMode Ltd. was incorporated in 2008 and is headquartered in Yokne'am, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/9xJT0OyPhuDPEB0bGXzmPw/UKCJy-UWAUfrZztpvdc-2-hFbyK1xHPiC0cN0y2fmMZvKcQ3JqLgTdQHzR2pScoZzp6Y8zro5sd5X675ScFPaa5JgqO0uVW0O-EwziB4qwLVrPv3_urzc6oHH7taRDyqmu0HeooHfeMdtGgRWpReVvX719P-UXBDI3aXHw4ct5A/AiEsR_DLPdiq8DBk-APwlRbsTEINxrk0KMwWkVXhqCk",
    "price": 15.11,
    "prevClose": 14.9,
    "absReturn": 0.20999999999999908
  },
  {
    "fullTicker": "PD:USA",
    "baseTicker": "PD",
    "rank": 89.0181,
    "description": "PagerDuty, Inc. engages in the operation of a digital operations management platform in the United States and internationally. The company's digital operations management platform collects data and digital signals from virtually any software-enabled system or device and leverage machine learning to correlate, process, and predict opportunities and incidents. Its platform includes PagerDuty Incident Management that provides a real-time view across the status of a digital service; AIOps that applies machine learning to correlate and automate the identification of incidents from billions of events; automation offers centralized design time and run time environment for orchestrating automated workflows; customer service operations, which is offered to orchestrate, automate, and scale responses to customer impacting issues; and artificial intelligence that helps in identifying next best action, generation of status updates, automatic generation of post-incident summaries, and others. The company serves various industries, including software and technology, telecommunications, retail, travel and hospitality, media and entertainment, and financial services. PagerDuty, Inc. was founded in 2009 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1759348800000/C9W2emJVJdSoAqIz1XlTJA/aZgNjkz3b9POlrsroEdv1_sy2TVwxx1KU84G4BqJlLJjo7rWYecpQXy-rjJU_wpZNkp0giwwkr-EyODEQKZ8Mq1EF27oA23-ktp19d_FvEgNhmgSIpnmNaxKrngZeN1SwM682rsZLM8uJrsjXHxEjYi9RpJRPpYTXllID1IRvD0/9_liGQxWFcdO21s3vQb7rk14WQp9dLwjLKAhPNqqdzY",
    "price": 16.165,
    "prevClose": 16.52,
    "absReturn": -0.3550000000000004
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 667.85,
    "prevClose": 666.18,
    "absReturn": 1.6700000000000728
  }
]