[
  {
    "fullTicker": "QXO:USA",
    "baseTicker": "QXO",
    "rank": 4.1085,
    "description": "QXO, Inc. operates as a technology and professional services company in North America. The company offers Sage, Accumatica, and other ERP software products; and provide related services, including installation, implementation, support, training, and a technical help desk. It also provides consulting and professional services; software-as-a-service solutions, such as infrastructure-as-a-service, cybersecurity, cloud hosting, business continuity, disaster recovery, data back-up, network maintenance and server applications upgrade services; and cybersecurity-as-a-service, including incident response, cybersecurity assessments, and hacking simulations for financial services, pension administration, insurance, and land and title sectors. In addition, the company offers SaaS hosting solutions; and consulting and professional, specialized programming, training, and technical support services for accounting and business management, financial reporting, managed services, ERP, human capital management, warehouse management system, customer relationship management, and business intelligence. It serves small and medium-sized businesses manufacturing, distribution, and service industries. QXO, Inc. is headquartered in Greenwich, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/4mUWo4efTijAChpLK6WyBA/BftBQvqBRytOuYvHiP7d_MdnHTCH25qjuVs9y9lPu9UizphO_7m00u7tg0_zwD9A_LqxQuP71PXt7_bZ1VfS19c4PCuvoI-xZm1pDUT6i23ugJQR7jJsgOEL21MRncNwZMIcZ5blDwetJFZ20Na2Q37oqwu-u6QX3iTbJP-_esk/mJy7POPsuKEw4LharSbtCjP9xNjXBiIUwpG1R4Bgje8",
    "price": 21.38,
    "prevClose": 22.12,
    "absReturn": -0.740000000000002
  },
  {
    "fullTicker": "AREC:USA",
    "baseTicker": "AREC",
    "rank": 13.7869,
    "description": "American Resources Corporation engages in the production of production of rare earth and critical mineral concentrates electrification market and recycled metals. It also extracts and processes metallurgical carbon and iron ore for steelmaking; and aggregates and processes waste metal and steel products used in the recycling industries. The company was founded in 2006 and is headquartered in Fishers, Indiana.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/vm0HCKMCJQThiyBO5uueVw/uW8MrhzjZ5jBR__2CiAN0pfsLIF-tA5I7GzsifIuaPDYTvsuvVVImRllP2hgBo7h1P0r71YVI76gJnCMH_fQ55tQ2vUsDvXOiDMB4kbgZ5wiyWo5znjS3L1gu27BQ-O5a8DffbXmdnL4qtqv-XsmCnVEsxOpnd-Oup_BmBKk9EANnHjeMaZlaD9bnVGZUtBu/UyqTjZO1GRFx76VKmc-_FD09kZOKrImBHEoPxxij8B8",
    "price": 2.57,
    "prevClose": 2.7,
    "absReturn": -0.13000000000000034
  },
  {
    "fullTicker": "YORW:USA",
    "baseTicker": "YORW",
    "rank": 22.5073,
    "description": "The York Water Company impounds, purifies, and distributes drinking water. It owns and operates three wastewater collection systems; ten wastewater collection and treatment systems; and two reservoirs, including Lake Williams and Lake Redman, which hold approximately 2.5 billion gallons of water. The company operates a 15-mile pipeline from the Susquehanna River to Lake Redman; and owns satellite groundwater systems in York, Adams, and Lancaster Counties, as well as two impounding dams on primary system located in York and Springfield Townships. It serves customers in the fixtures and furniture, electrical machinery, food products, paper, ordnance units, textile products, air conditioning systems, laundry detergents, barbells, and motorcycle industries in 57 municipalities within four counties in south-central Pennsylvania. The York Water Company was incorporated in 1816 and is based in York, Pennsylvania.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/zzWD9jC1nJrCyMJN6-cECw/pSsiQ_gCZcZLm29dgW8ud5hyY25_m3qgjEwqvpl1dr5xRT-zg6FvPsPgr1slmOdcNyUtkgf7Hq6QWVTJwCfV6y_9oSSoLsnUyt6H2iWl8BFzTbON-nMrPx9L7R73N7Verexn7lMP6OmlDWDy9_oL2gAenhhmpUyJoSn40Kcon-c0KpLCSMeS1cdfB-p6Up3Q/xM1Mthnc-qmqxVRscvC6tKznvhvkXRBf0Lxouo3zDbU",
    "price": 33.48,
    "prevClose": 33.3,
    "absReturn": 0.17999999999999972
  },
  {
    "fullTicker": "RMCF:USA",
    "baseTicker": "RMCF",
    "rank": 32.5755,
    "description": "Rocky Mountain Chocolate Factory, Inc., together with its subsidiaries, produces and sells confectionery products. The company offers premium chocolate candies and other confectionery products, such as clusters, caramels, creams, toffees, mints, truffles, gourmet caramel apples, ice cream, coffee, and other sundries. It also franchises and licenses retail stores that offers chocolate and other confectionary products. Rocky Mountain Chocolate Factory, Inc. was founded in 1981 and is headquartered in Durango, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/0CabWMJWTun8NVOxl3-H2A/WjEBY6YdA85dHslU03vNn4cRpenb7B0_8prxjJsdxmwSGnwEfcmGdEKH2WKeR_DN39kkofJruvfxpc0JbrsrDPEYzXB8VMbQaMWbZ033n_cLnMon2IAtKkNDJNvHlGixQ-5C2a2X3h_mh77KEV1BUwelOXhVC42_KxjZHghK8zozg0NiQwDknML8pR_IIQAH-d1stfCdWz5z9XnldtTDiQ/2Gn6Zpik9BMSurjL_6NJL8-SfznkwTweWqlVEP4tTBo",
    "price": 1.57,
    "prevClose": 1.61,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "ALTG:USA",
    "baseTicker": "ALTG",
    "rank": 33.3387,
    "description": "Alta Equipment Group Inc. owns and operates integrated equipment dealership platforms in the United States and Canada. It operates through three segments: Material Handling, Construction Equipment, and Master Distribution. The company sells, rents, and provides parts and service support for various categories of specialized equipment, including lift trucks and other material handling equipment, heavy and compact earthmoving equipment, crushing and screening equipment, environmental processing equipment, cranes and aerial work platforms, paving and asphalt equipment, and other construction equipment and related products. It also sells used equipment and replacement parts. In addition, the company offers repair and maintenance services for its equipment. In addition, the company designs and builds warehouses; provides automated equipment installation and system integration solutions; and distributes heavy construction and environmental processing equipment. It serves various manufacturing, food and beverage, automotive, municipal/government, education, pharmaceutical and medical, wholesale and retail distribution, construction, agriculture, road building, mining, recycling, and waste management sectors. Alta Equipment Group Inc. was founded in 1984 and is headquartered in Livonia, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/zEnCbGgrxdAhj2II-NvJJQ/Dw2XFB94PZTw3-1WDdN_TadQ1R0bYkQhJuMZxpWLPZ5oFsoPIvVb02H6ZGBjRQapAxoQdyoj5e_bxsHSmhKfw9NabQ58MvC5qyGrwbJQk_Mrh2C67DJ8y7J4_OIBP5PE5IaFKIr65lQUB8okC2gWsR9tXCl7HIcIX0HMXF4G1s51aTa4fIvolyUZbE10Y3Tt/89vJ0k42irrgSebmlqxyxPNK3f2Ui1iZe5kbM_H-_rE",
    "price": 5.45,
    "prevClose": 5.49,
    "absReturn": -0.040000000000000036
  },
  {
    "fullTicker": "KMPR:USA",
    "baseTicker": "KMPR",
    "rank": 46.3462,
    "description": "Kemper Corporation, an insurance holding company, provides insurance products in the United States. The company operates in two segments, Specialty Property & Casualty Insurance, and Life Insurance. The Specialty Property & Casualty Insurance segment primarily offers specialty personal automobile and commercial automobile insurance through independent agents and brokers. The Life Insurance segment primarily provides individual life, accident, supplemental health, and property insurance. The company was formerly known as Unitrin, Inc. and changed its name to Kemper Corporation in August 2011. Kemper Corporation was incorporated in 1990 and is headquartered in Chicago, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/IlWrBRGz0BVlWps9DRPAvw/R7fKdSyjfH9aYRTY3YMExfBVij2w7Pm_bKyOGuD_IzrGJxdl3RmP1DsUjibWn22P2bKfrxVa1Wzj2pz7pEfqaJIcik-d7jOwQEeyW_eYFcpmgrejXGa2oKsZmZkGp-PqhhkJi2mLXb52n5IDf43raE_axZfENC1R50r8KD4Y-po/CSY81_7u40thm_LfrT5PLbqOjMZ3DbUR3UQSGt0jFXM",
    "price": 41.26,
    "prevClose": 40.85,
    "absReturn": 0.4099999999999966
  },
  {
    "fullTicker": "UFPI:USA",
    "baseTicker": "UFPI",
    "rank": 64.3878,
    "description": "UFP Industries, Inc., together with its subsidiaries, designs, manufactures, and supplies wood and non-wood composites, and other materials in the United States and internationally. It operates through Retail, Packaging, and Construction segments. The Retail segment offers pressure-treated lumber products, including decking, fencing, and lattice; pressure-treated and fire-retardant products used primarily for outdoor decking environments; and lawn and garden products, consisting of wood and vinyl fencing and lattice, garden beds and planters, pergolas, picnic tables, and other landscaping products. This segment also provides wood plastic composites, composite decking, and related decking accessories, including aluminum railing systems, balusters, post caps, and other products; exterior siding, pattern, trim, and facia products; and pre-painted and primed shiplap and project boards. Its Packaging segment offers custom and structural packaging products, pallets, corrugate boxes, foam, labels, strapping, and films. The Construction segment provides roof trusses, cut-to-size dimensional and board lumber, plywood, and oriented strand boards; engineered wood components, including roof and floor trusses, wall panels, I-joists, and lumber packages; and alternate materials components, such as metal trusses, sheathed and pre-finished light gauge metal wall panels, aluminum balconies and decks, and aluminum rail accessories, as well as distributes siding, electrical, and plumbing products. This segment also offers wood forms and related products to set or form concrete for structures, such as parking garages, stadiums, commercial structures, and bridges; and interior fixtures, casework, and architectural millwork for retail and commercial structures. The company was formerly known as Universal Forest Products, Inc. and changed its name to UFP Industries, Inc. in April 2020. UFP Industries, Inc. was incorporated in 1955 and is headquartered in Grand Rapids, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/7VjBvK3QaoZMKvfg1EuV7w/t7az3NDzMN3MTR2lru0TGvT8MrmMYCeZEenuN7510z4KGklMvrKS34oOCSnwfvRwh6PsbjrDjQaFx8ERj1HSgoP9KWH1ToDcw4DJDqn7HpqdOTCjcZrfIhPGly5tIKpRkmKWQl2aYh8FnVsSuWRlBW3G_esBMC2q6N6xtEBWSbXx3VVtnGQhQf3Q68eGsSZ7/NGGCNuFzworvf4HcD4v39A6suvmR6_48HwQg4djIT28",
    "price": 92.31,
    "prevClose": 92.47,
    "absReturn": -0.1599999999999966
  },
  {
    "fullTicker": "ASTE:USA",
    "baseTicker": "ASTE",
    "rank": 69.5843,
    "description": "Astec Industries, Inc. designs, engineers, manufactures, markets, and services equipment and components used primarily in road building and related construction activities worldwide. The company operates in two segments, Infrastructure Solutions and Materials Solutions. The Infrastructure Solutions segment offers asphalt plants and related components, heaters, concrete dust control systems, asphalt pavers, vaporizers, concrete material handling systems, screeds, heat recovery units, paste back-fill plants, asphalt storage tanks, hot oil heaters, bagging plants, fuel storage tanks, industrial and asphalt burners and systems, blower trucks and trailers, material transfer vehicles, soil stabilizing-reclaiming machinery, wood chippers and grinders, milling machines, soil remediation plants, control systems, pump trailers, concrete batch plants, liquid terminals, storage equipment and related parts, polymer plants, concrete mixers, cold central plant recycle systems, industrial automation controls, and telematics platforms, as well as service, construction and retrofits, and engineering and environmental permitting services. The Materials Solutions segment designs and manufactures crushing equipment, mobile plants, bulk material handling solutions, vibrating equipment, screening equipment, electrical control centers, modular plants and systems, conveying equipment, plant automation products, portable plants, and mineral processing equipment, as well as offers consulting and engineering services. It provides its products to asphalt or concrete producers; highway and heavy equipment contractors; utility contractors; sand and gravel producers; construction, demolition, recycle and crushing contractors; forestry and environmental recycling contractors; mine and quarry operators; port and inland terminal authorities; power stations; and domestic and foreign government agencies. The company was incorporated in 1972 and is headquartered in Chattanooga, Tennessee.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/eDqdsIFuqGPyuXdKrMibQg/Wpbh0ET35tLzvQFz3H22NiB7JTwySRGwDi2dG872IX29KLUEM7VDktL0gXEh3Z1tja-MVQGYJ5TJ_cAEPJztKw_Ap0Sh5ckOTYWM71JHeGYP4aHftYo2VF210_yTrKedbcumUAeJPty0096yJ0K4_Z8KD2Tc4h09nAzE-fl6zBFg0URnKvq-5fGTXoRpSLf8/vtp4Y3b16kGRwvREvd0IaomU_GuXXS0xHoy29pi3AcY",
    "price": 46.55,
    "prevClose": 47.16,
    "absReturn": -0.6099999999999994
  },
  {
    "fullTicker": "GRMN:USA",
    "baseTicker": "GRMN",
    "rank": 80.8379,
    "description": "Garmin Ltd. designs, develops, manufactures, markets, and distributes a range of wireless devices worldwide. The company offers running and multi-sport watches; cycling products; smartwatch devices; scales and monitors; Garmin Connect and Garmin Connect Mobile, which are web and mobile platforms where users can track and analyze their fitness, activities and workouts, and wellness data; and Connect IQ, enables third parties to create applications that run on Garmin devices. It also provides adventure watches; outdoor handhelds and satellite communicators; golf devices; consumer automotive; dog devices; InReach and Gramin response communication device; and Dive devices. In addition, the company designs, manufactures, and markets various aircraft avionics solutions, including integrated flight decks, electronic flight displays and instrumentation, navigation and communication products, automatic flight control systems and safety-enhancing technologies, audio control systems, engine indication systems, traffic awareness and avoidance solutions, ADS-B and transponders, weather information and avoidance solutions, datalink and connectivity solutions, and portable GPS navigators and wearables, as well as service products to the aviation market. Further, it offers chartplotters and multi-function displays, cartography products, fishfinders, sonar products, autopilot systems, radars, compliant instrument displays and sensors, VHF communication radios, handhelds and wearable devices, sailing products, audio products, digital switching products, trolling motors, and lighting products; and domain controllers and infotainment units, as well as software, map database, cameras, wearables, and automotive solutions. The company sells its products through independent retailers, dealers, distributors, installation and repair shops, and original equipment manufacturers, as well as online webshop. Garmin Ltd. was founded in 1989 and is based in Schaffhausen, Switzerland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/GIOqph1_i8HG2dibpGXumQ/bPDWqkzM4uPkcd93jLz8slbqQGNhGCHyK6izVLOLqaXcd45mnEY7bQjJglPvHTN4wCY6onGWg18EuBftKfgWDbopv91VCxTZjkboPVGVpU-KnNDQWxuwzfnsbEle9zM89LBBw9mJI0shqwaFvdmr0xM5ZbtlGAgpNP6FJY9uVns/iwVJw6z_rH2WKcoGtFB8C013GYkG_LyH9xyyb1s5bF0",
    "price": 208.36,
    "prevClose": 209.883419669311,
    "absReturn": -1.5234196693109823
  },
  {
    "fullTicker": "MRK:USA",
    "baseTicker": "MRK",
    "rank": 93.8129,
    "description": "Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The company offers human health pharmaceutical for various areas, including oncology, vaccines, hospital acute care, cardiovascular, virology, neuroscience, and diabetes under the Keytruda, Welireg, Gardasil, ProQuad, M-M-R II, Varivax, Vaxneuvance, RotaTeq, Pneumovax 23, Bridion, Dificid, Zerbaxa, Noxafil, Winrevair, Adempas, Verquvo, Lagevrio, Isentress/Isentress HD, Delstrigo, Pifeltro, Belsomra, Januvia, and Janumet brands. It also provides veterinary pharmaceuticals, vaccines and health management solutions and services, such as livestock products under the Nuflor, Bovilis/Vista, Bovilis Cryptium, Banamine, Estrumate, Matrix, Resflor, Zuprevo, Revalor, Safe-Guard, M+Pac, Porcilis, Circumvent, Nobilis/Innovax, Paracox and Coccivac, Exzolt, Slice, Imvixa, Clynav, Aquavac/Norvax, Aquaflor, Flexolt brands; Allflex Livestock Intelligence solutions for animal identification, monitoring and traceability; and companion animal products under the Bravecto One-Month, Bravecto Injectable/Quantum, Bravecto Plus, Sentinel Spectrum, Sentinel Flavor Tabs, Optimmune, Nobivac NXT, GilvetMab, Otomax, Mometamax, Mometamax Ultra, Posatex, Caninsulin/Vetsulin, Panacur, Regumate, Prestige, Scalibor/Exspot, Sure Petcare, and Home Again brands. The company has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates; AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications; licensed to develop, manufacture and commercialize LM-299, a novel investigational PD-1/VEGF bispecific antibody from LaNova; and collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/48/48/1765634400000/axjrgFAO86ChdkvSALHZzw/LmNMOVkzIPAn_tZ-5-keWZwq6HaCaorpBYSjq4KQE9Bc51tbONhm2CMHL95ZFTxPIxqErU9C33gYXEXYn-3deEobJxQWPNYJL9Ea9PA77ZM5LqRGm3JXJgvvCmmYBfMUo8h4ghpCSItkIe4C9wjKx3tOKHTXfet-0adT7QKlas8/zZBdx_bWnU0OhhdoEOD94_-ycUISEr49IDkmbiQOoMk",
    "price": 100.3,
    "prevClose": 99.01,
    "absReturn": 1.289999999999992
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 681.76,
    "prevClose": 689.17,
    "absReturn": -7.409999999999968
  }
]