[
  {
    "fullTicker": "GCTK:USA",
    "baseTicker": "GCTK",
    "rank": 5.7964,
    "description": "GlucoTrack, Inc., a medical device company, focused on the design, development, and commercialization of novel technologies for people with diabetes in the United States. It develops GlucoTrack, a noninvasive glucose monitoring device that helps people with diabetes and pre-diabetics to obtain blood glucose level readings without the pain. The company was formerly known as Integrity Applications, Inc. and changed its name to GlucoTrack, Inc. in November 2021. GlucoTrack, Inc. was founded in 2001 and is based in Rutherford, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/Tp38o8XZdzhL2HCq0nncEA/boX0eD8xWnIT-QRo_FPZgYDH-1TqQbn7qUTYTEgBMpYsZl6b4GuAM0FcVJ0u2e9QlLt6gbaOyzauZqGonDg4w-TaCgoJ1hBCxS_pms768J-XcN1Lk9Y5yxn0bqb5hyz18iAfqAiN6WtsNYvVXP99gd3sVfcnKRFHz4jfbEOKi721HSrUifAdJ1bQMQdJfgiv/vtF_8EBRWquVUyHv14ano1wFIOur9Rsa41xvcjWcHxM",
    "price": 6.6,
    "prevClose": 6.49,
    "absReturn": 0.10999999999999943
  },
  {
    "fullTicker": "CENX:USA",
    "baseTicker": "CENX",
    "rank": 7.5982,
    "description": "Century Aluminum Company, together with its subsidiaries, produces and sells standard-grade and value-added primary aluminum products in the United States and Iceland. It also owns and operates a carbon anode production facility located in Vlissingen, the Netherlands, as well as engages in the bauxite mining and alumina refining business in Jamaica. The company was founded in 1995 and is headquartered in Chicago, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/gueqArMT_5EamipUpSfs3Q/TyquZUi-crE5Ijr52VJEhCDAH6twMll24_A9h4X_g1HqQ3FOy1YhK4p-BFjTSyud5vZjxrt-swa7n-A4J87NZBcowdXt1jazZr32atn-wW6PacXvHsenQpOgMwoKtgOCVvcNDspVjLA2eTjLtRIvUGX6kWIS_2LiYjOMIFLoTVPjbGGSwcy8hWv0p-pp_SXq/H9_o_j1D6dWPiyz93yGy-bfgCSnzDQ41w1ZwzcXSfsg",
    "price": 31.355,
    "prevClose": 30.79,
    "absReturn": 0.5650000000000013
  },
  {
    "fullTicker": "GDC:USA",
    "baseTicker": "GDC",
    "rank": 19.4969,
    "description": "GD Culture Group Limited, together with its subsidiaries, engages in virtual content production business. It is also involved in ai-driven digital human creation and customization; live streaming and e-commerce; and live streaming interactive game. The company was formerly known as Code Chain New Continent Limited and changed its name to GD Culture Group Limited in January 2023. GD Culture Group Limited is based in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/K-h_FquLzxyO4wO9qlGkvg/VbLOXteukPNdgCzM86HdJEKJ_EhIV2vjEHUUKVqmGbnmQxZ704AqRDLzAxqgszl1Lcsj6GruUAf6tVFHaHZMK8xfcj8xf4ve-Xwd8FvJHG6iazevNYan5U0XeKh7ddpNoYsvBq9wtrpVjstjcUifmAqDkazUHmvNVKDwomNhWIo55z741kXpef0SeBgaVhD6/kmEAVjSckBdc7_Um5DUeUL-oH_XksL2HRCfXzTHQkiI",
    "price": 4.54,
    "prevClose": 4.57,
    "absReturn": -0.03000000000000025
  },
  {
    "fullTicker": "LNW:USA",
    "baseTicker": "LNW",
    "rank": 31.0046,
    "description": "Light & Wonder, Inc. operates as a cross-platform games company in the United States and internationally. The company operates through three segments: Gaming, SciPlay, and iGaming segments. The Gaming segment sells game content and gaming machine; video gaming terminals; video lottery terminals, including conversion kits and spare parts; and table game products, including automatic card shufflers, deck checkers, table roulette chip sorters and other land-based table gaming equipment. It also leases or provides gaming content, gaming machines, and server-based system; sells and supports casino-management system based software and hardware; and licenses proprietary table games content to commercial, tribal, and governmental gaming operators. The SciPlay segment develops, markets, and operates social games on various online platforms. It sells virtual coins, chips, or bingo cards, which players can use to play slot games, table games, and bingo games. The iGaming segment provides a suite of digital gaming content, distribution platforms, player account management systems, and other iGaming content and services. This segment also offers the Open Platform System, which offers a range of reporting and administrative functions and tools providing operators control over various areas of digital gaming operations. Light & Wonder, Inc. was incorporated in 1984 and is headquartered in Las Vegas, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/RAOkqzU-rZSMqocNh9zTSQ/8MvPzbLM2H7ojfU0dHHZdoj1zLzbNw_rOyHxitg0BnnSoiYR4H2Pun8ZFKbp1olEBnWuqngpPuZn2aCdI2iB1so6Fa6dlyQOrz19xJFUbNpU9i8JzTq-kXxA7Swvrg-ywXrt_ZTnC_mcKKZ2hYLnCxX0jN8v7e1dwA5ZS5Zju796zFsx0txI-o7x7Eob-d8j/8_mY8U44KvdlDOYA_dh4FgKC07Fz2lx9feY7c5SzhTg",
    "price": 76.235,
    "prevClose": 75.89,
    "absReturn": 0.34499999999999886
  },
  {
    "fullTicker": "MCRB:USA",
    "baseTicker": "MCRB",
    "rank": 33.3163,
    "description": "Seres Therapeutics, Inc., a microbiome therapeutics company, develop microbiome therapeutics to treat the modulation of the colonic microbiome. It develops a novel class of biological drugs that are designed to treat by modulating the microbiome to restore health by repairing the function of a disrupted microbiome to a non-disease state. The company's lead product candidate is VOWST, an oral microbiome therapeutic that has completed Phase III clinical trial for the treatment of recurrent Clostridioides difficile infection. Its product pipeline also includes SER-155, an investigational oral fermented microbiome therapeutic which is in Phase 1b clinical trials for the treatment of gastrointestinal infections, bacteremia, and graft versus host disease in immunocompromised patients including patients receiving allogeneic hematopoietic stem cell transplantation. In addition, the company engages in the development of SER-287 which is in Phase 2b and SER-301 that is in Phase 1b to treat ulcerative colitis. Further, it has license Agreement with NHSc Rx License GmbH for the therapeutic products based on the microbiome technology, which includes VOWST product candidate, which is developed for the treatment of CDI and recurrent CDI; and collaboration license agreement with Société des Produits Nestlé S.A. (Nestlé) for the development and commercialization of certain product candidates for the treatment and management of CDI and inflammatory bowel disease including UC and Crohn's disease. The company was formerly known as Seres Health, Inc. and changed its name to Seres Therapeutics, Inc. in May 2015. Seres Therapeutics, Inc. was incorporated in 2010 and is headquartered in Cambridge, Massachusetts.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/o64Oda3qLDq8yCZYLHZw9A/ScaJKWy_A9CSm8TH-p0iClUEGlnrB0sfByT2bE3S4IeCsKHsOgZoGJER7LEw2n9QZsUfb1XLun35S4glA9js2LWg-oVbdMdjvC-cRW_r8U_-PMHlO6nYuBdfjQyxBCwX-zA5yWX9mnhmDqZJaPcV39Ar2ci1L2_nmZXce_f45FH-IGSB0FSM-LdwVBRRZaoK/abHAN3iq9q8DOpp2wGkrNsNXsamCL4kSfKv71_D7bh0",
    "price": 18.03,
    "prevClose": 17.85,
    "absReturn": 0.17999999999999972
  },
  {
    "fullTicker": "QSR:USA",
    "baseTicker": "QSR",
    "rank": 48.5297,
    "description": "Restaurant Brands International Inc. operates as a quick-service restaurant company in Canada, the United States, and internationally. It operates through six segments: Tim Hortons, Burger King, Popeyes Louisiana Kitchen, Firehouse Subs, International, and Restaurant Holdings. The company owns and franchises Tim Hortons, a coffee and baked good restaurant chain that offers beverages, sandwiches, wraps, flatbread pizzas, and others; Burger King, a quick service hamburger restaurant chain that offers flame-grilled hamburgers, chicken, and other sandwiches; Popeyes, a quick service chicken concept that offers a Louisiana style menu, including fried bone-in chicken, chicken sandwiches, chicken tenders, wings, fried shrimp, and regional items; and Firehouse Subs, which offers subs with meats and cheese, as well as chopped salads, chili, soups, soft drinks, and other sides. Restaurant Brands International Inc. was founded in 1954 and is based in Toronto, Canada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/pHzv1vFaOLNCjcA2XPYHlg/1nKkaqtaxctVG7odubzyX_J6Sxm4xEVozlL4DhLav2CCPTe-y7zSSiUPW1SqE6X2rnABVCcEm8BrIdbO6ZGX6bMXf3Q02oZmF2pyU7LYCURsbAUXeOEHRw_FTy7-4kVCxLqJLOd8Helcjjr0TLmcajRxPo-fLTKbHuEf5QHWIshcVoBggWQl8ogZQhJ10TykDrUvZIXjjlHPXfVs6G48WA/E9cYIOGNXVg_Lf2pMU7GlEgW8nWK8h0_AiSXN4V5B4U",
    "price": 67.49,
    "prevClose": 67.42,
    "absReturn": 0.06999999999999318
  },
  {
    "fullTicker": "GRND:USA",
    "baseTicker": "GRND",
    "rank": 63.539,
    "description": "Grindr Inc. operates social network and dating application for the lesbian, gay, bisexual, transgender, and queer (LGBTQ) communities worldwide. Its Grindr platform, a global social networking platform primarily serving and addressing the needs of gay, bisexual, and sexually explorative adults around the world. It also offers Grindr as the Global Gayborhood in Your Pocket brand. In addition, the company provides ad-supported service and a premium subscription version. Grindr Inc. was founded in 2009 and is headquartered in West Hollywood, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/C5CR9dWPzkAyq92zlPTqQQ/BTC5EBWfiWmpAmh_vMgsccpHdzwp6fDl5IO_w3yiMa5MH18QCE9z6mEahM0Rf4b1T320uTRWvDwrX8bxQKouyrCfPUb9kcYaPLx9-FIZ2BY91wi1giQVCBpG5Gmpaw03gb2Jl6Sn9cQe098Jc5ElAumI8XJtfnuIDMMfe-pHTV8/l7Q_t5VVPtxSpNIyQAEIfcGZ_zOHlPN1mJL1aLFh4X4",
    "price": 14.6,
    "prevClose": 15.06,
    "absReturn": -0.46000000000000085
  },
  {
    "fullTicker": "TWLO:USA",
    "baseTicker": "TWLO",
    "rank": 66.2077,
    "description": "Twilio Inc., together with its subsidiaries, offers customer engagement platform solutions in the United States and internationally. It operates through two segments, Twilio Communications and Twilio Segment. The company provides various application programming interfaces and software solutions for communications between customers and end users, including messaging, voice, email, flex, marketing campaigns, and user authentication and identity. It also offers software products to build direct and personalized relationships with their end users, such as segment, a platform that provides tools to harness the power of contextual data by unifying real-time information collected comprising connections, protocols, unify, engages, and AI capabilities components. Twilio Inc. was incorporated in 2008 and is headquartered in San Francisco, California",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/xi5RFd4TPbwPGN42kmNUdg/c66mxJr09TIyetEw43t8iALZHnZWCJGEq6wlytqSP2CKbJI03u6pjAOaIx-s_hfK7-QRO2j14y2ouwrB0i6rMI920kVfcLZ9YuoPhumhz0s31Ox55Qm4WhT0oh5up9nI6ymSgnhHPPCA8oTkGkyyXeUjvf_UlIwV-8naFEk9rT0/bLtUQJ_7gKIaZfETRT9KCMRmLcXq5XWt8liOnwtcvPA",
    "price": 114.54,
    "prevClose": 112.56,
    "absReturn": 1.980000000000004
  },
  {
    "fullTicker": "IT:USA",
    "baseTicker": "IT",
    "rank": 76.2536,
    "description": "Gartner, Inc. operates as a research and advisory company in the United States, Canada, Europe, the Middle East, Africa, and internationally. It operates through three segments: Research, Conferences, and Consulting. The Research segment delivers its research primarily through a subscription service that include on-demand access to published research content, data and benchmarks, and direct access to a network of research experts. The Conferences segment offers executives and teams in an organization the opportunity to learn, share, and network. The Consulting segment offers market-leading research, custom analysis, and on-the-ground support services. This segment also offers actionable solutions for IT-related priorities, including IT cost optimization, digital transformation, and IT sourcing optimization. Gartner, Inc. was founded in 1979 and is headquartered in Stamford, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/PaN7za25NonayB3EOLC1Vw/cxlmkhoqDgL6vsF5z_h3K38KgEsq_YzlvBMpKLY3ogOqe-erWe85Oy3aFT6VA_uiB3qOZl1bC3AsmKSu3U_wH9TUq85L3povScTGZU9NSYak62WVZNuijuGTL-jSYuDpahZVoz3C0qn6tBBxath8Xrc4Jx2RKFyQOkgSVj1Vrt8/fKDIKff3ZKl-9a82kJ90E8hMhUrTX2VfZUYE39Fe7ug",
    "price": 253.16,
    "prevClose": 250.21,
    "absReturn": 2.9499999999999886
  },
  {
    "fullTicker": "HIG:USA",
    "baseTicker": "HIG",
    "rank": 93.1158,
    "description": "The Hartford Insurance Group, Inc., together with its subsidiaries, provides insurance and financial services to individual and business customers in the United States, the United Kingdom, and internationally. Its Business Insurance segment offers insurance coverages, including workers' compensation, property, automobile, general and professional liability, package business, umbrella, fidelity and surety, marine, livestock, accident, health, and reinsurance through regional offices, branches, sales and policyholder service centers, independent retail agents and brokers, wholesale agents, and reinsurance brokers. The company's Personal Insurance segment provides automobile, homeowners, and personal umbrella coverages through direct-to-consumer channels and independent agents. Its Property & Casualty Other Operations segment offers coverage for asbestos and environmental exposures. The company's Employee Benefits segment provides group life, disability, and other group coverages to members of employer groups, associations, and affinity groups through direct insurance policies; reinsurance to other insurance companies; employer paid and voluntary product coverages; disability underwriting, administration, and claims processing to self-funded employer plans; and leave management solution. This segment also distributes its group insurance products and services through brokers, consultants, third-party administrators, trade associations, and private exchanges. Its Hartford Funds segment offers managed mutual funds across various asset classes; and exchange-traded funds through broker-dealer organizations, independent financial advisers, defined contribution plans, financial consultants, bank trust groups, and registered investment advisers, as well as investment management, distribution, and administrative services, such as product design, implementation, and oversight. The Hartford Insurance Group, Inc. was founded in 1810 and is headquartered in Hartford, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1761580800000/q-jfZdtd9y8i7gXWiePWWg/mVNi2HqPGPnICg3ZhTIHDC-oPdbAONprfmJECIBOadzqc5ZKlbtNX4-Cip-ue70bak4M_TDKpgDXQtnfbbxDFKhmD-OWKY5HtveE8gvJAscAwqnkx_URyXOjbmm8t9Hqb37kZfXA_DHj9orMFwe3971PwyInhmruI9dvtqc_igxUZ_hINaa9ofhOoaEzXjo-H_tHfTvsZWN81nJAkcCa8w/vdOWvtvW2-Q9gkXQICD6WJX5P7q2UDSjmxbOCv5hs1Q",
    "price": 124.865,
    "prevClose": 125.11,
    "absReturn": -0.24500000000000455
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 682.645,
    "prevClose": 677.25,
    "absReturn": 5.394999999999982
  }
]