[
  {
    "fullTicker": "LGIH:USA",
    "baseTicker": "LGIH",
    "rank": 5.307,
    "description": "LGI Homes, Inc. engages in the design, construction, and sale of homes in the United States. It markets and sells attached and detached entry-level homes and active adult offerings under the LGI Homes brand; and luxury homes under the Terrata Homes brand. The company also engages in the wholesale business, which includes building and selling homes to large institutions interested in acquiring single-family rental properties. It operates in Texas, Arizona, Florida, Georgia, New Mexico, Colorado, North Carolina, South Carolina, Washington, Tennessee, Minnesota, Oklahoma, Alabama, California, Oregon, Nevada, West Virginia, Virginia, Pennsylvania, Maryland, and Utah. LGI Homes, Inc. was founded in 2003 and is headquartered in The Woodlands, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/0y1T6kBf8dmgMi43ilOhEw/tfFGNn7z6Yb67Oq3mfMrLDDlFvSvnUvxTBbJm_pSlQCcw1IjCzlkysyUIQQiG4PR7RaVIvWanIkLv1nl0piuBNrQNmFbyZCOFSkal7pcFEMvhZZvYgGqJzyB61CE3Ho55nZrumsYFWmSMZRbxFFC_NhAwgMcfVgGsvJe8nOO5Rs/qjYaedYRFqtaR4lF6uQsD3LmJNF-HbYAQeWW1coTOws",
    "price": 44.77,
    "prevClose": 46.6,
    "absReturn": -1.8299999999999983
  },
  {
    "fullTicker": "SKBL:USA",
    "baseTicker": "SKBL",
    "rank": 13.8799,
    "description": "Skyline Builders Group Holding Limited, through its subsidiaries, provides civil engineering services to the public and private sectors in Hong Kong. It engages in the public civil engineering works, such as road and drainage work. The company was incorporated in 2024 and is based in Kowloon Bay, Hong Kong. Skyline Builders Group Holding Limited is a subsidiary of Supreme Development (BVI) Holdings Limited.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/CrGJQ80iiWY6gLBpKOAbSA/g6YX_TTf4ukbCHvxTXEHCMTOAou5nUQSvy9Z_WnB3y30HpTyqz9PvDYsxD-_J--6cKe5ZNlsGY-XQPsEyTh6PfxKFbJFcK6MYKuniRgZe7D4c1p5zUlb36QjbfKqmhRO7R-4oeHzZDjk4xoSrSg09HHzg0auOYYLZdkrz22QROSQsufUztviwYT5ToIPgl8EN7wI5hghhzATY3Ttyom84g/UTbGUdG8ZYKVTY2N9ybDe2fUZtyd_30lCWYkrYx-0hs",
    "price": 3.1,
    "prevClose": 2.78,
    "absReturn": 0.3200000000000003
  },
  {
    "fullTicker": "SAIA:USA",
    "baseTicker": "SAIA",
    "rank": 19.5611,
    "description": "Saia, Inc., together with its subsidiaries, operates as a transportation company in North America. The company provides less-than-truckload services for shipments between 100 and 10,000 pounds. It also offers other value-added services, including non-asset truckload, expedited, and logistics services. As of December 31, 2024, it operated 214 owned and leased terminals; and owned approximately 6,600 tractors and 26,200 trailers. The company was formerly known as SCS Transportation, Inc. and changed its name to Saia, Inc. in July 2006. Saia, Inc. was founded in 1924 and is headquartered in Johns Creek, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/SySwgZwCj4Fu-SUeWTRN1A/JBPd4gmCyUGUwqdgzyZKHOClmIFfh5bDZcOJ4ZnYqG46wl6ifdHAFgmTnGpBiapZkBznZr5g4DXyKO7BeetmnzYIn23e9zzIBdOmmym2vmyb5dkTgg9hY12acqqU4HeIEvcfKFWBKJE8cRaTmEIq-yUSstISMFtDv07T-qKVkiU/YY0A_yK9XXIvHHwD567e8A7L_JjsKg86uN7FEUHdI18",
    "price": 294.23,
    "prevClose": 315.38,
    "absReturn": -21.149999999999977
  },
  {
    "fullTicker": "SPB:USA",
    "baseTicker": "SPB",
    "rank": 24.0687,
    "description": "Spectrum Brands Holdings, Inc. operates as a branded consumer products and home essentials company in North America, Europe, the Middle East, Africa, Latin America, and Asia-Pacific regions. It operates through three segments: Home and Personal Care (HPC); Global Pet Care (GPC); and Home and Garden (H&G). The Home and Personal Care segment provides home appliances under the Black & Decker, Russell Hobbs, George Foreman, PowerXL, Emeril Legasse, Copper Chef, Toastmaster, Juiceman, Farberware, and Breadman brands; and personal care products under the Remington brand. The GPC segment provides Rawhide chews, dog and cat clean-up, training, health and grooming products, small animal food and care products, rawhide-free dog and cat treats, and wet and dry pet food for dogs and cats under the Good'n'Fun, DreamBone, GOOD BOY, SmartBones, IAMS, EUKANUBA, Nature's Miracle, FURminator, Dingo, 8IN1, Meowee!, and Wild Harvest brands. This segment also offers aquarium kits, stand-alone tanks, and aquatics equipment and consumables under the Tetra, Marineland, Instant Ocean, GloFish, and OmegaSea brands. The H&G segment provides outdoor insect and weed control solutions, and animal repellents under the Spectracide, Garden Safe, Liquid Fence, and EcoLogic brands; household pest control solutions under the Hot Shot, Black Flag, Real-Kill, Ultra Kill, The Ant Trap, and Rid-A-Bug brands; household surface cleaning, maintenance, and restoration products, including bottled liquids, mops, wipes, and markers under the Rejuvenate brand; and personal-use pesticides and insect repellent products under the Cutter and Repel brands. The company sells its products through retailers, e-commerce and online retailers, wholesalers, and distributors. Spectrum Brands Holdings, Inc. was founded in 1906 and is headquartered in Middleton, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/0AEWJM6xqSFeoqxLKRvTLQ/kGhH51K7z663ChhLB0E98Ap0xvjbuxju07MsRnfzIzFHeO7u6xAEzzjhT-rifrOGHghZdFX8RSfmqyTCUvllpYNummSVHiYK7A-r9QaRGx4mn_ZNb3gEqT_PzDsYF8kktwwK8e-dCRqBc2pRJC5t0Jg_G0uW_r51qTl48Y0GJvOY_h1-iGra1F7jSLg4tDDl/covF64ioTwYV7KsLIrejnJWuEv2nz8FvZPZu2Qjbz1s",
    "price": 50.35,
    "prevClose": 51.52,
    "absReturn": -1.1700000000000017
  },
  {
    "fullTicker": "MED:USA",
    "baseTicker": "MED",
    "rank": 37.7105,
    "description": "Medifast, Inc., through its subsidiaries, operates as a health and wellness company that provides habit-based and coach-guided lifestyle solutions to address obesity and support a healthy life in the United States. The company offers weight loss and weight management plans; and GLP-1 support plans that provide access to GLP-1 medications where clinically appropriate under the OPTAVIA brand name. It also provides bars, puffs, cereal, crunchers, drinks, hearty choices, oatmeal, pancakes, pudding, soft serve, shakes, smoothies, soft bakes, and soups, as well as provides coaching support along with community, nutrition, and healthy habits, and helps people in their weight loss journey. It markets its products through point-of-sale transactions, as well as through ecommerce platform. Medifast, Inc. was founded in 1980 and is headquartered in Baltimore, Maryland.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/WXbTV6isS7_yi8CX_3IkVw/QglCFF5cm4GYgTGueVgAckm-fljSebclT_Da8eshW5KUmu-DLYY4TWiS4smfLBr0ggU1d-_IE2sR28pVoVqg-56Tk4eY-0YkAmHZ7E76h_lDU7LK4oUdbkyR5I3kO8oVR2RusYRbRnQ122Qcsds59WkpzvTRRTpT6PuL3TvXPoE/vnUVbfW5rPY3fqgWAxsvctaiPXaNXWEnw-Sy4CtQlhM",
    "price": 13.27,
    "prevClose": 14.03,
    "absReturn": -0.7599999999999998
  },
  {
    "fullTicker": "WFF:USA",
    "baseTicker": "WFF",
    "rank": 52.696,
    "description": "WF Holding Limited manufactures and sells fiberglass reinforced plastic (FRP) products in Malaysia. It offers filament wound and molded tanks, thermoplastic tanks, lining products, ducting and fitting products, air pollution control equipment, and custom-made products. The company also offer delivery, installation, repair, and maintenance services, as well as on-site consultation services. It serves chemical processing, water and wastewater treatment, and power generation. The company was incorporated in 2023 and is based in Shah Alam, Malaysia. WF Holding Limited is a subsidiary of Lew Capital Private Limited.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/LWG-aZkg1MCNhZtkfHEXqQ/9NaseqMuDmVONmDyJXUwZnq4zNc5EqX-xFzrqiARF-Jt6D0yvC54zcmnn_j9zpAoE2F8wy-FYPIs7IMx96rIHtJ8LvGN62H-rS876aCik9J6Xs10YbQcHjym7JnlXoPQEdJs-Y0iyZ827p6Nuayctw/hcYojeAcrLdckBNEEna3saRCl3YbM1q262jPuF37fqM",
    "price": 0.8922,
    "prevClose": 0.961,
    "absReturn": -0.06879999999999997
  },
  {
    "fullTicker": "PAY:USA",
    "baseTicker": "PAY",
    "rank": 62.6297,
    "description": "Paymentus Holdings, Inc. provides cloud-based bill payment technology and solutions in the United States and internationally. The company offers electronic bill presentment and payment services, enterprise customer communication, and self-service revenue management to billers through a software-as-a-service technology platform. Its platform's payment processing includes credit cards, debit cards, eChecks, and digital wallets. It serves utility, financial service, government, insurance, telecommunication, real estate management, education, consumer finance, healthcare, and small business industries. The company was founded in 2004 and is headquartered in Charlotte, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/gYcPc6VZVgBpsOjosDkopA/sLdGkug8Y-IE7RC1NY9urj9pnG2DSua4z84aBsTJPKypoTVUETRQprUqgkCD4RtL3KLsA97AkA5Er1U6bbax50BK47mr9qZ3i4Cp7w7uVWHLu53vc066YsY0sSQogOHD13ABbu3GsAVvxxxr_dskLQOQk_5ZXLzqb7QJJQvErio/k7H8BdBA_CquXZj-ubWQUKofn0qFA0aRCTu_Pe8ABMc",
    "price": 30.3,
    "prevClose": 31.91,
    "absReturn": -1.6099999999999994
  },
  {
    "fullTicker": "MSGM:USA",
    "baseTicker": "MSGM",
    "rank": 72.1551,
    "description": "Motorsport Games Inc. develops and publishes multi-platform racing video games in the United States. It operates through Gaming and Esports segments. The company offers rFactor 2, a realistic racing simulation game; NASCAR Heat Mobile, a racing experience for mobile devices; NASCAR Heat 3, NASCAR Heat 4, NASCAR Heat 5, NASCAR Heat Ultimate Edition, and NASCAR 21: Ignition, which are racing video games; KartKraft, a kart racing simulator; NASCAR Rivals, a racing video game; and Le Mans Ultimate, a official game of the FIA World Endurance Championship and 24 Hours of Le Mans. It also organizes and facilitates esports tournaments, competitions, and events for its licensed racing games, as well as on behalf of third-party racing game developers and publishers. The company offers its products for game consoles, personal computer, and mobile platforms through various retail and digital channels, including full-game and downloadable content. The company was founded in 2018 and is headquartered in Miami, Florida. Motorsport Games Inc. operates as a subsidiary of Driven Lifestyle Group LLC.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/Mgv_5HAdxcDrjrKNwR2sdg/f1xJRFy5d_ErTF9FAZSwAAcESWLX-eUQztKjDETtz8g1LzGQwHAogb-NN7Wvru3G2VChFeG1dEHjzJQKxnPUraiLeskXBptzRgrvFVVwdAtTPCG84LHonZadMz3lTS4BqnavXeUTLBkHh1PiBEXgRBXvI8iNpy2Zmpp9eRREkZ5KMaX4hO6Kj9BviQIV9Dy9/FftfTCJrkhYLhSA1I-afRblG-jEJ44pGWxBiel7AUoU",
    "price": 2.42,
    "prevClose": 2.57,
    "absReturn": -0.1499999999999999
  },
  {
    "fullTicker": "BCPC:USA",
    "baseTicker": "BCPC",
    "rank": 78.0235,
    "description": "Balchem Corporation develops, manufactures, and markets specialty performance ingredients and products for the nutritional, food, pharmaceutical, animal health, medical device sterilization, plant nutrition, and industrial markets worldwide. It operates through three segments: Human Nutrition and Health, Animal Nutrition and Health, and Specialty Products. The Human Nutrition & Health segment supplies ingredients in the food and beverage industry. Its products include spray dried and emulsified powders, extrusion and agglomeration, blended lipid systems, liquid flavor delivery systems, juice and dairy bases, chocolate systems, and cereal systems, as well as ice cream bases and variegates. This segment offers specialty vitamin K2; microencapsulation solutions for various applications; and human grade choline nutrients and mineral amino acid chelated products for nutrition and health applications. The Animal Nutrition & Health segment provides microencapsulated products to enhance health and milk production and delivering nutrient supplements in ruminant animals; chelation technology, which offers enhanced nutrient absorption for various species of production and companion animals; methylsulfonylmethane; and choline chloride, a nutrient for monogastric animal health. The Specialty Products segment distributes ethylene oxide and ammonia primarily for use in the health care industry; and single use canisters for sterilizing re-usable devices. This segment also markets and sells propylene oxide, a fumigant to aid in the control of insects and microbiological spoilage, as well as to reduce bacterial and mold contamination in shell and processed nut meats, processed spices, cacao beans, cocoa powder, raisins, figs, and prunes; and chelated minerals for high value crops. It sells its products through sales force, independent distributors, and sales agents. The company was incorporated in 1967 and is headquartered in Montvale, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/zpWL-JCewzoTm2Ev21_cKw/_NI6lIt0YZBwyum_VPqIk8V-MVZoYOb7E-r1G_eyRb29KLMIcdh4URcWIcIt4s4MA0pDPUwzQV3kv0gZSTNMIIsFJzuMM2r7OEQyGCKWuoZEniCREtuXdsE05DVnYI8XOS24cHyBXM-qgF1jD_w_jUnjcyB19iiyuEZ5FhOnCCE/HmUEXJW-Yopz-7seuviRyZZ3ywW2P2nt454iHQq_ntM",
    "price": 144.64,
    "prevClose": 140.3,
    "absReturn": 4.339999999999975
  },
  {
    "fullTicker": "TRIP:USA",
    "baseTicker": "TRIP",
    "rank": 90.1344,
    "description": "TripAdvisor, Inc., an online travel company, engages in the provision of travel guidance products and services worldwide. The company operates through three segments: Brand Tripadvisor, Viator, and TheFork. The Brand Tripadvisor segment offers travel guidance platforms for travelers to discover, generate, and share authentic user-generated content in the form of ratings and reviews and opinions for destinations, points-of-interest, experiences, accommodations, restaurants, and cruises. The Viator segment operates an online marketplace that connects travelers to discover and book tours, activities, and attractions from experience operators. TheFork segment provides an online marketplace, which enables diners to discover and book online reservations at restaurants. The company was founded in 2000 and is headquartered in Needham, Massachusetts. Tripadvisor, Inc. is a subsidiary of Liberty TripAdvisor Holdings, Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/46/46/1760364000000/-tlgbF4M4SNnlvz13QLmsg/eQK8PR4iVFMh8mOqPECg0t9JBVtvJAaPNYW55PfVPpNOCFJ4tXIBdgaBhSmzhSlz7D7vGj9rxjSLTeW8_OiSB_2WqiFTFfZ55_1L9EQziDI6h_RcRG8wc0qyTI2nZVhv8YTmaUPFhNS0v1kxPxwPt7OyiPswv7Jwnx7uDYZ6WK3WfPAIKPMEU6q90SBQRfLX/Vomr3UnFG5Q5L6up7zZLcdDcLi4KpJaNniKc02ZxxxQ",
    "price": 14.91,
    "prevClose": 15.45,
    "absReturn": -0.5399999999999991
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 653.02,
    "prevClose": 671.16,
    "absReturn": -18.139999999999986
  }
]