[
  {
    "fullTicker": "RR:USA",
    "baseTicker": "RR",
    "rank": 0.6992,
    "description": "Richtech Robotics Inc. develops, manufactures, deploys, and sells robotic solutions for automation in the service industry in the United States. The company offers indoor transport and delivery, sanitation, and food and beverage automation solutions, such as Matradee, a server assistant robots; Medbot, designed for hospital deliveries; Titan for heavy duty payloads in central distribution facilities and general transport duties; and Skylark, a service robots customized for hotel and room service applications. The company provides DUST-E, a commercial cleaning robots; ADAM and Scorpion, a food and beverage automation robots; and operates the Clouffee & Tea self-owned restaurant brand that offers coffee and tea products. In addition, it offers installation, shipping, maintenance, and warranty services. The company markets its products through digital marketing, sales outreach, industry exhibitions, client referrals, online inquiries, and a network of distribution channels. It serves restaurants, hotels, casinos, senior living facilities, factories, and retail centers, as well as hospitals, resorts, factories, schools, stadiums, movie theaters, and others. The company was formerly known as Richtech Creative Displays LLC and changed its name to Richtech Robotics Inc. on June 22, 2022. Richtech Robotics Inc. was incorporated in 2016 and is headquartered in Las Vegas, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/AprGQDEMCFnS135XNGvFcA/gs-cghfUQMphriHcJR4sEJv8ecbCWYJil-A7rW0XNeS02jt86ZSEsKDSbLSZG8Ki9Ersuh309E6Z725VJWdmvrlEwaf0M3NUGGpEHpEb5muebsAbV_Z1otwaj_84RoP6M0yFDpRvY22tPliuHjSF57X6daayy7ptsBqZMhSDxT16P2hf2MVPy0b7nHdqpG8L/jGgBWeY-DYpZIYH_mar48R-w8ogtF9w1MWxYnnuJycI",
    "price": 2.175,
    "prevClose": 2.2,
    "absReturn": -0.025000000000000355
  },
  {
    "fullTicker": "AERG:USA",
    "baseTicker": "AERG",
    "rank": 9.7347,
    "description": "Applied Energetics, Inc. engages in the provision of advanced optical technologies and ultrashort pulse directed energy solutions utilizing dual-use laser and optical technologies to defense, national security, industrial, biomedical, and scientific customers worldwide. It develops and holds various intellectual property rights such as laser guided energy and laser induced plasma channel technology for used in high-tech directed energy systems. The company was founded in 1990 and is headquartered in Tucson, Arizona.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/R9MHVMTGWWYUIxkXrvkP6g/5sCRxTX9d6NOsghnr2iWJNO7yNHpydk3z2CQkGW-wKWVchOS4GfOWd5x3T-CwmXzDzrjqnh00UsfxASNCB-qUXZwXjCAd-_Wa18p-PZHeeXSC5qC_T7CTc7542NAQBqLOGk9VT9SXCxA_fPphxuqZshMuE9xYg2UUmOWSd7G3WtSDTk8Fl8OHlHN7hoeOG6R/PZ3Y5onFWvYSNFWSklEvJB57wGklOKi3qtq_go26d5w",
    "price": 2.45,
    "prevClose": 2.505,
    "absReturn": -0.054999999999999716
  },
  {
    "fullTicker": "WEX:USA",
    "baseTicker": "WEX",
    "rank": 18.071,
    "description": "WEX Inc. operates a commerce platform in the United States and internationally. The Mobility segment offers fleet vehicle payment solutions, transaction processing, and information management services; and provides account activation and account retention services; authorization and billing inquiries, and account maintenance services; account management; credit and collections services; merchant services; analytics solutions; and ancillary services and offerings. This segment markets its products directly and indirectly to businesses and government agencies with fleets of commercial vehicles; and indirectly through co-branded and private label relationships. The Corporate Payments segment provides payment solutions, including embedded payments; and accounts payable automation and spend management solutions. This segment also markets its products directly and indirectly to customers in travel, fintech, insurance, consumer bill pay, and media verticals. The Benefits Solutions segment offers software-as-a-service (SaaS) platform for consumer directed healthcare benefits and full-service benefit enrollment solutions. In addition, its SaaS platform includes embedded payment solutions and plan administration services for consumer-directed health benefits; COBRA accounts; and benefit enrollment and administration services. Further, it offers custodial and depository services for health savings accounts; and markets its products through third-party administrators, financial institutions, payroll providers, and health plans. The company was formerly known as Wright Express Corporation and changed its name to WEX Inc. in October 2012. The company was founded in 1983 and is headquartered in Portland, Maine.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/ib1MwF35xm2SgnFDyHFruQ/iUhib__uCKT5O2pZaflFRSO1Nwn_vuitZ9n7xyO2KCgnUIu5V3FLrbzFZLpXLG60VzYMopE_V0852PrO3XAyA7KXnugwk5tqDfJwlpNOw6QZ46BXZ5qFt8S6aC6vlR_QiCxSh9MdurT3K4LLnZIN_LZegg3DM-MQ6MpfVpRWylQ/-GgH97UkVtt8fwNXBjYmqVWt6KkLcRiwO61elu9JmA0",
    "price": 141.65,
    "prevClose": 142.11,
    "absReturn": -0.46000000000000796
  },
  {
    "fullTicker": "XYZ:USA",
    "baseTicker": "XYZ",
    "rank": 26.7479,
    "description": "Block, Inc., together with its subsidiaries, builds ecosystems focused on commerce and financial products and services in the United States and internationally. It operates through two segments: Square and Cash App. The Square segment offers commerce products for restaurants, appointments, retail, point of sale, online, online checkout, and invoices, as well as virtual terminals, risk and order managers, and payment and commerce application programming interfaces; managed payment services; software solutions; hardware products, such as registers, terminals, stands, and readers for contactless and chips; banking services consisting of lending, instant transfer, and checking and savings accounts; and full-service setup and support services. This segment also provides loyalty, marketing, team management, and payroll services; and gift cards. The Cash App segment offers financial tools within the mobile Cash App, including peer-to-peer payments, bitcoin, and stock investment brokerage; Cash App Card, a debit card; direct deposit, cash boost, and tax preparation services; and Afterpay, a buy now, pay later platform. This segment also provides Pay in 4, monthly payment solutions, advertising and affiliate, shop directory, and Cash App Pay services; and business accounts, and Afterpay and Afterpay Plus cards. In addition, the company operates TIDAL, a platform for musicians and fans; TBD, an open developer platform focused on making the decentralized financial world accessible; Bitkey, a self-custody bitcoin wallet; and Spiral, which focuses on bitcoin open source work. It serves businesses, sellers, and individuals through e-commerce and retail distribution channels. The company was formerly known as Square, Inc. and changed its name to Block, Inc. in December 2021. Block, Inc. was incorporated in 2009 and is based in Oakland, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/Z1AU_6oNmOAYViOGDlVYBA/xHpSN-na_DtoD6G40EbmssnCljN8e8iMMnKhW4RR0pC4zKZegCVKWykPWTArWeCNVZGHwRLq5_WlJYeSEejwohyuPTJKdycJMtUn5bHQprlP6TxknfVT1CCKfw2IAtpck5TnhE0tI12muMvMAbh4uxAN5X-eR0Qhctu8wV8gd2M/YqeSbLWxIwcbDMICyqcfswmTJRXII60CdJuEINiyPWI",
    "price": 65.135,
    "prevClose": 64.48,
    "absReturn": 0.6550000000000011
  },
  {
    "fullTicker": "BWEN:USA",
    "baseTicker": "BWEN",
    "rank": 34.6899,
    "description": "Broadwind, Inc. engages in the manufacturing and sales of structures, equipment, and components for clean technology and other specialized applications in the United States. The company operates through three segments: Heavy Fabrications, Gearing, and Industrial Solutions. The Heavy Fabrications segment provides fabrications to various industrial markets. It offers steel towers and adapters primarily to wind turbine manufacturers. Its Gearing segment provides gearing, gearboxes, and precision machined components to a range of customers in diverse markets, including surface and underground mining, wind energy, steel, material handling, infrastructure, onshore and offshore oil and gas fracking and drilling, marine, defense, and other industrial markets. This segment also offers heat treat services for aftermarket and original equipment manufacturer applications. The Industrial Solutions segment provides supply chain solutions for offering instrumentation and controls, valve assemblies, sensor devices, fuel system components, electrical junction boxes and wiring, energy storage services, and electromechanical devices; light fabrication, inventory management, and kitting and assembly services; packaging solutions; and supply chain solutions, light fabrication, inventory management, and kitting and assembly services for combined cycle natural gas turbine market. It sells its products to the energy, mining, and infrastructure sectors through its direct sales force and independent sales agents. The company was formerly known as Broadwind Energy, Inc. and changed its name to Broadwind, Inc. in May 2020. Broadwind, Inc. is headquartered in Cicero, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/6E8wY3Hs9dIT0LMsdwWliw/iIfaKNSwQbTRj569aD6TMIFL7RLZJKLHAs6F1kL0QOftJbj3bDppiRK-3dOquxmmIcGE0EFQs5EWA3h28x3aUoWOcgBSLCBoIwqZrc-2Rum5MfsOPfGGSUqAM9mHa6dUocpFKzasvS0GZHPpRXzi40CSrdkSndn_ChxTcnCQouo/Oh4BmH6z89prUdqEERCtqO4VGiiU5fAlu2Frlv_2SBM",
    "price": 1.895,
    "prevClose": 1.96,
    "absReturn": -0.06499999999999995
  },
  {
    "fullTicker": "CPRT:USA",
    "baseTicker": "CPRT",
    "rank": 49.4084,
    "description": "Copart, Inc. provides online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain, and Spain. It offers a range of services for processing and selling vehicles over the internet through its virtual bidding third generation internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, fleet operators, dealers, vehicle rental companies, and individuals. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, transportation, vehicle inspection stations, on-demand reporting, title processing and express, loan payoff, flexible vehicle processing programs, buy it now, sales process, and dealer services. Its services also comprise services to sell vehicles through BluCar, CashForCars.com, CashForCars.ca, CashForCars.de, CashForCars.co.uk, and Cash-for-cars.ie; Copart Recycling service, which allows the public to purchase parts from salvaged and end-of-life vehicles; copart 360, a proprietary technology that captures clear 360-degree views of interiors and exteriors of cars, trucks, and vans; and membership tiers for those registering to buy vehicles through Copart.com. In addition, it provides IntelliSeller, an automated tool leveraging its vast and detailed vehicle and sales data to assist its sellers in making vital auction decisions; Purple Wave Inc., that offers wholesale construction, agriculture, and fleet remarketing services through no-reserve online auctions; non-salvage powersport vehicle remarketing services through live and online auction platforms. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the public. Copart, Inc. was incorporated in 1982 and is headquartered in Dallas, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/KiEmbbqkkYq0ftoO1GSIaw/RW9Yv0pZY2WnbwjEaWk96GncYDVndygsokqg05dYE0mgFN-_k0KnuJibJYPgMmfdai5-m43Ee0NCp_2Ew62Nze2_Apbl6VjarIDoYgVMHLkq5r11oz7wFqRg6Uq6D3Lz05g7OMoRCu7r9JWB4qDuEVoqdP6Ej8aiBzkCpEABvaQ/cpWP3OJ2lWRbRfzuWAdt6GuXdpxxWvkfkcwiJcBHWDs",
    "price": 50.485,
    "prevClose": 50.28,
    "absReturn": 0.2049999999999983
  },
  {
    "fullTicker": "CPAY:USA",
    "baseTicker": "CPAY",
    "rank": 52.7967,
    "description": "Corpay, Inc. operates as a payments company that helps businesses and consumers manage vehicle-related expenses, lodging expenses, and corporate payments in the United States, Brazil, the United Kingdom, and internationally. The company offers vehicle payment solutions, which include fuel, tolls, parking, vehicle compliance, fleet maintenance, and long-haul transportation services, as well as prepaid food and transportation vouchers and cards. It also provides corporate payment solutions consisting of accounts payable AP automation; virtual cards, cross-border solutions; and purchasing and T&E travel and entertainment card products, as well as lodging payments solutions for employees who travel overnight for work purposes; traveling crews and stranded passengers from airlines and cruise lines; and insurance policyholders displaced from their homes due to damage or catastrophe; workforce lodging solutions for business travel programs; airline logistics, crew management, insurance, and other payments solutions. In addition, the company offers gifts and payroll cards. It serves business, merchant, consumer, and payment network customers. The company was formerly known as FLEETCOR Technologies, Inc. and changed its name to Corpay, Inc. in March 2024. Corpay, Inc. was founded in 1986 and is headquartered in Atlanta, Georgia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/LSzJeEJFGOkHVQPCJ7zV_A/9V1wUd8pK4wGqpYsXxWWfzZWVpPp1Ahbp-3-F1lKdo6GPKDDG8HSN8bclyt8TWurW_m7jzPiEPZW3frffFZs2_eVuPG7f7lVK4ivMSs7Fve6uwExbU025nXpKVPYheprAV9VBHLehgrZ7P5mqkdJz6fd79n-u7-mqfUzjMKJjW4/aYh0VF3voYsXNzj1w2KPCiFhLwVx8PLdSRoN24jUfj8",
    "price": 353.37,
    "prevClose": 350.59,
    "absReturn": 2.7800000000000296
  },
  {
    "fullTicker": "CCRN:USA",
    "baseTicker": "CCRN",
    "rank": 66.5651,
    "description": "Cross Country Healthcare, Inc. provides talent management services for healthcare clients in the United States. The company operates in two segments, Nurse and Allied Staffing and Physician Staffing. The Nurse and Allied Staffing segment provides traditional staffing, recruiting, and value-added total talent solutions, including temporary and permanent placement of travel and local nurse, and allied professionals, as well as healthcare leaders within nursing, allied, human resources, and finance; vendor neutral and managed services programs; and education healthcare, in-home care, and outsourcing services. This segment offers staffing solutions for registered nurses, licensed practical nurses, certified nurse assistants, practitioners, pharmacists, and other allied professionals on per diem and short-term assignments; and clinical and non-clinical professionals on long-term assignments, as well as workforce solutions, including MSP, VMS, RPO, project management, and other outsourcing and consultative services. It also provides retained search services for healthcare professionals, as well as contingent search and recruitment process outsourcing services. The company serves public and private acute care and non-acute care hospitals, government facilities, local and national healthcare plans, managed care providers, public and charter schools, outpatient clinics, ambulatory care facilities, correctional facilities, PACE programs, physician practice groups, and other healthcare providers. The Physician Staffing segment provides physicians in various specialties, certified registered nurse anesthetists, nurse practitioners, and physician assistants as independent contractors on temporary assignments. This segment serves various healthcare facilities, such as acute and non-acute care facilities, medical group practices, government facilities, and managed care organizations. The company was founded in 1986 and is headquartered in Boca Raton, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/LE0ku-4Vd_g4S9fuRpKe-A/L6ee9_bAtckMGChOwoLsOymHFcqNIKXkry34oN5Qyx7duJfskscHPWc5P8MUAOdtgshGMoQ7tUwINwBlpmt6j1Rz_-zYDFscA59DVLTwOsBfLfH6_6f02eAjNaTZbc-EIW49_tTQMgCWXvsKT8sh-3g5mVEvQn54YBJvG-1ghlB2hxY_xzlWWJGGs2eY2YzD/STksKjVPF5mo_Gi9VyRjJIDWAuhuETPPZlMSSFiP1Gs",
    "price": 13.185,
    "prevClose": 13.05,
    "absReturn": 0.1349999999999998
  },
  {
    "fullTicker": "WIX:USA",
    "baseTicker": "WIX",
    "rank": 79.7598,
    "description": "Wix.com Ltd., together with its subsidiaries, operates a cloud-based web development platform for registered users and creators worldwide. The company offers Wix Editor, a drag-and-drop visual development and website editing environment platform; and Wix Studio a unified website and application development platform for the creation of website. It also provides Velo by Wix, a full-stack, no-code/low-code development environment to create content-rich websites and web applications; Wix App Market that offers its registered users various free and paid web applications for building, growing, and managing their businesses; Wix marketplace that brings users seeking help in creating and managing a website; Wix App which allows users to manage their websites and Wix operating systems on the go and run their businesses, wherever they are, in real time; Spaces by Wix mobile app that serves as an interface between the site owner and their customers; and Wix Customer Care which provides support and guidance to users throughout the Wix platform. In addition, the company offers Payments by Wix enables users to accept payments for goods and services both online and in-person; Wix Logo Maker that generates a logo, including through the use of artificial intelligence; Wix POS, an end-to-end omnichannel solution for online and in-person sales; Stores and Bookings, a native solution to manage gift cards and customer re-engagement activities; Branded App by Wix a native mobile app builder; email marketing packages; paid ad campaigns; domain names; and Google Workspace application, as well as Wix Commerce Solutions, a commerce platform for business owners. The company was formerly known as Wixpress Ltd. The company was incorporated in 2006 and is headquartered in Tel Aviv, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/gwVRjtz_rU0ePRQFvaIwJQ/0YgBROKjzZEXvIz39xnWjG1ghfz5m0r2BCJTrnb2gScMbbgYbzCdwm8_W3saLirIRlLzgzuMraYodFIiqPLTLVyNHCIrJxIdVulbJWUD1ioJGmus1cX3Zdbt7cnsWjc2LfoWsD7MDv98Aaa3PM3xYaV5n_UZjcJIJRVFBNbfTjQ/lpkoTh77bTpHL2Yo6NUdj5IrWdP0Ag5F9h1hJFoa-cA",
    "price": 157.47,
    "prevClose": 158.62,
    "absReturn": -1.1500000000000057
  },
  {
    "fullTicker": "GOOGL:USA",
    "baseTicker": "GOOGL",
    "rank": 89.9785,
    "description": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers AI infrastructure, Vertex AI platform, cybersecurity, data and analytics, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/42/42/1749664800000/BJ_5kJywTJUB9k2ZdTt6cA/FvkP3hAt3RvodcRRPSinCax1dWB_Hxbjtop3QsIY_yCyHwMZPvHl4qp-qCIOjC_20JTFpeVh-qKQqYtHm0xONkDwpcA--iu24LzL54KaNYluUhBkIdNsv0PODbPSRa4T7pj6bAAid6fPv_xPctNc82THfbIYTKWGgxHIhNnLaD8/iN22TTPRGtF8bDquqVXwZlpAbFdtJ0gvVWfNIYiOjfA",
    "price": 178.525,
    "prevClose": 178.6,
    "absReturn": -0.07499999999998863
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 604.695,
    "prevClose": 603.08,
    "absReturn": 1.615000000000009
  }
]