[
  {
    "fullTicker": "CLSK:USA",
    "baseTicker": "CLSK",
    "rank": 2.0264,
    "description": "CleanSpark, Inc. operates as a bitcoin mining company in the Americas. It owns and operates data centers. Its infrastructure supports Bitcoin, a digital commodity and a tool for financial independence and inclusion. The company was formerly known as Stratean Inc. and changed its name to CleanSpark, Inc. in November 2016. CleanSpark, Inc. was incorporated in 1987 and is headquartered in Henderson, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/1a3zOi3jjtZ-kaG5TIc4Ag/KQnc5PrAxA00SyQoMG0C2YDhphBEN3CAV7cS_e2WRQzqZ5CueeXnAXNjy7leHbw7j2Kt0a-CRVy7pDOlvrE3fJO66lbKYQF5csKwLywxHNoGe58NuUPBKFg2Z7uTMOz3eUQO5XkD2baimUGMJ6yRQpjbXtqfa7OSRBDcqE-g_rhSAZ9xlbffcQRtd3sBwR_u/4zPvrU8SL84LNKMv57rXBKY-JUFXpf6_SWp5weE9zIQ",
    "price": 12.785,
    "prevClose": 13.68,
    "absReturn": -0.8949999999999996
  },
  {
    "fullTicker": "FLGT:USA",
    "baseTicker": "FLGT",
    "rank": 8.7069,
    "description": "Fulgent Genetics, Inc. provides clinical diagnostic and therapeutic development solutions to physicians and patients in the United States and internationally. The company's clinical diagnostic solutions include molecular diagnostic testing; genetic testing; anatomic pathology laboratory tests and testing services, such as gastrointestinal pathology, dermatopathology, urologic pathology, breast pathology, neuropathology, and hematopathology; oncology tests and testing services; and sequencer services related to hereditary cancer, reproductive health, and other diseases. Its therapeutic development solutions focus on developing drug candidates for treating a range of cancers using a nanoencapsulation and targeted therapy platform to enhance the therapeutic window and pharmacokinetic profile of new and existing cancer drugs. The company operates picture genetics platform, which includes gene probes, data suppression and comparison algorithms, adaptive learning software, and proprietary laboratory information management systems that helps customers to identify health markers in their personal DNA. It serves insurance, hospitals, medical institutions, other laboratories, governmental bodies, payors, municipalities and large corporations, and patients. The company was formerly known as Fulgent Diagnostics, Inc. and changed its name to Fulgent Genetics, Inc. in August 2016. The company was founded in 2011 and is headquartered in El Monte, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/h09WtHjtzMSReHRiZiWpEw/QWVJ0tfbCgcF91vmdeROVmYVejz9FLwzmC0Emr0vY9FOEl0ia9voMjsiZBgbD3ZNQk77dcuoqdS0EI_fHL_Kj22pW_y9sVN7Ea5kjDLKnf_v80ZIp22DmUIYnlEbmIzjhRF28PI56BlYun42bfLnaPRveiU7WkuDTOJjR-DVfA2N2_4VR5gb1zWWzqHVQKQk/7RBwjihPWdQ8nyHCNvLlYU3hh4lXacpKDfmg40cSVtc",
    "price": 22.02,
    "prevClose": 22.03,
    "absReturn": -0.010000000000001563
  },
  {
    "fullTicker": "CLCO:USA",
    "baseTicker": "CLCO",
    "rank": 23.2526,
    "description": "Cool Company Ltd. engages in the acquisition, ownership, operation, and chartering of liquefied natural gas carriers (LNGCs). As of December 31, 2023, it owned a fleet of eleven LNGCs, including seven modern tri-fuel diesel electric vessels; two modern 2-stroke and two TFDE vessels; and managed 17 LNGCs and floating storage and regasification units for third parties. The company was founded in 1970 and is based in London, the United Kingdom.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/un4Y7vrmOuA0P4Vdx9_Qiw/leaNpTPEzmfUIb0R6sKkteLG9_a8l9h62oAd1SbnqYic13owlEQwHpBAT1ZOCwnT18PQ78ttvkAiGGVLDWr4yYi9snUSz9Plh1r3YBMMVsKWoab-IeuKAbQcI_MvE6gPcTn-gQ0mU0YULo27xSkitL8GLe4H1ys0ScyvRQCOpAP_OtUjWRn5t8PixVSC9h7o/rmB6VLVO-xASDmz7Kyjf10WhjgunKoCQwaygZukus0g",
    "price": 9.27,
    "prevClose": 9.26,
    "absReturn": 0.009999999999999787
  },
  {
    "fullTicker": "NI:USA",
    "baseTicker": "NI",
    "rank": 30.5856,
    "description": "NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Columbia Operations and NIPSCO Operations. The company provides natural gas to approximately 2.4 million residential, commercial, and industrial customers through approximately 37,200 miles of distribution main pipeline and the associated individual customer service lines; and 330 miles of transmission main pipeline in Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates steam coal generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/PBYjBkVikW01loM-tLASAQ/0f5qK-QHH7fOKqkjNEk0QcTO7k_VDl7swCb_SrZLzERXNiPD5jONMoZFP3TzsbT5Otvv683CSqHi81LnT9Kfrq8QCEh_te1hYNIMuqbSBdZTvVsRfi7vGyBNuTM1Lc1yTV3zj-BZU2SKCh49hD8Z-S5TtXC72cZqHHSEHqVRLoY/1flTOkc0QhH3250WLinhAAxhxtrThO7FCZ3bU7WzXb8",
    "price": 42.135,
    "prevClose": 41.82,
    "absReturn": 0.3149999999999977
  },
  {
    "fullTicker": "NRXP:USA",
    "baseTicker": "NRXP",
    "rank": 41.0098,
    "description": "NRx Pharmaceuticals, Inc., a clinical-stage bio-pharmaceutical company, develops novel therapeutics for the treatment of central nervous system disorders, including suicidal depression, post-traumatic stress disorder, and chronic pain. Its products include NRX-101 (D-cycloserine/Lurasidone), an oral, fixed dosed combination of D-cycloserine and lurasidone that earned food and drug administration-designated breakthrough therapy for suicidal treatment-resistant bipolar depression; and NRX-100 (ketamine), which has been awarded FDA fast track designation for the treatment of severe bipolar depression with acute suicidal ideation and behavior. The company has a partnership with Alvogen Inc. and Lotus Pharmaceutical Company; development and manufacturing agreement with Nephron Pharmaceuticals, Inc. and Alcami; license agreement with Apkarian Technologies; development and license agreement with Glytech; license agreement with Sarah Herzog Memorial Hospital. The company was founded in 2015 and is based in Wilmington, Delaware.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/c-qRLRIneuD3uIxY5hkejQ/uyIjGdNk5Kho-eUFB3YWUSIQ7FktOg_JODVZHrAzvLWzftsCINvKBiU66iOwpuWT5sOwz5_ZOufRZl8LnmFMq7m38HX_AAIxRWMvktk-_1K86UaSdCP5Us9G_PGKnhLMttD6aDKozPg_mbLxrf5qxOK5ZrsovIefc1MJOFFWPUVmi87SE8HEk_EnBvkKaEd1/T8yiu5SiL_f_i6yaV3-PbL0MBJvYCgOCPCvmQiYHNbc",
    "price": 2.905,
    "prevClose": 2.91,
    "absReturn": -0.0050000000000003375
  },
  {
    "fullTicker": "ORLY:USA",
    "baseTicker": "ORLY",
    "rank": 58.1831,
    "description": "O'Reilly Automotive, Inc., together with its subsidiaries, operates as a retailer and supplier of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States, Puerto Rico, Mexico, and Canada. The company provides new and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting products, and oil and wiper blades; and accessories, including floor mats, seat covers, and truck accessories. It also offers auto body paint and related materials, automotive tools, and professional service provider service equipment. In addition, the company provides enhanced services and programs consisting used oil, oil filter, and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; and professional paint shop mixing and related materials. Further, it offers do-it-yourself and professional service for domestic and imported automobiles, vans, and trucks. The company offers its products under the BesTest, BrakeBest, Cartek, Import Direct, MasterPro, MicroGard, Murray, Omnispark, O'Reilly Auto Parts, Precision, PowerTorque, SuperStart, Syntec, and Ultima brands. O'Reilly Automotive, Inc. was founded in 1957 and is headquartered in Springfield, Missouri.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/_E9NzKt9M8AR6BophS7P2A/pv2J_hWZgRdum7MG1-SmCeiR6bP9LQJ0NOrLKOWRMPLQYiqIF7A0v6PZ4o3mr_D3Y5JN_gQ60s8VC2aM-Tp1EhJ5EhaWs-A_F8IQEaBsovkhh8-MtZse9zbcZroCcZZAbhPhXYNJb_Pn9vdPyyYnVh18KXBnRzbHUWdr67WJbh4ODnEcykHQKiD89jJbh6mS/eLcKCBnfWxAGia9VRIY_So2Y4gVsk0xbShZ8BO9Wt7E",
    "price": 105.53,
    "prevClose": 104.58,
    "absReturn": 0.9500000000000028
  },
  {
    "fullTicker": "EXAS:USA",
    "baseTicker": "EXAS",
    "rank": 67.7658,
    "description": "Exact Sciences Corporation provides cancer screening and diagnostic test products in the United States and internationally. It offers Cologuard, a non-invasive stool-based DNA screening test to detect DNA and hemoglobin biomarkers associated with colorectal cancer and pre-cancer. The company also provides Oncotype DX Breast Recurrence Score Test; Oncotype DX Breast DCIS Score Test; Oncotype DX Colon Recurrence Score Test; OncoExTra Test for tumor profiling for patients with advanced, metastatic, refractory, relapsed, or recurrent cancer; and Riskguard Test, a hereditary cancer test to understand their inherited risk of cancer. Its pipeline focus on advancing screening and diagnostic products, including risk assessment, screening and prevention, early disease diagnosis, adjuvant and/or neoadjuvant disease treatment, metastatic disease treatment selection, and recurrence monitoring. The company has license agreements with MAYO Foundation for Medical Education and Research and Johns Hopkins University. Exact Sciences Corporation was incorporated in 1995 and is headquartered in Madison, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/pBoMfyAHEyHOlYNxVIfYEg/jzNAYf5hzqRMOIy5k6AqbpyppeMXEH5gqtZ__5nqinbcJ3UttrtqfTig9fdlSnOCjPEJ6ocqRyjuC5l_6W12kdNxoWg-SdnBKwSUvqwogxm50kM-2uKBaWQMngQnt0Wud_grcP6IEx2TIqaiRRqjuiFHrjfdOUXrY80kjsw4-lzPJKQGsWG25mXXnEgZivq1/AI9vVjB-7qZF1X-fbD7KI8wisvoNFKs9h6EUyOi_tlA",
    "price": 53.58,
    "prevClose": 53.68,
    "absReturn": -0.10000000000000142
  },
  {
    "fullTicker": "RGLD:USA",
    "baseTicker": "RGLD",
    "rank": 78.688,
    "description": "Royal Gold, Inc., together with its subsidiaries, acquires and manages precious metal streams, royalties, and related interests. The company engages in acquiring stream and royalty interests or to finance projects that are in production, development, or in the exploration stage in exchange for stream or royalty interests, which primarily consists of gold, silver, copper, nickel, zinc, lead, and other metals. It operates in the United States, Canada, Chile, the Dominican Republic, Australia, Africa, Mexico, and internationally. Royal Gold, Inc. was incorporated in 1981 and is headquartered in Denver, Colorado.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/Y31klk3qxBTsNkaZaycpeQ/z-Gz8vjPRmKpViKWpAyW00wDmOQ7VzyD4ER0HhWkbzYULBhvE7I89pN9ktQIEyVeZQ-HK4sKCkWK87Mn33GgL5OV83orXOvda5h9UA_ApmTtAvG8F6tE1bA3WE8BIBkqSKoq1IEzArzp5LpHdbGBT0-R7HYWol3wJdSL3nOYVtINwNmunYcIwRseYh1pWYtC/2r__fiEyYF2Xm8ZebhOT7MJjH2EvzJ13NiWy56mqJ_E",
    "price": 195.965,
    "prevClose": 193.11,
    "absReturn": 2.8549999999999898
  },
  {
    "fullTicker": "VZ:USA",
    "baseTicker": "VZ",
    "rank": 80.972,
    "description": "Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/8PLkav0X6GUhYCG8jQqPNA/OlD9vD1d9UWTOVinIj5hvN3Y6EJ_9pI9suoprDvo81WiewThDmKk5-JL4jaSTDGxkYWBFUunlkGL23HOmaLKeA9ooeNcJ9Dfjlrv1sV32181b0KUpOp9vmrAwGQZK3ZxTLqe9uZ8DFSM3E5iMLTvhzgzPdmS4gxviottKNLw_Uc/FXH2Fl77HJjU9HoWl4wnJq-hn59bTOKoiLUg0PuRr8Y",
    "price": 43.535,
    "prevClose": 43.35,
    "absReturn": 0.18499999999999517
  },
  {
    "fullTicker": "DCO:USA",
    "baseTicker": "DCO",
    "rank": 97.2523,
    "description": "Ducommun Incorporated provides engineering and manufacturing services for products and applications used in the aerospace and defense, industrial, medical, and other industries in the United States. It operates through two segments, Electronic Systems and Structural Systems. The Electronic Systems segment provides cable assemblies and interconnect systems; printed circuit board assemblies; electronic, electromechanical, and mechanical components and assemblies, as well as lightning diversion systems; and radar enclosures, aircraft avionics racks, shipboard communications and control enclosures, wire harnesses, lightning diversion strips, surge suppressors, conformal shields, and other assemblies. This segment also supplies engineered products, including illuminated pushbutton switches and panels for aviation and test systems; microwave and millimeter switches and filters for radio frequency systems and test instrumentation; and motors and resolvers for motion control, as well as provides engineering service for aerospace system design, development, integration, and testing service. The Structural Systems segment designs, engineers, and manufactures contoured aluminum, titanium, and Inconel aero structure components; structural assembly products, such as winglets, engine components, and fuselage structural panels; aerodynamic systems; and metal and composite bonded structures and assemblies comprising aircraft wing spoilers, large fuselage skins, rotor blades on rotary-wing aircraft and components, flight control surfaces, engine components, ammunition handling systems, and magnetic seals. It serves commercial aircraft, military fixed-wing aircraft, military and commercial rotary-wing aircraft, and space programs. The company was founded in 1849 and is headquartered in Costa Mesa, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/45/45/1758909600000/WR05cuqnV13xCSxMEj8Y6g/1qLpj7z4TAQ7aWqGU7GBPJvVzLxuefLLbzPtTkWxbcs_lJSX18YG151b1d1kDo5qg3Sx_gaW9HR1ZigTd1ES85xJEbEouNAxninuDWKyP9BH9dDlpKcmjHuctbLBaSEjd7SaukOHvFSrmMHSboPKGkpIs42kOVKwBTFC-l1wlbZGZwI1lyBtY2dup8H6XnU1/AzTZMDCb9plKKLGIBCXl97UV7DRhvtrGHcJxEAMVAkY",
    "price": 93.565,
    "prevClose": 91.63,
    "absReturn": 1.9350000000000023
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 658.98,
    "prevClose": 658.05,
    "absReturn": 0.9300000000000637
  }
]