[
  {
    "fullTicker": "NPWR:USA",
    "baseTicker": "NPWR",
    "rank": 1.5959,
    "description": "NET Power Inc. operates as an energy technology company in the United States. Its technology includes NET Power Cycle, a power generation system that produces electricity from natural gas while capturing atmospheric emissions. The company was founded in 2010 and is headquartered in Durham, North Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/zH5stqZVTXrvi0KVvWzjKg/ZUr_Fju2NcjjdZ4KvjB6ZXKXU88xlgbEtdZrozjMOuGnnQ1qPhoXNLHwQf_BJroHuquzscF9EKEV5ciPWOwNwn7VtMRvM0qcR46LuoMLF7NbOb7-O5YE5cnfIK22FK2vJXvASYS2dThuJTBa7GI6U32Vr3ZSR7jUsNJ4looTA3o/ok-oT9nvX3fwA1CEzHDpuvFhgri_we3k7NrzbyhQVEk",
    "price": 1.66,
    "prevClose": 1.62,
    "absReturn": 0.039999999999999813
  },
  {
    "fullTicker": "NVVE:USA",
    "baseTicker": "NVVE",
    "rank": 11.9877,
    "description": "Nuvve Holding Corp., a green energy technology company, provides commercial vehicle-to-grid (V2G) technology platform in the United States, the United Kingdom, France, Japan, and Denmark. The company offers Grid Integrated Vehicle platform which enables electric vehicle (EV) batteries to store and resell unused energy back to the local electric grid and provide other grid services; and allows EV owners to meet the energy demands of individual vehicles and entire fleets. Its V2G technology also links EV batteries into a virtual power plant that sells excess power to utility companies or utilizes saved power to reduce building energy peak consumption. In addition, the company offers networked charging stations, infrastructure, software, professional services, support, monitoring, and parts and labor warranties required to run electric vehicle fleets. It serves its products to owner/operators of light duty fleets, heavy duty fleets, automotive manufacturers, charge point operators, and strategic partners. The company was founded in 2010 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/6yr9dnWIPOlvdX9EfMOZBQ/pQWDHpCVfG9f7-IA0keKZyTpZbMSlPrVah7DqWMrTAN_zzRAjmPe8a2-6KUVHSuI1B94vY_o8d74AR_9MZvIGCWHpBMBC8vgJsv-WViybifihnxSSWlcj_TK4saC5Yk-P2fRhTCbLniBLgukdQrV9Uc9TTBFxufc12vONOR8NGDSGpSOcUNZAvI0zSOv42Ub/U7kz0mAwMLA11Ek4FyL0IvJ8KhUHGQou9G-CwC5_6DQ",
    "price": 1,
    "prevClose": 1.11,
    "absReturn": -0.1100000000000001
  },
  {
    "fullTicker": "TELO:USA",
    "baseTicker": "TELO",
    "rank": 21.2731,
    "description": "Telomir Pharmaceuticals, Inc., a pre-clinical stage biopharmaceutical company, focuses on developing pharmaceutical products for reversal of oxidative stress, cellular protection, and regulatory mechanism. The company is developing Telomir 1, an oral small molecule metal ion regulator designed to extend telomere caps; maintain cellular balance; and combat oxidative stress that drives aging and disease progression. By modulating essential metal ions such as iron, and copper, Telomir-1 helps protect against age-related conditions, including Progeria, a rare genetic disorder that causes rapid aging in children; Wilson's disease, a genetic disorder leading to toxic copper buildup in the body; and Age-related Macular Degeneration (AMD), as well as Type 2 Diabetes, cancer, and Alzheimer's disease. The company was formerly known as Metallo Therapies Inc. and changed its name to Telomir Pharmaceuticals, Inc. in October 2022. Telomir Pharmaceuticals, Inc. was incorporated in 2021 and is headquartered in Miami, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/IaFsoGLWpWy53gJJ7BRKuA/89g19PXW3ceaf42zyekXi2g-R2iEjHw12kADMkMy6R428h6uy1KVJsFodCCoSG5hr26lsJofcRSqmJWBMyBDHCPhAmnLgigX3FgVgDBQtDdR_fl67aHDAWX2dzyE8F7ZPLZO1FPw8BluCXQpm72AuT_5eUdI2K_OI2svj_ub8_Spb6yXe8A9kb1kfcKyIEzg/gEqkHJbDU5Q4AFgbbyG3qrrOhzOygNwtayjy3TrF27o",
    "price": 2.43,
    "prevClose": 2.36,
    "absReturn": 0.07000000000000028
  },
  {
    "fullTicker": "BC:USA",
    "baseTicker": "BC",
    "rank": 26.6594,
    "description": "Brunswick Corporation designs, manufactures, and markets recreation products in the United States, Europe, the Asia-Pacific, Canada, and internationally. It operates through four segments: Propulsion, Engine P&A, Navico Group, and Boat. The Propulsion segment provides outboard, sterndrive, inboard engines, propulsion-related controls, rigging, and propellers for boat builders through marine retail dealers under the Mercury, Mercury MerCruiser, Mariner, Mercury Racing, Mercury Diesel, Avator, and Fliteboard brands. The Engine P&A segment offers engine parts and consumables, electrical products, boat parts and systems, and engine oils and lubricants through aftermarket retailers, dealers, distributors, and original equipment manufacturers for marine and non-marine markets under the Mercury, Mercury Precision Parts, Quicksilver, and Seachoice brands; and distributes marine parts and accessories. The Navico Group segment provides products and systems for the marine, recreational vehicle (RV), specialty vehicle, mobile, and industrial markets, as well as aftermarket channels; and marine electronics, sensors, control systems, instruments, power systems, and general accessories under the Ancor, Attwood, B&G, BEP, Blue Sea Systems, C-MAP, CZone, Lenco, Lowrance, Marinco, Mastervolt, MotorGuide, Progressive Industries, ProMariner, RELiON, Simrad, and Whale brand names. The Boat segment offers Sea Ray sport boats and cruisers; Bayliner sport cruisers, runabouts, and Heyday wake boats; Boston Whaler fiberglass offshore boats; Lund fiberglass fishing boats; Crestliner, Harris, Lowe, Lund, Princecraft aluminum fishing, utility, pontoon, and deck boats; Thunder Jet heavy-gauge aluminum boats; Veer recreational and fishing boats; and the freedom boat club, dealer services, and technology to the marine industry through dealers and distributors. Brunswick Corporation was founded in 1845 and is headquartered in Mettawa, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/TwQpIGIy3KjH4qQLAUOO6A/GjMT_62zlNrU71fonnW-6WrAATpqbM5dRp_Pbhf9l4-fPpMHFWKbbaEGhxk13_imZDcAgr_C-9aPEGhoneWYcsY06ULDM4DnDpMu5y3LE9HTftJX7DQHlowhWTTe7qYP5l4tAJp-motfvaM8mwcN75VmgUr_kT14EMzuGi9zIkA/iJgeTIWQskeOTVxb3ZMMSeNVAGqtbxwPA7W8rnIg9ss",
    "price": 52.935,
    "prevClose": 52.01,
    "absReturn": 0.9250000000000043
  },
  {
    "fullTicker": "REI:USA",
    "baseTicker": "REI",
    "rank": 33.5872,
    "description": "Ring Energy, Inc., an independent oil and natural gas company, engages in the acquisition, exploration, development, and production of oil and natural gas properties. The company has interests in 56,620 net developed acres and 4,029 net undeveloped acres in Andrews, Gaines, Crane, Ector, Winkler, and Ward counties, Texas; and 8,722 net developed acres and 11,548 net undeveloped acres in Yoakum County, Texas and Lea County, New Mexico. It primarily sells its oil and natural gas production to end users, marketers, and other purchasers. The company was formerly known as Transglobal Mining Corp. and changed its name to Ring Energy, Inc. in March 2008. Ring Energy, Inc. was founded in 2004 and is headquartered in The Woodlands, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/mqksHE38tVk5WmFN_eersA/HIKEebq3MD7ZC-ZsyIknxNBXSA_quuZh6bKpyT2byGOf30Ke8hgwFwl_JM8EtCEUBmJkmImDYybL4Gh-eyJp1HVqkJEN14GOeqB4BUtvy5ff69ypvNQL0oKsepVWot3NAlz1Puu_ZGt0zQ-PWaBCL3UK4OXtioVv9oef1RmrM_PJABnymthQNq4nXzrw21jA/msKxpas1sxx8PWz7GNKgcEMOEXVhjbSuMCj2lu1212U",
    "price": 0.8111,
    "prevClose": 0.8365,
    "absReturn": -0.025399999999999978
  },
  {
    "fullTicker": "BLD:USA",
    "baseTicker": "BLD",
    "rank": 47.86,
    "description": "TopBuild Corp., together with its subsidiaries, engages in the installation and distribution of insulation and other building material products to the construction industry. The company operates in two segments, Installation and Specialty Distribution. It provides insulation products and accessories, glass and windows, rain gutters, garage doors, fireplaces, roofing materials, closet shelving, and other products. The company also offers insulation installation services for fiberglass batts and rolls, blown-in loose fill fiberglass, polyurethane spray foam, and blown-in loose fill cellulose applications. In addition, it distributes building and mechanical insulation, insulation accessories, and other building product materials for the residential, commercial, and industrial end markets. The company serves single-family homebuilders, single-family custom builders, multi-family builders, commercial general contractors, remodelers, and individual homeowners, as well as insulation contractors, gutter contractors, weatherization contractors, other contractors, dealers, metal building erectors, and modular home builders. It operates installation branches and distribution centers in the United States and Canada. The company was formerly known as Masco SpinCo Corp. and changed its name to TopBuild Corp. in March 2015. TopBuild Corp. was incorporated in 2015 and is headquartered in Daytona Beach, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/K_d25A_L0E0gbhdPMCdPTw/DSDWsKmF4G_Fq_ey_KqhuXkiJYS3OFjodzeL_ReCx5h9Vbi2-Ba6Ukw4nL2csshxuhuz1m3NdUNf-9rKMPUMlxgGgurbckFklQ-lny0zOQ76ESFosU9GJssudZ4CE_dYNH8m7fPMs95vWrS37hzxSwJGqfCVGkQAx98_pKCysb8/u_mg29d4XAQOtyp_ZAhX0cRN_zUGlxXPItU3U-vqk_A",
    "price": 297.195,
    "prevClose": 296.42,
    "absReturn": 0.7749999999999773
  },
  {
    "fullTicker": "RVLV:USA",
    "baseTicker": "RVLV",
    "rank": 49.7642,
    "description": "Revolve Group, Inc. operates as an online fashion retailer for millennial and generation z consumers in the United States and internationally. The company operates in two segments, REVOLVE and FWRD. It operates a platform that connects consumers and global fashion influencers, as well as emerging, established, and owned brands. The company offers apparel, footwear, beauty, accessories, and home products from emerging, established, and owned brands, as well as luxury brands through its websites and mobile apps. The company was formerly known as Advance Holdings, LLC and changed its name to Revolve Group, Inc. in October 2018. Revolve Group, Inc. was founded in 2003 and is headquartered in Cerritos, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/h___3fgMs2dlX5AcGeK6dg/FZL9XPg2Mg5btFSW2ISvOePChKQX5PxhOHam4OdsyEJSfYMQCz4vrUJ-wbjV6tOF74GQaOx0mG46TtOXQuE3vqvUKDSlIfE23LmG-EFfsMTXiNeHXWYL-Wm-TVNVTGWsaXySOwb7r2A-H4RsYW6HUi2vKrDxgRLAJZIoabfFwx6elGk5KG7UnFrmEq7V8Uoi/4-FbQ2lIK06RqzdpHQ0JAT9lrVWKCCg7JcuGv3wSAdY",
    "price": 20.7,
    "prevClose": 20.74,
    "absReturn": -0.03999999999999915
  },
  {
    "fullTicker": "TRS:USA",
    "baseTicker": "TRS",
    "rank": 63.4022,
    "description": "TriMas Corporation engages in the design, development, manufacture, and sale of products for consumer products, aerospace, and industrial markets worldwide. The company operates through Packaging, Aerospace, and Specialty Products segments. The Packaging segment offers dispensing products, such as foaming and sanitizer pumps, lotion and hand soap pumps, beverage dispensers, perfume sprayers, and nasal and trigger sprayers; polymeric and steel caps and closures comprising food lids, flip-top and beverage closures, child resistance caps, drum and pail closures, and flexible spouts; polymeric jar products; integrated dispensers; bag-in-box products; and consumable vascular delivery and diagnostic test components under the Rieke, Taplast, Affaba & Ferrari, Intertech, Omega, and Rapak brands. The Aerospace segment provides fasteners, collars, blind bolts, rivets, ducting, and connectors for air management systems, and other highly-machined parts and components to original equipment manufacturers, supply chain distributors, and tier one suppliers, as well as maintenance, repair and overhaul (MRO)/aftermarket providers; and military and defense aerospace applications and platforms under the Monogram Aerospace Fasteners, Allfast Fastening Systems, Mac Fasteners, TFI Aerospace, RSA Engineered Products, and Martinic Engineering brands. The Specialty Products segment offers steel cylinders for use in the transportation, storage, and dispensing of compressed gases under the Norris Cylinder brand; natural gas-powered engines, compressors, and replacement parts for oil and natural gas production, and other industrial and commercial markets under the Arrow brand; and spare parts for various industrial engines. It sells its products through a direct sales force, third-party agents, and distributors. The company was incorporated in 1986 and is headquartered in Bloomfield Hills, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/mZAnO5C2fANO9ZiKwDeUaA/hD0FMxqFZzN8Aju3JDeaFsms-vsvZJUxGn62IAYeQm9oZBR-ZocMXBW5yMnM7r2WAFDQDzi5roY7FgjL52jthm9yxMqS54RXHTf5BDxHyto6ZaQ9GTOYfKOUd_-D0W1V8pJ4pWKrgITgYW5GiiR1aJ8rseHi2BloPDy5Nm4QOYo/qj0P1U9gBk7-6CsSxBnCbC3FvQocl-xMITAJH1l7NPM",
    "price": 24.82,
    "prevClose": 24.73,
    "absReturn": 0.08999999999999986
  },
  {
    "fullTicker": "DOUG:USA",
    "baseTicker": "DOUG",
    "rank": 74.8458,
    "description": "Douglas Elliman Inc. engages in the real estate services and property technology investment business in the United States. It operates in two segments, Real Estate Brokerage, and Corporate and Other. The company provides residential real estate brokerage services. It has approximately 125 offices with approximately 6,600 real estate agents in the New York metropolitan areas, as well as in Florida, California, Connecticut, Massachusetts, Colorado, New Jersey, and Texas. Douglas Elliman Inc. was founded in 1911 and is headquartered in Miami, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/YjKzrMhyI0SLZ8i-jQpiGQ/S2M8gPEYQsPi_Uwv1SUMPxohI8EVqegZAQhtIkTAjDy7kpRF7vO2scE40--hhhGlxzk1nOjWbAAgBCvGLU354rXd5E0tBiI5x7BOfRbKtGrNquNLh1PCYNt5lGXB_vwH6wt6z7J0j2x21gbVU9z6SOCXKt7-Ztr49gZDaKzyXpT52-U2iwhZhsXZrZ365slt/poGsaVtx0r7PMzaqfsKjBJH7QjljHRxITfpxOxLekaU",
    "price": 2.175,
    "prevClose": 2.18,
    "absReturn": -0.0050000000000003375
  },
  {
    "fullTicker": "CHKP:USA",
    "baseTicker": "CHKP",
    "rank": 85.4008,
    "description": "Check Point Software Technologies Ltd. develops, markets, and supports a range of products and services for IT security worldwide. It provides a multilevel security architecture that defends enterprises' cloud, network, mobile devices, endpoints information, and IOT solutions. The company offers on-premises security with quantum, a hyperscale AI-powered threat prevention for securing mesh networks, which comprise data center, perimeter, branch, and remote users; and security gateways, hyperscale orchestrator, SD-WAN networking, DDoS security, automated prevention for IoT, and cloud security management. It also provides cloud security with CloudGuard, a unified prevention-first cloud native security across applications, workloads, and network to automate security, prevent threats, and manage posture-at cloud speed and scale. In addition, the company offers workspace security with harmony that prevents sophisticated attacks across the IT workspace, including emails, web applications, devices, and remote corporate access. Further, it provides collaborative security operations with infinity platform services that include Collaborative prevention first security operations and unified management consisting of extended prevention and response, orchestration, automation, ThreatCloud AI, and generative AI copilot. Additionally, the company offers managed and professional services for defense with a comprehensive suite of cyber security services, including managed detection and response, incident response, security architecture design, consulting, and training. The company also provides technical customer support programs and plans; professional services in implementing, upgrading, and optimizing its products comprising design planning and security implementation; and certification and educational training services on its products. Check Point Software Technologies Ltd. was incorporated in 1993 and is headquartered in Tel Aviv, Israel.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1747418400000/VsRpOaKb7bO-GutUCi9yRQ/AT508KkwQF8nJrbAMsywswfendFyGD1FUMhI6w3D3ocJga4FARqcCrs51iy1C_aH1aVI7yUYDtazDJLTdQgw4E6VKzpADxzImS5a_AL6hPCFRlf-Eaz7Z7IdkBd6Ld8WuoYArJ9ThnXlz-8R3K9Qh-TYnOAvyMbrsv_WhTGfFj9bbcNKR1Z4lWb0G7yqZTKghBxh3he1dplbDlhYs8kfEA/iAOs7NCzg3pUHfUuhwczsorruiLhNdOi4V9eHbVaSUw",
    "price": 217.21,
    "prevClose": 216.1,
    "absReturn": 1.1100000000000136
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 591.24,
    "prevClose": 590.46,
    "absReturn": 0.7799999999999727
  }
]