[
  {
    "fullTicker": "AIFF:USA",
    "baseTicker": "AIFF",
    "rank": 2.2488,
    "description": "Firefly Neuroscience, Inc., a medical technology and artificial intelligence company, provides neuroscientific solutions that improve outcomes for patients with mental illnesses and neurological disorders. The company offers Brain Network Analytics, a software that focuses on diagnostic and treatment for people suffering from mental illnesses and cognitive disorders, including depression, dementia, anxiety disorders, concussions, and attention-deficit/hyperactivity disorder. It serves pharmaceutical companies and medical practitioners. Firefly Neuroscience, Inc. is based in Toronto, Canada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/DYan1g6Zale-3Ly3HhM9YA/ud0Fzr4ZBSQQKWPQdErIzEDK2wRFeQRpJpsP2cgtQPpMbG-ftiVT4GG9WOb608js5kxer8JWknLjOZUauwZAgAqYTLcj1El0qfEnpmdeDHeg9O6FSoKiyprn2q3GcVW7BzGTVt6fKghBb0V7x_9zlwZvd7JUNQoY8FwC8ryiZtZrG87aeOCKR-099CZunTja/c1uiivYbA1zXGDwt-L0DpGn1NBq7_AO_fTUD-CL5ITU",
    "price": 2.91,
    "prevClose": 3.02,
    "absReturn": -0.10999999999999988
  },
  {
    "fullTicker": "ATYR:USA",
    "baseTicker": "ATYR",
    "rank": 9.9021,
    "description": "aTyr Pharma, Inc., a biotherapeutics company, engages in the discovery and development of medicines based on novel immunological pathways in the United States. Its lead therapeutic candidate is efzofitimod, a selective modulator of NRP2 that is in Phase III clinical trial for pulmonary sarcoidosis; and in Phase 1b/2a clinical trial for treatment of other interstitial lung diseases (ILDs), such as chronic hypersensitivity pneumonitis and connective tissue disease related ILD. The company is developing ATYR0101, a fusion protein derived from a domain of aspartyl-tRNA synthetase that is in preclinical development for the treatment of fibrosis; and ATYR0750, a domain of alanyl-tRNA synthetase for the treatment of liver disorders. It has collaboration and license agreement with Kyorin Pharmaceutical Co., Ltd. for the development and commercialization of efzofitimod for ILDs in Japan. aTyr Pharma, Inc. was incorporated in 2005 and is headquartered in San Diego, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/sx5gk4QIpd0IlEBp_6nSMw/jisA75ofHe_NlseFmGNmSLhzEMzw84nUzM8r8DNSv0yLGN_5DAPSTRgEgSFzI7bB4pmOEiw7F2QIlL5xVEoac5hgOXNDOP-vHSAarCkYkAmudkKd3VQT4pOJGhq0fp9n93wijJJ4bl2V291UwULQWEoCYLm081DFqtJia_U3Bc9dTH7MYNJ5VrnaQt20JYz_/Sh99rXNjFDJC4Lij3X6J1wihRMGyEpE-QV08VLlY8BA",
    "price": 3.28,
    "prevClose": 3.34,
    "absReturn": -0.06000000000000005
  },
  {
    "fullTicker": "JRVR:USA",
    "baseTicker": "JRVR",
    "rank": 15.1614,
    "description": "James River Group Holdings, Ltd. provides specialty insurance services. It operates through Excess and Surplus Lines, and Specialty Admitted Insurance segments. The Excess and Surplus Lines segment underwrites liability and property insurance in the United States Puerto Rice, and the United States Virgin Islands. This segment distributes its insurance policies primarily through wholesale insurance brokers. The Specialty Admitted Insurance segment provides insurance for fronting, program administrators, and managing general agents. James River Group Holdings, Ltd. was founded in 2002 and is headquartered in Pembroke, Bermuda.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/eTCeYJ8r7Y1nhlJnNMyqJQ/YeGD8M3dc_momqw8_11kqMpPIHTHI5Xlzy-5cbnPcLyy25F2YexESk6zfYt7jUxjlrp_3fGItWjhudjsnPcuoB8FviTO9rAWYR6CS8xcu0ZDAwWjajeBuU1TEbcAUGDUb230DCZWXqVJ1g3Ru09tXU9HTsw2OutIvkuuYuEYOYhetc5OCUZaglL8QoEtrK7uP9FVX4FyvHKUWuBFBvSWTA/AljOiV6qPkKA7jlCQVeicWH05ySIA_5wP_A6NDem7iw",
    "price": 4.66,
    "prevClose": 4.75,
    "absReturn": -0.08999999999999986
  },
  {
    "fullTicker": "CORT:USA",
    "baseTicker": "CORT",
    "rank": 29.3798,
    "description": "Corcept Therapeutics Incorporated engages in discovery and development of medication for the treatment of severe endocrinologic, oncologic, metabolic, and neurologic disorders in the United States. It offers Korlym tablets medication for the treatment of hyperglycemia secondary to hypercortisolism in adult patients with endogenous cushing's syndrome; and who have type 2 diabetes mellitus or glucose intolerance and have failed surgery or are not candidates for surgery. The company is also developing relacorilant, which is in phase III clinical trial for the treatment of hypercortisolism; relacorilant combined with nab-paclitaxel which is in phase III clinical trial to treat platinum-resistant ovarian tumors; treatment for adrenal cancer and cortisol excess which is in phase 1b clinical trial; and for treatment for prostate cancer which is in phase II clinical trial. In addition, it develops dazucorilant, which is in phase II clinical trial for the treatment of amyotrophic lateral sclerosis; and miricorilant, which is in phase IIb trial for the treatment of metabolic dysfunction-associated steatohepatitis. The company was incorporated in 1998 and is headquartered in Redwood City, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/JnNPx1vqY3-1zva26HVnGQ/2txJE33fZx3zFKpec2vSw9UXYlqfUuh-rwVInP2Fx7Ee1dlYCmvcM2zKOAWGWI6lrLepkH9RqhZnKzkz4oqeb9QEt5cp9OoYk2Fq1jQ_yrzXkVwG-pWyrO39YqXW9f0oJQEG0QVqKh4_vScvhG8HCeqiPaXnd5jkyBM3n2LbBgZpibnXhtp5Xlq-QQ2szLHaiRlsd0H7YLIzbesfSASWFA/7nIzc4y1hJdILWhAwP5VibzbTFiEGKmbam9-plqyyIg",
    "price": 70.23,
    "prevClose": 71.38,
    "absReturn": -1.1499999999999915
  },
  {
    "fullTicker": "KZR:USA",
    "baseTicker": "KZR",
    "rank": 30.9576,
    "description": "Kezar Life Sciences, Inc., a clinical-stage biotechnology company, engages in the discovery and development of novel small molecule therapeutics to treat unmet needs in immune-mediated diseases and cancer in the United States. The company's lead product candidate is zetomipzomib (KZR-616), a selective immunoproteasome inhibitor that is in Phase 2b clinical trials for various indications, including lupus nephritis, dermatomyositis, and polymyositis; Phase 1b clinical trials in systemic lupus erythematosus; and completed Phase 2a clinical trials in lupus nephritis. Its preclinical products include KZR-261, a novel first-in-class protein secretion inhibitor for the treatment of tumors resistant to traditional chemotherapeutics. Kezar Life Sciences, Inc. was incorporated in 2015 and is headquartered in South San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/cx-r0Cb7ZhRdVfv9sVLe6A/Sxq6w8wdbYLVxEEgZAQRwQ2Fq1OoLyXKJqejAUpI2xnI6NwhbqH9N3ewn1D2uO0lLJmGxoeVsgPxzxDV1Qi2SYlpwXnEV7MSg9Gta1PtMRdZjERfNnVUt0Ye_rnfj5Ufm5onP0TAD3bTLI-BJquMHUnhIjA0cv5-29RMeM24fisfYDfOSBye9c2aGRjAAKFL/veVUEuKHOum0Fx_O2DdCT3U86-LZgT1AZcNCtsWSrJU",
    "price": 4.22,
    "prevClose": 4.12,
    "absReturn": 0.09999999999999964
  },
  {
    "fullTicker": "DECK:USA",
    "baseTicker": "DECK",
    "rank": 43.5618,
    "description": "Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high-performance activities in the United States and internationally. The company offers premium footwear, apparel, and accessories under the UGG brand name; footwear, apparel, and accessories for ultra-runners and athletes under the HOKA brand name; and sandals, shoes, and boots under the Teva brand name. It also provides relaxed casual shoes and sandals under the Sanuk brand name; casual footwear fashion line under the Koolaburra brand name; and footwear under the AHNU brand name. The company sells its products through domestic and international retailers; international distributors; and directly to its consumers through its direct-to-consumer business, which includes e-commerce websites and retail stores. Deckers Outdoor Corporation was founded in 1973 and is headquartered in Goleta, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/fO2wOxWyIrSG_Uuqes7GkA/S-ZxTxb3mP6sm9nEiUYI76Y5Z3D6Tz9UuLOAkXV2IbGo9X5FzO4OWiFtLQENA2x3qdgv3sn9DZuqQK8elC3JZjoTK2EG1MZqvxFuhKPH_yedJ_9cyvHlpinDCMVhxkzQMNwBrOp_ZNBDQul9fauOhE8xUht97OS79GluvQWhubpdIaHKzGkWxdx7VvqTDYb8/jBcH-aGEAYtHxpjhj16hwqDJgd0OafgwwFN9m9R233U",
    "price": 121.07,
    "prevClose": 125.62,
    "absReturn": -4.550000000000011
  },
  {
    "fullTicker": "MYNZ:USA",
    "baseTicker": "MYNZ",
    "rank": 56.9278,
    "description": "Mainz Biomed NV is a molecular genetics cancer diagnostic company. The firm is engaged in the developing of market-ready molecular genetic diagnostic solutions for life-threatening conditions. It is involved in the commercializing of its product portfolio in Europe, the United States, and the rest of world. The company was founded on March 08, 2021 and is headquartered in Mainz, Germany.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/sTa2qJ7LC7BQkfvVs8MGag/eTDs7xmv3BmsWbi7TDSkLqWGqg8oJLX2RPrmm7vw7-Dy-2p0Vio_Vj7KZVWxBA1D9oOt9Zoor18Zk8dnx-nAaFHmVKSh6p9MYx5d3DcCQ6zr5kYgAPQ3tyD7_tHtoiiibArwJpKiXtzIVsWdx-p2Hg/jUWiRHfuRDZzF2OkP1b9m1m81CHxXG76eX-4fwZnvVA",
    "price": 2.45,
    "prevClose": 2.55,
    "absReturn": -0.09999999999999964
  },
  {
    "fullTicker": "V:USA",
    "baseTicker": "V",
    "rank": 64.6173,
    "description": "Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/i4sIZBTl87DOhiO2d_Lq0Q/DDLQrRrnxKE6qmZCTgDN7Dh155vd7iIq1RZaxpCi7wJpTnLERfT1910ZPdS4gim49Z3XOO3Vx6LURLK5a-HyifLNx1SoSNQ0wviUc7Io6CIPcMmi55-8ZdQ5iZbc3dlqRFyZacS3DwibLA89pL27Y3CfGdxsUM5j83CmqAJZ7Ik/vAmkckE-lf0HR5kuZLJjk3bmmhJux05ZrEw6925M2kg",
    "price": 352.54,
    "prevClose": 351.27,
    "absReturn": 1.2700000000000387
  },
  {
    "fullTicker": "META:USA",
    "baseTicker": "META",
    "rank": 72.8691,
    "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality and mixed reality headsets, augmented reality, and wearables worldwide. It operates through two segments, Family of Apps (FoA) and Reality Labs (RL). The FoA segment offers Facebook, which enables people to build community through feed, reels, stories, groups, marketplace, and other; Instagram that brings people closer through instagram feed, stories, reels, live, and messaging; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; Threads, an application for text-based updates and public conversations; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact in a private way. The RL segment provides virtual, augmented, and mixed reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/qzOUCGeWgYg2ARxSEnHEAg/wr3rriOjzcOO6j1dKT9og5Sh6rZO1H1QezV-TnxxXIyirpsiYuzGfMBYThKk0x3Dt84AaHXjMQZLoD17MU5Eid7_mS6ySE_AKca4a9WeajERgz7Xrv6pUomD1ccPQaX1QYEU46eaPOBA7_7-wcY-6pSwxEkV_2F7Z6_SO3a-_xo/g8pEm_lYia3rgF0HVTnVvqwLD0PSC7lmCWuBqb4zs6w",
    "price": 592.49,
    "prevClose": 598.01,
    "absReturn": -5.519999999999982
  },
  {
    "fullTicker": "VMD:USA",
    "baseTicker": "VMD",
    "rank": 88.6833,
    "description": "Viemed Healthcare, Inc., through its subsidiaries, provides home medical equipment (HME) and post-acute respiratory healthcare services in the United States. The company provides respiratory disease management solutions, including treatment of chronic obstructive pulmonary disease (COPD), which include non-invasive ventilation, percussion vests, and other therapies; and invasive and non-invasive ventilation and related equipment and supplies to patients suffering from COPD. It also sells and rents HME devices, such as non-invasive and invasive ventilators, positive airway pressure (PAP) machines, durable medical equipment, percussion vests, oxygen concentrators, and other medical equipment. In addition, the company provides neuromuscular care and oxygen therapy services; and sleep apnea management that provides sleep solutions and/or equipment, such as PAP, automatic continuous positive airway pressure, and bi-level positive airway pressure machines. Further, the company offers in home sleep apnea testing services, as well as healthcare staffing and recruitment services. Viemed Healthcare, Inc. was founded in 2006 and is headquartered in Lafayette, Louisiana.",
    "logo": "https://v5.airtableusercontent.com/v3/u/40/40/1746936000000/qkIVH-2AFfaicXhYRHkuyw/7Qp4bIBUaFhyG4xM8pnRDh8gQ_YiZvIKWD09vhVtHYo4SQ9_cgO8E1W5snm-U-E9epz9w8pGfHppNlbXDA9_y2-I4xsA6GyepK7ywEQ4hLMuXciOgo1UuxSZpbuvhTPdBPCKiDa-AjRZeqvaSQBxrKtxZO9zvLZMPv7l2qLboHq31OPmXGq864Wjfd3f4RfI/0ywXrHDCIl8QMDoer6m6AMbWJe1Qao0Rds289HTj8E8",
    "price": 6.32,
    "prevClose": 6.42,
    "absReturn": -0.09999999999999964
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 564.34,
    "prevClose": 565.06,
    "absReturn": -0.7199999999999136
  }
]