[
  {
    "fullTicker": "SMR:USA",
    "baseTicker": "SMR",
    "rank": 0.1945,
    "description": "NuScale Power Corporation provides small modular reactor technology solutions. It offers NuScale Power Module (NPM), a water reactor that can generate 77 megawatts of electricity (MWe). The company was founded in 2007 and is headquartered in Corvallis, Oregon. NuScale Power Corporation operates as a subsidiary of Fluor Enterprises, Inc.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/dKZzY-eoJtjiMpXi69qqMg/XZglF-7sYEEtQbpg9sMSlyntOX3T2XxRVBp9lZl4dQqXdqXVr9Tg09qKDjV_3MVekufK_10HL5E7wLqtb-PgN-hnzLR7fi_9yYidthodWsxxnBwrBCeilg5kodSZ2ss6E4ADSsAhnAJxcwWyxJJN5_UCBiTcaIUfLmoucHnePQERchtld7gGTkqH1cUUqcAU/SfPbr5cLdetsINl5A6IQQ4H4tM47w0zCfzOsMMENOD0",
    "price": 15.185,
    "prevClose": 16.74,
    "absReturn": -1.554999999999998
  },
  {
    "fullTicker": "INMB:USA",
    "baseTicker": "INMB",
    "rank": 9.7731,
    "description": "INmune Bio, Inc., a clinical-stage immunology company, focuses on developing drugs to reprogram the patients innate immune system to treat disease in the United States. It intends to develop and commercialize product candidates to treat hematologic malignancies, solid tumors, and chronic inflammation. The company's development programs include INKmune, which is in Phase 1 for the treatment of patients with high-risk myelodysplastic syndrome; and INB03, a mucinous polyglucan on the surface of some epithelial cancer cells that appears to predict resistant to immunotherapy, including women with MUC4 expressing HER2+ breast cancer and other MUC4 resistant cancers. It also provides XPro1595 for the treatment of Alzheimer's disease and treatment resistant depression. It has license agreements with Xencor, Inc.; Immune Ventures, LLC; and University of Pittsburg. INmune Bio, Inc. was incorporated in 2015 and is headquartered in Boca Raton, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/X2cl6eDORiFoV_TK7jRVhg/rTtYhty48iWZ8MI_aoDKKa5qO6eq5v-WEnMzt14Udq2e7jKpKiQsKeX7tcwtQmaP4HGZs5OJRnYkmxV4CyyvQMcsbtEGRXAolN6E7Ap0nK9VbmT1XMx2PrOSS-i1_zm6w_mBTABNbkIyBpequE8Sux6MgYJY0nGb558ok6AJRZIrJkbDIL1FHr2YvKPR0Gpx/0mYCaShOwSc-8Z8LBrABSAScQxyk91de74BPpnA3eII",
    "price": 1.535,
    "prevClose": 1.6,
    "absReturn": -0.06500000000000017
  },
  {
    "fullTicker": "PAVM:USA",
    "baseTicker": "PAVM",
    "rank": 14.4408,
    "description": "PAVmed Inc. focuses on acquiring, developing, and commercializing novel products that target unmet needs in the United States. The company's lead products include CarpX, a patented, single-use, disposable, and minimally invasive surgical device for use in the treatment of carpal tunnel syndrome; EsoCheck Esophageal Cell Collection Device, which consists of diagnostic test that serves as a testing tool for preventing esophageal adenocarcinoma deaths, through early detection of esophageal precancer in at-risk gastroesophageal reflux disease, including chronic heartburn and acid reflux or simply reflux in patients; and EsoGuard, a bisulfite-converted next-generation sequencing DNA assay performed on surface esophageal cells collected with EsoCheck. Its product pipeline also comprises EsoCure EsoCure Esophageal Ablation Device for treating dysplastic BE; PortIO, an implantable intraosseous vascular access device; and Veris cancer care platform. The company was formerly known as PAXmed Inc. and changed its name to PAVmed Inc. in April 2015. PAVmed Inc. was incorporated in 2014 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/RNfMdKMkkd0F9_H7ANGm4A/Rf90_yiIurfJpTncoNsfRLNYAY1yyY239uIAdZJ9X-_GBxUfel4g-wlcIVWqKX5x_rKP2PLhm_IDxV1WLsGK44tU5QFWcCGA_HNWDyPR85dD_6J8gbp_t28li54mWPzuzVd2Z2aXCRNZS7drsAFtf9EVgMXOFc-QudT0cUIRiwQ/mJz-wtnKcJVl45YkDkuoeDwuiCqCqTzR3CRWpggaT1Y",
    "price": 10.96,
    "prevClose": 10.945,
    "absReturn": 0.015000000000000568
  },
  {
    "fullTicker": "CSX:USA",
    "baseTicker": "CSX",
    "rank": 25.0081,
    "description": "CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services in the United States and Canada. It operates through two segments: rail and trucking. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/sxsjjvay4e7gYSt970AjZg/0scHm21wHS9Q7aCEvu3AO8EwXaqN26wNosyYvQungKKDRI-OWcUN_6tuCYIRr-VGmOMU-lLGh_089KWJNpbEoJ51u61FKKzSF9mrYVzc6acwE4sxSFpPKERSTA8rKzez56os3GndydlwNflL_mgVvpoVAM9aXK7jsglDrPmmKoE/Tu8O610T15CcofBgJ58VGQjYY800ic75RENsbBsi3zo",
    "price": 41.105,
    "prevClose": 40.9,
    "absReturn": 0.2049999999999983
  },
  {
    "fullTicker": "AGO:USA",
    "baseTicker": "AGO",
    "rank": 38.4603,
    "description": "Assured Guaranty Ltd., together with its subsidiaries, provides credit protection products to public finance and structured finance markets in the United States and internationally. It operates through two segments, Insurance and Asset Management. The company offers financial guaranty insurance that protects holders of debt instruments and other monetary obligations from defaults in scheduled payments. It also provides specialty insurance and reinsurance on transactions with risk profiles similar to those of its structured finance exposures written in financial guaranty form, as well as offers credit protection through reinsurance. In addition, the company insures and reinsures various the U.S. public finance obligations, such as general obligation, tax-backed, municipal utility, transportation, healthcare, higher education, infrastructure, housing revenue, investor-owned utility, renewable energy, and other public finance bonds. Further, the company involved in insuring and reinsuring of non-U.S. public finance obligations comprising regulated utilities, infrastructure finance, sovereign and sub-sovereign, renewable energy bonds, and pooled infrastructure obligations; and the U.S. and non-U.S. structured finance obligations, including residential mortgage-backed securities, life insurance transactions, consumer receivables securities, subscription finance facilities, pooled corporate obligations, and financial products. Additionally, it offers specialty business, such as diversified real estate, insurance securitizations, pooled corporate obligations, and aircraft residual value insurance (RVI) transactions; and asset management services comprising investment advisory services. It markets its financial guaranty insurance directly to issuers and underwriters of public finance and structured finance securities, as well as to investors. Assured Guaranty Ltd. was incorporated in 2003 and is headquartered in Hamilton, Bermuda.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/A1kfEU68QIMK9oS71x_fmA/SgORZczyAADdbx0LBaVDLtRRZLnNKMntpvxw4H3kgfF1U5L-uTonBocI2uKga3BwXsq_y1gGbgNet-Ocfj8-YrhwB0uQ2Tdlo4NH1QxXdlMWd5jXLt1260wj0qt_nOd6dAwEf4t2k8BhnQOnsCFErw7TQ_qdq4QcbkkaxR5_P-81Tz89L4ApKfoOSByz_gxt/vaguegzoP45okZWHVHwe0TiS2bTEAx6S15fYLTwMpsU",
    "price": 86.35,
    "prevClose": 86.55,
    "absReturn": -0.20000000000000284
  },
  {
    "fullTicker": "BIO:USA",
    "baseTicker": "BIO",
    "rank": 45.9968,
    "description": "Bio-Rad Laboratories, Inc. manufactures and distributes life science research and clinical diagnostic products in the United States, Europe, Asia, Canada, and Latin America. It operates through two segments, Life Science and Clinical Diagnostics. The company develops, manufactures, and markets instruments, systems, reagents, and consumables to separate, purify, characterize, and quantitate biological materials, such as cells, proteins, and nucleic acids used in biopharmaceutical manufacturing, quality control process, food safety, and science education applications. It also designs, manufactures, markets, and supports test systems, informatics systems, test kits, and specialized quality controls for hospitals, diagnostic reference, and transfusion and physician office laboratories. The company offers its products through its direct sales force, as well as through distributors, agents, brokers, and resellers. Bio-Rad Laboratories, Inc. was founded in 1952 and is headquartered in Hercules, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/a8BMQ7sBj0FzteUeFWkRgQ/FSrJqB3qcgRTHxCCpC1UYHuGtn97jsPIh6LtZcE2FWQB0sRU5zxDIzLgSb1Aqza0-50ExDPraNosfJzMtFO4__aXuhcEH-l9xyUMnVIW4IGmpGGhBRAAfAr0DEShKcJPzxOIiBxnzfj7-0vTLpcHy8Ika4DNAPVR3zrUnxk6gaqYTnITsdO0Q96nQSKR5weD/JWWPEReorDzGAP2qmHg2ntfy7e_Bjll-NY-3pYGwvwE",
    "price": 293.68,
    "prevClose": 299.96,
    "absReturn": -6.279999999999973
  },
  {
    "fullTicker": "TZOO:USA",
    "baseTicker": "TZOO",
    "rank": 55.5916,
    "description": "Travelzoo, together with its subsidiaries, operates as an Internet media company that provides travel, entertainment, and local experiences worldwide. It operates in four segments: Travelzoo North America, Travelzoo Europe, Jack's Flight Club, and New Initiatives. The company offers Travelzoo website, Travelzoo Top 20 email newsletters, Standalone email newsletters, Travelzoo Network, Travelzoo mobile applications, Jack's Flight Club website, Jack's Flight Club mobile applications, and Jack's Flight Club newsletters. The company's Travelzoo website and newsletters include local deals and getaways listings that allow members to purchase vouchers for offers from local businesses, such as spas, hotels, and restaurants; Jack's Flight Club, a subscription service that provides members with information about exceptional airfares; and Travelzoo Network, a network of third-party websites that list travel deals published by the company. It serves airlines, hotels, cruise lines, vacations packagers, tour operators, destinations, car rental companies, travel agents, theater and performing arts groups, restaurants, spas, and activity companies. Travelzoo Inc. was incorporated in 1998 and is headquartered in New York, New York.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/o5MMlcz00HBXoCD-RX0LSg/ahX4O9jUuYgM5_FZh-aZYNuRe84uoRvEVxZdI7ajZqY4qdCTyMOMePLOMlBcfFv0zWWWgF569jFqEuyHt9O265DTrAUtXjI6rkJIRD1HkJjsPHuHKFbHZY5jY8KmjsH4rGMDZnwUboktmQh4Ky_Mu0nl0fcpM4AjLxQ0VaAoxvU/B5-G2eIBCC4AhJJdD3STPCXKmVrjZSwja3SUKV_rQpY",
    "price": 5.365,
    "prevClose": 5.53,
    "absReturn": -0.16500000000000004
  },
  {
    "fullTicker": "KNSL:USA",
    "baseTicker": "KNSL",
    "rank": 70.2269,
    "description": "Kinsale Capital Group, Inc. engages in the provision of property and casualty insurance products in the United States. The company's commercial lines offerings include commercial property, excess casualty, small business casualty, general casualty, construction, allied health, small business property, products liability, entertainment, energy, life sciences, commercial auto, professional liability, excess professional, environmental, inland marine, health care, management liability, public entity, aviation, ocean marine, agribusiness, product recall, and railroad insurance. Its personal lines offerings also include high value homeowners and personal insurance products. The company sells its insurance products in all 50 states, the District of Columbia, the Commonwealth of Puerto Rico, and the U.S. Virgin Islands primarily through a network of independent insurance brokers. Kinsale Capital Group, Inc. was founded in 2009 and is headquartered in Richmond, Virginia.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/kKciEUnqHrGCozjZAcqmMw/nRCQjxweUrLTtAO1kF3fs8Gp03M_LQtYAhfK2LIVeRYPL_ZtX2FDc5Lv7ju10rEhXvlH_lQBIv_CsZu0PgjIRzn9idD6JND2vCGZ6dfIyvs-jxrPdjUgjJYIdBW3JpfwIq54h_KOIdOmOrN6mMXrl8F5Gxros1EjLFNCsaQ1CbIEKcyQ5FCAW_alefK85Vag/1I3iP6rtquqccICnzC9VU6_XqOMIZYHpfz6gs1WovXM",
    "price": 393.695,
    "prevClose": 398,
    "absReturn": -4.305000000000007
  },
  {
    "fullTicker": "IMPP:USA",
    "baseTicker": "IMPP",
    "rank": 79.3031,
    "description": "Imperial Petroleum Inc. provides international seaborne transportation services to oil producers, refineries, and commodities traders. It carries refined petroleum products, such as gasoline, diesel, fuel oil, and jet fuel, as well as edible oils and chemicals, crude oils, iron ore, coal and grains, and minor bulks, such as bauxite, phosphate, and fertilizers. As of April 1, 2024, the company owned and operated a fleet of six medium range refined petroleum product tankers; one Aframax tanker; two suezmax tankers; and two handysize drybulk carriers with a total capacity of 791,000 deadweight tons. The company was incorporated in 2021 and is based in Athens, Greece.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/Jex4E2PO7DKxcUzKU_XtWw/cAVnDRN1JG-zX01rr_a7e6LsFlfbi_FqktsnRA5yzgeMGz7LAmV5EsFzzMKIAie99yLvjuv-sw3MDauY3ae2A8hmJMBKRKQp-PPZONRPmRyjuSxbVlzLnk8FGCmKxs7n2-B3KNg4mDOg9TRR8AuRXc13Y93lLYuW8-EDXg7ZNHASb77DZRn0QQeaD273tTB_/xaGipUMXZ8TPuhuAHpOpn0_PrKqhAduoNyBBRAVhGag",
    "price": 3.64,
    "prevClose": 3.65,
    "absReturn": -0.009999999999999787
  },
  {
    "fullTicker": "BLKB:USA",
    "baseTicker": "BLKB",
    "rank": 94.6677,
    "description": "Blackbaud, Inc. engages in the provision of cloud software and services in the United States and internationally. The company offers fundraising and engagement solutions, including Blackbaud Raiser's Edge NXT, Blackbaud CRM, Blackbaud eTapestry, Blackbaud Luminate Online, Blackbaud TeamRaiser, JustGiving from Blackbaud, Blackbaud Fundraiser Performance Management, Blackbaud Altru, and Blackbaud Guided Fundraising; financial management solutions, such as Blackbaud Financial Edge NXT, Blackbaud Purchase Cards, Blackbaud Tuition Management, Blackbaud Financial Aid Management, and Blackbaud Billing Management; and grant and award management solutions, which includes Blackbaud Grantmaking and Blackbaud Award Management. It also offers education solutions, including Blackbaud Student Information System, Blackbaud Learning Management System, Blackbaud Enrollment Management System, and Blackbaud School Website System; social responsibility, employee giving, and volunteering solutions, such as YourCause GrantsConnect and YourCause CSRconnect, and Blackbaud Impact Edge; and payment services, which includes Blackbaud Merchant Services. In addition, the company provides data intelligence solutions; professional and managed services; and training solutions. The company sells its solutions and related services through its direct sales force. Blackbaud, Inc. was founded in 1981 and is headquartered in Charleston, South Carolina.",
    "logo": "https://v5.airtableusercontent.com/v3/u/50/50/1770832800000/UfCs_LypWHdXik31mOzAsw/gHWDxkE7kNmlykZ8r7_-mCgpNz4z3t44nBD0yuiX0VVPOEaENAO6bnH0--qcT2qKqr9gp-lS4ACnn5eCZZDoNdCRPvFNRzJkWPibNWe3NA_k4ZJsKcP3OoYmrHNVFBbYZpxs4k4mSxh3nql_IefKNZJDA50I5sF6JNPRdbXS7xg/0J4pBKiZJTpupCZxlBMnJBBUGCHMI8I5K4978DF0vDI",
    "price": 47,
    "prevClose": 47.68,
    "absReturn": -0.6799999999999997
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 691.27,
    "prevClose": 692.12,
    "absReturn": -0.8500000000000227
  }
]