[
  {
    "fullTicker": "DOW:USA",
    "baseTicker": "DOW",
    "rank": 2.8385,
    "description": "Dow Inc., through its subsidiaries, provides various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, propylene, polyethylene, and aromatics products; and other ethylene derivatives, such as polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubber. The Industrial Intermediates & Infrastructure segment offers polyurethanes, including propylene oxide, propylene glycol, and polyether polyols; aromatic isocyanates and fully formulated polyurethane systems; and chlor-alkali and vinyl comprising chlorine and caustic soda, ethylene dichloride, and vinyl chloride monomer; and construction chemicals consisting of cellulose ethers, redispersible latex powders, and acrylic emulsions, as well as coatings, adhesives, sealants, elastomers, and composites. The Performance Materials & Coatings segment provides architectural paints and coatings, and industrial coatings; and acrylics-based building blocks, silicon metals, siloxanes, and intermediates. The company also engages in the property and casualty insurance, as well as reinsurance business. Dow Inc. was founded in 1897 and is headquartered in Midland, Michigan.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/jf_vOzlqVsHGKGcFcBiqtQ/VOi3Ib8YHvKDKsjc3Kjqeo1tEfNCb3kZQ59BtJQ5ihYlqyzD47UC98UBqtKIhbI85TfCqFF7msv_Cl8DUJ8j-ZCruMFLFeny7y20BLrPz8jcBVxCoPh9kuq9219ebqcvoax4zJyyH9H1plTq26I9dxqKHDABDgGczG_OTIczXIY/mBDfCYS32gcssrLakRrWPwIA8iD5zbA8Nt_3jjweDKU",
    "price": 28.395,
    "prevClose": 28.67,
    "absReturn": -0.27500000000000213
  },
  {
    "fullTicker": "RYAN:USA",
    "baseTicker": "RYAN",
    "rank": 10.9745,
    "description": "Ryan Specialty Holdings, Inc. operates as a service provider of specialty products and solutions for insurance brokers, agents, and carriers in the United States, Canada, the United Kingdom, rest of Europe, India, and Singapore. The company offers distribution, underwriting, product development, administration, and risk management services by acting as a wholesale broker and a managing underwriter. It serves commercial, industrial, institutional, and government sectors. The company was founded in 2010 and is headquartered in Chicago, Illinois.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/3olAztKrJXi8aijPqCTmwQ/nYSdNfl8i1L8LTwEURR6OsxBqgfwPWp3KyECZqT8c6mTs_hDoDPSbxrw5Y72iZ2wUPAj1hf2rRsHqf8gPc3yZfLCdLhX7ZemTTXf4ezjDPuITBKuK6LaO8yKPW--RkUSKGlAr9fntr12-TR2lhFci-loQF2_-9Yw0ZTi7q6ecACTFzzFIU8VJvYXafc1yGf1/NsbQKHTGmKcps9dMC7ygoNT8svGvGIZ83SirDp-laq4",
    "price": 68.765,
    "prevClose": 68.72,
    "absReturn": 0.045000000000001705
  },
  {
    "fullTicker": "TVGN:USA",
    "baseTicker": "TVGN",
    "rank": 17.3206,
    "description": "Tevogen Bio Holdings Inc. operates as a clinical-stage specialty immunotherapy company that develops off-the-shelf precision T cell therapies for the treatment of infectious diseases, cancers, and neurological disorders. The company develops TVGN 489, which has completed Phase 1 clinical trial for the treatment and prevention of chronic lingering symptoms of the disease (Long COVID), as well as COVID-19 in B cell immune suppressed acute COVID-19 patients without a B cell cancer indication, elderly and infirm acute COVID-19 patients, and acute COVID-19 in patients on T cell suppressing drugs, including solid organ transplant patients. It is also developing TVGN 601 for treating multiple sclerosis; TVGN 930 for the treatment of Epstein-Barr virus associated lymphomas; TVGN 920 for treating cervical cancer; and TVGN 960 for the treatment of mouth and throat cancer. The company was founded in 2020 and is headquartered in Warren, New Jersey.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/nUtGV0u0o0rsWYk8JkLB-g/zSQhAbGo9ZJ0LSzxW7O-eAImtJaM94pr5UjWFr6_zgDiX6xY7Y8BrmVj07hNTrH_K1V1JNcfx0R1MIL2M6HV7305RV90wz6_O78hWw1ZXuCFFBTc1ZrddQ0Qalx3vV3zf8UvCNzL1SThYiL4Vyex2Tu_RsbywePsTiP08_865NtwI6f6TVItoKWyg7NKpf9z/gryI-hHOABn-FgH3Vp6ullKu9CvjpE59vL3-kNsH1BM",
    "price": 1.295,
    "prevClose": 1.23,
    "absReturn": 0.06499999999999995
  },
  {
    "fullTicker": "DAR:USA",
    "baseTicker": "DAR",
    "rank": 26.8668,
    "description": "Darling Ingredients Inc. develops, produces, and sells natural ingredients from edible and inedible bio-nutrients in North America, Europe, China, South America, and internationally. The company operates through three segments: Feed Ingredients, Food Ingredients, and Fuel Ingredients. It offers ingredients and customized specialty solutions for customers in the pharmaceutical, food, pet food, feed, industrial, fuel, bioenergy, and fertilizer industries. The company also collects and transforms various animal by-product streams into useable and specialty ingredients, such as collagen, edible fats, feed-grade fats, animal proteins and meals, plasma, pet food ingredients, organic fertilizers, yellow grease, fuel feedstock, green energy, natural casings, and hides. In addition, it recovers and converts used cooking oil and animal fats, and residual bakery products into valuable feed ingredients. Further, the company provides environmental services, including grease trap collection and disposal services to food service establishments. It primarily operates under the Rendac, Sonac, FASA, Ecoson, Rousselot, Gelnex, and CTH brands. The company was formerly known as Darling International Inc. and changed its name to Darling Ingredients Inc. in May 2014. Darling Ingredients Inc. was founded in 1882 and is headquartered in Irving, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/WK0MV_3-jS2Y5nchRcHpdA/f0-0Ei1XsE39QtKbFtVIfvwVRDjZ1IS15D1O_4ZWFUNN6fImeSh8dqrdzrEtPCU5qkJY5F0nz5bvHBNi8vx_33laEfYuXqna8WE5p8BqoUnXWAMKWdsHvMGsc1Opza3OIps97ExOZ8EmSe0bbJgrnuWIoDkiUjVOVvNpaHoIlhRi78k-Pgl96I23_jlIOOo-/kaKJN0GB3CSrTQSj2pz9GhnoeuAPx4CpxHgKQHuOF34",
    "price": 31.58,
    "prevClose": 31.71,
    "absReturn": -0.13000000000000256
  },
  {
    "fullTicker": "AOSL:USA",
    "baseTicker": "AOSL",
    "rank": 32.9597,
    "description": "Alpha and Omega Semiconductor Limited designs, develops, and supplies power semiconductor products for computing, consumer electronics, communication, and industrial applications in Hong Kong, China, South Korea, the United States, and internationally. It offers power discrete products, including metal-oxide-semiconductor field-effect transistors (MOSFET), SRFETs, XSFET, electrostatic discharge, protected MOSFETs, high and mid-voltage MOSFETs, and insulated gate bipolar transistors for use in smart phone chargers, battery packs, notebooks, desktop and servers, data centers, base stations, graphics card, game boxes, TVs, AC adapters, power supplies, motor control, power tools, E-vehicles, white goods and industrial motor drives, UPS systems, solar inverters, and industrial welding. The company also provides power ICs that deliver power, as well as control and regulate the power management variables, such as the flow of current and level of voltage. Its power ICs are used in flat panel displays, TVs, notebooks, graphic cards, servers, DVD/Blu-Ray players, set-top boxes, and networking equipment. In addition, the company offers transient voltage suppressors, analog switch, and electromagnetic interference filter for notebooks, desktop PCs, tablets, flat panel displays, TVs, smart phones, and portable electronic devices; and 650V and 1200V SiC MOSFET. Alpha and Omega Semiconductor Limited was incorporated in 2000 and is headquartered in Sunnyvale, California.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/L3Sl-Jkj8V-pPtlS73svRg/Zpy8FklHDMpIvgX8S06W41ozL7hXk16nHpZSc_Vc9_58SGJpnEv5K7UisrbwUJthbSNy7_s_Xb68slDQ6M96nCphgI9lwzoRiSV5ryLf9HVXe4STTM-ZOwsoQJy7mdnDFeF-UZkpYpz_UbFj58wwp_AeUZWZBYQU6230M5o3o-Z7OBPxS79AhTx3o8Y1tY4l/-wnh98q8vSTnyfRnwacoRXYF2QXqN4kAHSVNwbz1hwc",
    "price": 20.755,
    "prevClose": 21.11,
    "absReturn": -0.3550000000000004
  },
  {
    "fullTicker": "AVNW:USA",
    "baseTicker": "AVNW",
    "rank": 40.3363,
    "description": "Aviat Networks, Inc. provides microwave networking and wireless access networking solutions in North America, Africa, the Middle East, Europe, Latin America, and the Asia Pacific. The company offers outdoor, indoor, and split-mount radios; microwave routers, and trunking; private LTE, virtual fiber, and network management products; narrow band radio communications, designed, and optimised for SCADA and telemetry applications; and hosted software products, such as aviat design, frequency assurance software, aviatcloud, and health assurance software. It also provides project services, which includes design and engineering, site and path surveys, assembly and integrations, project management, and install and commission; and managed services, such as network and interface monitoring, network health, onsite maintenance, and remote upgrades. In addition, the company offers support services, including extended warranty, warranty plus, provision support, and license key management, as well as instructor and virtual instructor led training, e-learning and certification services. It serves communications service providers and private network operators, including federal, state and local government agencies, transportation agencies, energy and utility companies, public safety agencies, and broadcast network operators. The company markets its products through a direct sales, service, and support organization; indirect sales channels comprising dealers, resellers, and sales representatives; and through online. Aviat Networks, Inc. company was incorporated in 2006 and is headquartered in Austin, Texas.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/MGOYnefxUzRR37hEXZC0CQ/r7Fp9ZQH9GVttw4pfu0IAlQEV5lQWaBt_ArmuQ9N0njO2RO1SkHGSfAAPmAzZFaPCWcaKk2tXEBeorHR2xhv3By4JEJnMKTFfZpIq6hR-iS-vtGLfEmyxCpUnFQah5vwr_h0-b3xtyNriYAeSfXyjRvB46k1Tqiacd-DsAySAU_Z6uPQyCJku6je1yBTEZKB/IYBIXj_5R4lSG7DOZIfNmjpOCQ48s9q6J2fNSj5Kkz8",
    "price": 20.3,
    "prevClose": 20.88,
    "absReturn": -0.5799999999999983
  },
  {
    "fullTicker": "GDEN:USA",
    "baseTicker": "GDEN",
    "rank": 54.1855,
    "description": "Golden Entertainment, Inc. owns and operates a diversified entertainment platform in the United States. The company operates through three segments: Nevada Casino Resorts, Nevada Locals Casinos, and Nevada Taverns. It also operates casino, casino resorts, and taverns. Golden Entertainment, Inc. was incorporated in 1998 and is headquartered in Las Vegas, Nevada.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/gRXRWjdGSgl9EO1oQZdP2g/tVudRPByLccfVK_pkJbsE4bKNSisMeRoLdyABhPs7QJfWOzeRHgOg-6ftdxvlQkwiycIX2fILO2CJXbRpRjXBzunw3a8eFvGgje3XKnaSGc8Pk3gujMJroJZ0p5Fdpf0DrVDgDfCj3P6ycIo3ev0l4FfwPlQO6avvUzJ_mmw7MmP69inrz1CPBxFMOaVC9Ez/j8wmZmCVQvNWo4l5_1xD75s9k45KoPnnEU2OfkGo74Y",
    "price": 28.24,
    "prevClose": 28.11,
    "absReturn": 0.129999999999999
  },
  {
    "fullTicker": "WSBF:USA",
    "baseTicker": "WSBF",
    "rank": 67.9082,
    "description": "Waterstone Financial, Inc. operates as a bank holding company for WaterStone Bank SSB that provides various financial services to customers in southeastern Wisconsin, the United States. It operates in two segments, Community Banking and Mortgage Banking. The Community Banking segment offers consumer and business banking products and services, such as deposit and transactional solutions, such as checking, credit, debit and pre-paid cards, online banking and bill pay, and money transfer services; investable funds solutions, such as savings, money market deposits, individual retirement accounts, and certificates of deposit; residential mortgages, home equity loans and lines of credit, personal and installment loans, real estate financing, business loans, and business lines of credit; and fixed and variable annuities, insurance products, and trust and investment management accounts. It also provides transaction deposits, interest bearing transaction accounts, demand deposits, non-interest-bearing demand accounts, and time deposits; secured and unsecured lines; commercial real estate construction loans; term loans for working capital, inventory, and general corporate use; and personal term loans and investment services. The Mortgage Banking segment offers residential mortgage loans for the purpose of sale in the secondary market. It also invests in a portfolio of securities include mortgage-backed securities, government-sponsored and private-label enterprise bonds, collateralized mortgage obligations, municipal obligations, and other debt securities. The company was formerly known as Wauwatosa Holdings, Inc. and changed its name to Waterstone Financial, Inc. in August 2008. The company was founded in 1921 and is based in Wauwatosa, Wisconsin.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/mNohm3aS6rVMmQ8IexL4Rg/SHN73sDpIxmyhRf26_5VUlthpPdodIXbv8qN6aMvetK-U5Yb8G9DdkF6cUGiVzerS-78Mm04ukCH3eJGSjljFCR2xVCmSPfyVCCLzxUHL4yRR92lvO71iBnM1dvcVndkDQCsg_LvQqd-KBTnH3Y-y3YLNxkrFt84ASpxe1utLYNd_qyPZ5l1WMNaJFLf1nac/kgu7BY3OnmJB6Oi-0sxWj8c5-PZYp3Y8gpV4nvOWM1s",
    "price": 12.63,
    "prevClose": 12.65,
    "absReturn": -0.019999999999999574
  },
  {
    "fullTicker": "WRB:USA",
    "baseTicker": "WRB",
    "rank": 76.4961,
    "description": "W. R. Berkley Corporation, an insurance holding company, operates as a commercial line writer worldwide. The company operates in two segments, Insurance, and Reinsurance & Monoline Excess. The Insurance segment underwrites commercial insurance business, including excess and surplus lines, admitted lines, and specialty personal lines. This segment also provides accident and health insurance and reinsurance products; insurance for commercial risks; casualty and specialty environmental products; insurance coverages for fine arts and jewelry exposures; excess liability and inland marine coverage for small to medium-sized insureds; and commercial general liability, umbrella, professional liability, directors and officers, commercial property, and surety products, as well as products for technology, and life sciences and travel industries. In addition, it offers cyber risk solutions; crime and fidelity insurance products; medical professional coverages; workers' compensation insurance products; management liability and general insurance products; personal lines insurance solutions, including home, condo/co-op, auto, fine arts and collectibles, liability, collector vehicle, and recreational marine; law enforcement, public officials and educator's legal, and employment practices liability, as well as incidental medical, property, and crime insurance products; at-risk and alternative risk insurance program management services; professional liability; energy and marine risks; and insurance products to the Lloyd's marketplace. The Reinsurance & Monoline Excess segment provides treaty and facultative reinsurance solutions; property and casualty reinsurance products; facultative reinsurance products include automatic, semi-automatic, and individual risk assumed reinsurance; and turnkey products, such as cyber, employment practices liability insurance, liquor liability insurance and violent events. The company was founded in 1967 and is headquartered in Greenwich, Connecticut.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/dpaRdkDD8B-UiC4gzy1GXg/xFj4F4Y-H2EZCCembS9Yl71GyceDMFwgc1rpf261RzqUX9a7IUoDFw4-cHJwvMzfM4YMTe3PRocuKYC-ILPwkMs9MLFBP3tGtmXAzLiFaRvcUopUpTnK4_G0lSFfVsTW22wdS1Eqpja5gSRT8qZ2KP7Z8Esw_R7bYeKZIpDIaJuwBHKYHciQ4txEvhuMKl-0/CB4IyBCHlUrT6HEez_-FWK9cR9XquzDYIYPBCtDXm6k",
    "price": 73.1,
    "prevClose": 72.19,
    "absReturn": 0.9099999999999966
  },
  {
    "fullTicker": "ARTNA:USA",
    "baseTicker": "ARTNA",
    "rank": 85.3734,
    "description": "Artesian Resources Corporation, through its subsidiaries, provides water, wastewater, and other services in Delaware, Maryland, and Pennsylvania. The company distributes and sells water to residential, commercial, industrial, governmental, municipal, and utility customers, as well as for public and private fire protection in the states of Delaware, Maryland, and Pennsylvania; and offers wastewater collection, treatment infrastructure, and wastewater services to customers in Delaware. It also provides contract water and wastewater services; water, sewer, and internal service line protection plans; and wastewater management services, as well as design, construction, and engineering services. In addition, the company offers services to other water utilities, including operations and billing functions; owns real estate properties, including land for office buildings, a water treatment plant, and wastewater facility; and provides design, installation, maintenance, and repair services related to existing or proposed storm water management systems. As of December 31, 2023, it served approximately 95,900 customers in Delaware; 2,600 customers in Maryland; and 40 customers in Pennsylvania through 1,470 miles of transmission and distribution mains. Artesian Resources Corporation was founded in 1905 and is headquartered in Newark, Delaware.",
    "logo": "https://v5.airtableusercontent.com/v3/u/41/41/1748037600000/jACr9t9ol6-iOSJU5yrehw/8VlJ_vwoSZnQ3D0_YmwgOhy-8_ni8kxymFAHrPXQLxTw61Wg0a3vTk15IrflcuwRBWiFZI-tHaezClyntCtG_Ge7NYAW-QTrgoQFZbyo9usZ7wLh6W25J5WlDI5qIocpeQNBi3k5BgS64NNfPhYzC1Fz6K4J0EdrF2jW_vZ_nU8Hxz64fbqMv03gyBYteQGH/Mhr9jGl0XoeA8NUQJsG7rynaVBX-oUjborLthTegTRM",
    "price": 33.895,
    "prevClose": 33.91,
    "absReturn": -0.014999999999993463
  },
  {
    "fullTicker": "SPY",
    "baseTicker": "SPY",
    "rank": "",
    "description": "",
    "logo": "sp500.png",
    "price": 580.26,
    "prevClose": 583.09,
    "absReturn": -2.830000000000041
  }
]